#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает последнюю по дате заявку на кредит по выписке в статусе "Отправлено"
// для указанной организации.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - организация, для которой выполняется поиск заявки
//
// Возвращаемое значение:
//   ДокументСсылка.ЗаявкаНаКредитПоВыписке - последняя по дате заявка в статусе "Отправлено"
//   - Неопределено - если заявок в указанном статусе для организации не найдено
//
Функция ЗаявкаВСтатусеОтправлено(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СостояниеЗаявокНаКредит.ЗаявкаНаКредит КАК ЗаявкаНаКредит
		|ИЗ
		|	РегистрСведений.СостояниеЗаявокНаКредит КАК СостояниеЗаявокНаКредит
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаКредитПоВыписке КАК ЗаявкаНаКредитПоВыписке
		|		ПО СостояниеЗаявокНаКредит.ЗаявкаНаКредит = ЗаявкаНаКредитПоВыписке.Ссылка
		|ГДЕ
		|	СостояниеЗаявокНаКредит.Состояние = &Состояние
		|	И ЗаявкаНаКредитПоВыписке.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаявкаНаКредитПоВыписке.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияЗаявокНаКредит.Отправлено); 
	Запрос.УстановитьПараметр("Организация", Организация);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ЗаявкаНаКредит;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает количество месяцев, за которое производится выборка документов Списание на расчетный счет.
//
// Возвращаемое значение:
//   Число - количество месяцев выборки
//
Функция КоличествоМесяцевВыборкиДокументов() Экспорт
	Возврат 3;
КонецФункции

// Возвращает соответствие статусов заявок на кредит.
//
// Возвращаемое значение:
//   Соответствие - соответствие статусов заявок на кредит.
//     * Ключ - Строка - статус заявки на кредит в сервисе.
//     * Значение - ПеречислениеСсылка.СостоянияЗаявокНаКредит - статус заявки на кредит в программе.
//
Функция СоответствиеСтатусовЗаявок() Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить("IN_PROGRESS", Перечисления.СостоянияЗаявокНаКредит.ОжидаетРешения);
	Результат.Вставить("APPROVED", Перечисления.СостоянияЗаявокНаКредит.Одобрено);
	Результат.Вставить("REJECTED", Перечисления.СостоянияЗаявокНаКредит.Отказано);
	Результат.Вставить("AUTHORIZATION", Перечисления.СостоянияЗаявокНаКредит.Отправлено);
	Результат.Вставить("CONFIRMATION", Перечисления.СостоянияЗаявокНаКредит.ОжидаетПодтверждения);
	Результат.Вставить("SIGNING", Перечисления.СостоянияЗаявокНаКредит.Подписание);

	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ПолучитьПредложенияВСервисе", Истина);
	Методы.Вставить("ОтправитьЗаявку", Истина);
		
КонецПроцедуры

// Отправляет заявку на кредит по выписке в банк и сохраняет результаты обработки.
//
// Параметры:
//   Параметры - Структура - параметры отправки заявки:
//     * ПараметрыЗаявки - Структура - структура данных заявки, подготовленная для отправки
//     * Организация - см. Документ.ЗаявкаНаКредитПоВыписке.Организация
//     * Банк - см. Документ.ЗаявкаНаКредитПоВыписке.Банк
//     * Лимит - Число - сумма лимита по заявке
//     * СуммаЗаявки - Число - запрашиваемая сумма кредита
//     * ЗаявкаНаКредитПоВыписке - см. Документ.ЗаявкаНаКредитПоВыписке
//
// Возвращаемое значение:
//   Структура - результат отправки заявки:
//     * Выполнено - Булево - признак успешной отправки заявки
//     * ОписаниеОшибки - Строка - текст ошибки отправки, пустая строка при успешной отправке
//     * СсылкаНаЗаявку - Строка - ссылка на заявку, полученная от банка
//
Функция ОтправитьЗаявку(Параметры) Экспорт
		
	ПараметрыЗаявки = ДанныеДляОтправки(Параметры);

	Результат = Новый Структура;
	Результат.Вставить("Выполнено",      Ложь);
	Результат.Вставить("ОписаниеОшибки", "");
	Результат.Вставить("СсылкаНаЗаявку", "");
	
	ДлительныеОперации.СообщитьПрогресс(50,
		НСтр("ru = 'Отправка заявки...'"));

	ПреобразоватьСтруктуруЗапроса(ПараметрыЗаявки);
	СтрокаТелаЗапроса = ОбщегоНазначения.ЗначениеВJSON(ПараметрыЗаявки);
	РезультатВыполненияЗапроса = РезультатВыполненияЗапроса("applications", "POST", СтрокаТелаЗапроса);
	Если НЕ РезультатВыполненияЗапроса.Выполнено Тогда
		
		// Открывающая фигурная скобка служит маркером для переноса информации в раздел Подробнее
		Результат.Выполнено = Ложь;
		ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Заявка не отправлена. Попробуйте повторить отправку позднее. {%1'"),
			РезультатВыполненияЗапроса.ОписаниеОшибки);
		Результат.ОписаниеОшибки = ОписаниеОшибки;
		Возврат Результат;

	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(75,
		НСтр("ru = 'Ожидание ответа от банка...'"));

	ДанныеЗаявки = НовыйСтруктураЗаявки();
	ЗаполнитьДанныеЗаявки(ДанныеЗаявки, РезультатВыполненияЗапроса.ТелоОтвета);
	
	ДлительныеОперации.СообщитьПрогресс(99,
		НСтр("ru = 'Перенаправление на страницу банка...'"));
		
	ЗаполнитьЗначенияСвойств(ДанныеЗаявки, Параметры, "Организация, Банк, Лимит, СуммаЗаявки, ЗаявкаНаКредитПоВыписке");
	РегистрыСведений.СостояниеЗаявокНаКредит.ОбновитьИнформациюЗаявкиНаКредитПоВыписке(ДанныеЗаявки);

	Результат.Выполнено = Истина;
	Результат.СсылкаНаЗаявку = ДанныеЗаявки.СсылкаНаЗаявку;
	
	ОтправитьСтатистикуПоЗаявке(Параметры, 1);

	ЗаявкиНаКредитПоВыписке.ОпределитьНеобходимостьРегЗаданияПолученияСтатусов(Истина);

	Возврат Результат;
	
КонецФункции

// Получает предложения из сервиса.
//
// Параметры:
//   Параметры - Структура - параметры запроса предложений
//
Функция ПолучитьПредложенияВСервисе(Параметры) Экспорт
	
	Возврат ДанныеПредложенийВСервисе();
	
КонецФункции

// Подготавливает данные для отправки в сервис .
//
// Параметры:
//   Параметры - Структура - данные заявки
//
Функция ДанныеДляОтправки(Параметры)
	
	ДлительныеОперации.СообщитьПрогресс(25, НСтр("ru = 'Подготовка информации заявки...'"));

	РеквизитыСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.СчетОрганизации, "НомерСчета, Банк"); 
	РеквизитыБанка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыСчета.Банк, "Код, КоррСчет, Наименование"); 
	
	ЗапрашиваемыеРеквизиты = "НаимЮЛПол,ОГРН,ИННЮЛ,КППЮЛ,ТелОрганизации";
	
	ДанныеОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
			Параметры.Организация,
			,
			ЗапрашиваемыеРеквизиты);
	ЮридическоеФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Организация, "ЮридическоеФизическоеЛицо");
	ПараметрыЗаявки = НовыйПараметрыЗаявки();
	ПараметрыЗаявки.СуммаЗаявки = XMLСтрока(Параметры.СуммаЗаявки);
	ПараметрыЗаявки.БИКБанка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Банк, "Код");
	ПараметрыЗаявки.ТипПродукта = ТипПродуктаКредитПоВыписке();
	ПараметрыЗаявки.БИКБанкаСчета = РеквизитыБанка.Код;
	ПараметрыЗаявки.КоррСчет = РеквизитыБанка.КоррСчет;
	ПараметрыЗаявки.НаименованиеБанка = РеквизитыБанка.Наименование;
	ПараметрыЗаявки.СчетОрганизации = РеквизитыСчета.НомерСчета;
	ПараметрыЗаявки.СчетОрганизацииВДругомБанке = РеквизитыСчета.НомерСчета; 
	ПараметрыЗаявки.ТипЗаемщика = ТипЗаемщика(ЮридическоеФизическоеЛицо);
	ПараметрыЗаявки.ИНН = ДанныеОрганизации.ИННЮЛ;
	ПараметрыЗаявки.КПП = ДанныеОрганизации.КППЮЛ;
	ПараметрыЗаявки.ИННПолучателя = ДанныеОрганизации.ИННЮЛ;
	ПараметрыЗаявки.КПППолучателя = ДанныеОрганизации.КППЮЛ;
	ПараметрыЗаявки.ОГРН = ДанныеОрганизации.ОГРН;
	ПараметрыЗаявки.ТелефонКонтактногоЛица = ДанныеОрганизации.ТелОрганизации; 
	ПараметрыЗаявки.Наименование = ДанныеОрганизации.НаимЮЛПол;
	ПараметрыЗаявки.ТипПеревода = ТипПеревода(Параметры.ИННБанка, РеквизитыСчета.Банк);
	
	Возврат  ПараметрыЗаявки;

КонецФункции

// Возвращает сведения о текущем состоянии заявки на кредит из регистра сведений.
//   Если запись в регистре отсутствует, возвращает структуру со значениями по умолчанию.
//
// Параметры:
//   Ссылка - ДокументСсылка.ЗаявкаНаКредитПоВыписке - ссылка на заявку на кредит
//
// Возвращаемое значение:
//   Структура:
//     * Состояние - ПеречислениеСсылка.СостоянияЗаявокНаКредит - текущее состояние заявки
//     * Новое - Булево - признак нового (непрочитанного) состояния
//     * ПодробностиРешения - ХранилищеЗначения - подробности решения по заявке
//     * СуммаЗаявки - Число - сумма заявки на кредит
//
Функция СведенияОСостоянииЗаявки(Ссылка) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Состояние", Перечисления.СостоянияЗаявокНаКредит.Черновик);
	Результат.Вставить("Новое", Ложь);
	Результат.Вставить("ПодробностиРешения", Неопределено);
	Результат.Вставить("СуммаЗаявки", 0);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостояниеЗаявокНаКредит.Состояние КАК Состояние,
		|	СостояниеЗаявокНаКредит.ПодробностиРешения КАК ПодробностиРешения,
		|	СостояниеЗаявокНаКредит.Новое КАК Новое,
		|	СостояниеЗаявокНаКредит.СуммаЗаявки КАК СуммаЗаявки
		|ИЗ
		|	РегистрСведений.СостояниеЗаявокНаКредит КАК СостояниеЗаявокНаКредит
		|ГДЕ
		|	СостояниеЗаявокНаКредит.ЗаявкаНаКредит = &ЗаявкаНаКредит";
	
	Запрос.УстановитьПараметр("ЗаявкаНаКредит", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
	КонецЕсли;;
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив банков по ИНН
//
// Параметры:
//  ИННБанка - Строка - ИНН банка
//
// Возвращаемое значение:
//  Массив - массив банков
//
Функция БанкиПоИНН(ИННБанка) Экспорт
	
	Результат = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ИННБанка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Банки.Ссылка КАК Банк
	|ИЗ
	|	Справочник.Банки КАК Банки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
	|		ПО Банки.Код = КлассификаторБанков.Код
	|			И Банки.КоррСчет = КлассификаторБанков.КоррСчет
	|			И (НЕ КлассификаторБанков.ДеятельностьПрекращена)
	|ГДЕ
	|	КлассификаторБанков.ИНН = &ИННБанка";
	
	Запрос.УстановитьПараметр("ИННБанка", ИННБанка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Банк");
	
КонецФункции

// Преобразует имя формы в имя формы по умолчанию
//
// Параметры:
//  ИмяФормы - Строка - имя формы, которое нужно преобразовать
//
// Возвращаемое значение:
//  Строка - имя формы по умолчанию
//
Процедура ПреобразоватьИмяФормы(ИмяФормы) Экспорт
	
	НаименованиеФормы = СтрЗаменить(ИмяФормы, "РегистрСведений.СостояниеЗаявокНаКредит.Форма.", "");
	НаименованиеФормы = СтрЗаменить(НаименованиеФормы, ".Форма.ФормаСписка", "");  
	НаименованиеФормы = СтрЗаменить(НаименованиеФормы, ".Форма.ФормаДокумента", "");
	НаименованиеФормы = СтрЗаменить(НаименованиеФормы, "ЖурналДокументов.Деньги.Форма.", "");
	НаименованиеФормы = СтрЗаменить(НаименованиеФормы, ".Форма", "");
	
	ИмяФормы = НаименованиеФормы;
	
КонецПроцедуры

// Возвращает структуру данных для статистики
//
// Возвращаемое значение:
//  Структура
//
Функция НовыйСтруктураДанныхСтатистики() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяКонфигурации", ЗаявкиНаКредитПоВыпискеПереопределяемый.ИмяКонфигурации());
	Результат.Вставить("ИмяФормы", "");
	Результат.Вставить("Банк", ""); 
	Результат.Вставить("Организация", "");
	Результат.Вставить("Создание", 0);
	Результат.Вставить("Отправлено", 0);
	Результат.Вставить("Отказано", 0);
	Результат.Вставить("Одобрено", 0);
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру данных заявки на кредит.
//
// Возвращаемое значение:
//   Структура - структура данных заявки на кредит.
//    
Функция НовыйСтруктураЗаявки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("БИКБанка", "");
	Результат.Вставить("ИдентификаторЗаявки", "");
	Результат.Вставить("Статус", "");
	Результат.Вставить("ПояснениеКСтатусу", "");
	Результат.Вставить("КодПродукта", "");
	Результат.Вставить("ТипПродуктаЗаявки", "");  
	Результат.Вставить("СсылкаНаЗаявку", "");
	Результат.Вставить("ИНН", "");
	Результат.Вставить("ОписаниеОшибки", "");
	Результат.Вставить("Лимит", 0);   
	Результат.Вставить("СуммаЗаявки", "");
	Результат.Вставить("Банк", Справочники.Банки.ПустаяСсылка());
	Результат.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Результат.Вставить("ЗаявкаНаКредитПоВыписке", Документы.ЗаявкаНаКредитПоВыписке.ПустаяСсылка());
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДанныеЗаявки(ДанныеЗаявки, ДанныеОтветаСервера) Экспорт
	
	СтруктураОтветаСервера = ОбщегоНазначения.JSONВЗначение(ДанныеОтветаСервера, , Ложь);
	Если ТипЗнч(СтруктураОтветаСервера) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	СтруктураИменПолейОтветаБанка = СтруктураИменПолейОтветаБанка();
	Для Каждого ЭлементСтруктуры Из ДанныеЗаявки Цикл
		ИмяРеквизита = "";
		Если СтруктураИменПолейОтветаБанка.Свойство(ЭлементСтруктуры.Ключ, ИмяРеквизита) Тогда
			ЗначениеРеквизита = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураОтветаСервера, ИмяРеквизита, "");
			ДанныеЗаявки[ЭлементСтруктуры.Ключ] = ЗначениеРеквизита;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеЗаявки.СуммаЗаявки = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ДанныеЗаявки.СуммаЗаявки);
	
КонецПроцедуры

Процедура ОтправитьСтатистикуПоЗаявке(Параметры, Отправлено = 0, Отказано = 0, Одобрено = 0) Экспорт
	
	Если ОбщегоНазначения.РежимОтладки() 
		Или БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		Возврат;
	КонецЕсли;
	
	ПреобразоватьИмяФормы(Параметры.ФормаИсточник);
	ДанныеСтатистики = НовыйСтруктураДанныхСтатистики();
	ДанныеСтатистики.ИмяФормы = Параметры.ФормаИсточник; 
	ДанныеСтатистики.Банк = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Банк, "Наименование"); 
	ДанныеСтатистики.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Организация, "ИНН");
	ДанныеСтатистики.Отправлено = Отправлено;
	ДанныеСтатистики.Отказано = Отказано;
	ДанныеСтатистики.Одобрено = Одобрено;
	
	СтруктураДанныхСтатистики = Новый Структура;
	СтруктураДанныхСтатистики.Вставить("СтатистикаКредитПоВыписке", 
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеСтатистики));

	СервисОбменаСБанками = Перечисления.СервисыОбменаСБанками.ЗаявкиНаКредитПоВыписке;
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("СервисОбменаСБанками", СервисОбменаСБанками);
	ПараметрыПроцедуры.Вставить("СодержимоеСтатистики", СтруктураДанныхСтатистики);
	ПараметрыПроцедуры.Вставить("ТокенАвторизации", "");

	ЗаявкиНаКредитПоВыпискеПереопределяемый.ОтправитьСтатистикуВСервис(ПараметрыПроцедуры, "");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаДокумента"
		И ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;
	
	Значение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Ключ");
	
	СтандартнаяОбработка = Ложь;
	Если Значение = Неопределено Тогда
		ВыбраннаяФорма = "ФормаДокумента";
	Иначе
		СведенияОСостоянииЗаявки = СведенияОСостоянииЗаявки(Параметры.Ключ);
		Если СведенияОСостоянииЗаявки.Состояние = Перечисления.СостоянияЗаявокНаКредит.Черновик Тогда
			ВыбраннаяФорма = "ФормаДокумента";
		Иначе
			ВыбраннаяФорма = "ФормаОтправленнойЗаявки";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПреобразоватьСтруктуруЗапроса(ПараметрыЗаявки) 
	
	Результат = Новый Структура();
	СтруктураИменПолейОтветаБанка = СтруктураИменПолейОтветаБанка();
	Для Каждого ЭлементСтруктуры Из ПараметрыЗаявки Цикл
		ИмяРеквизита = "";
		Если СтруктураИменПолейОтветаБанка.Свойство(ЭлементСтруктуры.Ключ, ИмяРеквизита) Тогда 
			Результат.Вставить(ИмяРеквизита, ПараметрыЗаявки[ЭлементСтруктуры.Ключ]);	
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЗаявки = Результат;
	
КонецПроцедуры

Функция ТипПеревода(ИННБанка, БанкСчета)
	
	МассивБанковПоИНН = БанкиПоИНН(ИННБанка);
	Если МассивБанковПоИНН.Найти(БанкСчета) <> Неопределено Тогда 
		Возврат "skipTransfer";
	Иначе 
		Возврат "transferTo3rdParty";
	КонецЕсли;
	
КонецФункции

Функция ТипПродуктаКредитПоВыписке()
		
	Возврат "INSTALLMENT";
	
КонецФункции

Функция ТипЗаемщика(ЮридическоеФизическоеЛицо)

	Если ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда 
		Возврат "individual";
	Иначе 
		Возврат "legal";
	КонецЕсли;
	
КонецФункции

Функция НовыйПараметрыЗаявки()
	
	Результат = Новый Структура;
	Результат.Вставить("СуммаЗаявки", "");
	Результат.Вставить("БИКБанка", ""); 
	Результат.Вставить("ТипЗаемщика", ""); 
	Результат.Вставить("ТипПродукта", "");
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("ИННПолучателя", "");
	Результат.Вставить("КПППолучателя", "");
	Результат.Вставить("ОГРН", "");
	Результат.Вставить("ТелефонКонтактногоЛица", "");
	Результат.Вставить("СчетОрганизации", "");
	Результат.Вставить("КоррСчет", "");
	Результат.Вставить("БИКБанкаСчета", "");
	Результат.Вставить("НаименованиеБанка", ""); 
	Результат.Вставить("СчетОрганизацииВДругомБанке", "");
	Результат.Вставить("Наименование", ""); 
	Результат.Вставить("ТипПеревода", "");
	
	Возврат Результат;
	
КонецФункции

Функция НовыйСтруктураПредложений()
	
	Результат = Новый Структура;
	Результат.Вставить("БИКБанка", "");
	Результат.Вставить("ИННБанка", "");
	Результат.Вставить("НаименованиеБанка", "");
	Результат.Вставить("Лимит", 0);
	Результат.Вставить("БелыйСписок", Новый Массив);
	Результат.Вставить("ЧерныйСписок", Новый Массив);
	Результат.Вставить("Банк", Справочники.Банки.ПустаяСсылка());
	Результат.Вставить("ДоступнаВыдачаНаСчетВДругомБанке", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйБанки()
	
	Результат = Новый Структура;
	Результат.Вставить("МассивБанков", Новый Массив);
	Результат.Вставить("ОписаниеОшибки", "");
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеПредложенийВСервисе()
	
	Банки = НовыйБанки();
		
	РезультатВыполненияЗапроса = РезультатВыполненияЗапроса("banks", "GET");
	Если НЕ РезультатВыполненияЗапроса.Выполнено Тогда
		Банки.ОписаниеОшибки = РезультатВыполненияЗапроса.ОписаниеОшибки;  
		Возврат Банки;
	КонецЕсли;
	
	ЗаполнитьДанныеПредложений(Банки, РезультатВыполненияЗапроса.ТелоОтвета);
	
	Возврат Банки;
	
КонецФункции

Функция РезультатВыполненияЗапроса(ВидЗапроса, МетодЗапроса, СтрокаТела = "", ОбязательныеПараметры = Неопределено) Экспорт
	
	// Формируем параметры запроса.
	ПараметрыЗапроса = ПараметрыВыполнитьЗапросКСерверу(ВидЗапроса);
	ПараметрыЗапроса.Заголовки.Вставить("x-api-key", КлючДоступа());
	ПараметрыЗапроса.Заголовки.Вставить("Content-Type", "application/json");
	ПараметрыЗапроса.МетодЗапроса = МетодЗапроса; 
	ПараметрыЗапроса.СтрокаТела = СтрокаТела; 
	Если ЗначениеЗаполнено(ОбязательныеПараметры) Тогда
		ПараметрыЗапроса.ОбязательныеПараметры = ОбязательныеПараметры;
	КонецЕсли;
	ПараметрыПодключения = ПараметрыСервераКредитПоВыписке();

	// Запрос к серверу.
	Возврат ЗаявкиНаКредитПоВыпискеПереопределяемый.ВыполнитьЗапросКСерверу(ПараметрыЗапроса, ПараметрыПодключения);
	
КонецФункции

Процедура ЗаполнитьДанныеПредложений(ДанныеПредложений, ДанныеОтветаСервера) 
	
	СтруктураОтветаСервера = ОбщегоНазначения.JSONВЗначение(ДанныеОтветаСервера, , Ложь);
	Если ТипЗнч(СтруктураОтветаСервера) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	СтруктураИменПолейОтветаБанка = СтруктураИменПолейОтветаБанка();
	МассивПредложений = СтруктураОтветаСервера[СтруктураИменПолейОтветаБанка.ПредложенияБанков];
	
	Для Каждого Предложение Из МассивПредложений Цикл
		
		СтруктураПредложений = НовыйСтруктураПредложений(); 
		Для Каждого ЭлементСтруктуры Из СтруктураПредложений Цикл
			ИмяРеквизита = "";
			Если СтруктураИменПолейОтветаБанка.Свойство(ЭлементСтруктуры.Ключ, ИмяРеквизита) Тогда
				ЗначениеРеквизита = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Предложение, ИмяРеквизита, "");
				СтруктураПредложений[ЭлементСтруктуры.Ключ] = ЗначениеРеквизита;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СтруктураПредложений.БИКБанка) Тогда
			ДанныеПредложений.МассивБанков.Добавить(СтруктураПредложений);
		КонецЕсли;
		
	КонецЦикла;
	
	СоздатьЗаполнитьБанкиПоДаннымПредложений(ДанныеПредложений.МассивБанков);

КонецПроцедуры

Процедура СоздатьЗаполнитьБанкиПоДаннымПредложений(МассивБанковПредложений)
	
	Для Каждого БанкПредложения Из МассивБанковПредложений Цикл
		БанкВКлассификаторе = РаботаСБанкамиБП.СсылкаПоКлассификатору(БанкПредложения.БИКБанка);
		МассивБанки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(БанкВКлассификаторе);
		РаботаСБанкамиБП.ПодобратьБанкИзКлассификатора(МассивБанки);
		БанкПредложения.Банк = Справочники.Банки.СсылкаНаБанк(БанкПредложения.БИКБанка);
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыВыполнитьЗапросКСерверу(АдресРесурса) Экспорт
		
	Результат = Новый Структура;
	// Токен авторизации.
	Результат.Вставить("Токен", Неопределено);
	// Адрес ресурса для объекта HTTPЗапрос.
	Результат.Вставить("АдресРесурса", АдресРесурса);
	// Суффикс ресурса.
	Результат.Вставить("СуффиксРесурса", "");
	// Обязательные параметры запроса.
	Результат.Вставить("ОбязательныеПараметры", Новый Массив);
	// Необязательные параметры запроса, передаются в URL.
	Результат.Вставить("Параметры", Новый Соответствие);
	// Заголовки запроса.
	Результат.Вставить("Заголовки", Новый Соответствие);
	// Метод выполнения запроса.
	Результат.Вставить("МетодЗапроса", "GET");
	// Имя файла тела запроса.
	Результат.Вставить("ИмяФайлаТела", Неопределено);
	// Двоичные данные тела запроса.
	Результат.Вставить("ДвоичныхДанныеТела", Неопределено);
	// Строка тела запроса.
	Результат.Вставить("СтрокаТела", "");
	// номер страницы для страничных запросов.
	Результат.Вставить("РазбивкаРезультатаНаСтраницы", Ложь);
	// номер страницы для страничных запросов.
	Результат.Вставить("НомерСтраницы", 0);
	// Количество элементов на странице для страничных запросов.
	Результат.Вставить("ЭлементовНаСтранице", 1024);
	// Типы данных.
	Результат.Вставить("ТипПринимаемыхДанных", "");
	Результат.Вставить("ТипОтправляемыхДанных", "");
	// Таймаут для запроса.
	Результат.Вставить("Таймаут", Неопределено);
	Возврат Результат;
	
КонецФункции

Функция ПараметрыСервераКредитПоВыписке()
	
	Результат = Новый Структура;
	Результат.Вставить("АдресСервиса", АдресСервиса());
	Результат.Вставить("ПортСервиса", 443);
	Результат.Вставить("ИспользоватьЗащищенноеСоединение", Истина);
	Результат.Вставить("ПрефиксРесурса", "/lead-gateway/api/v1/");
	Результат.Вставить("Таймаут", ТаймаутПолученияДанныхССервера());
		
	Возврат Результат;
	
КонецФункции

Функция АдресСервиса()
			
	Возврат "api.1c-findir.tech";
	
КонецФункции

Функция КлючДоступа()
			
	Возврат "804cca41-db95-490c-aaf9-00a6e973a986";
	
КонецФункции

Функция ТаймаутПолученияДанныхССервера()
	
	Возврат 40;
	
КонецФункции

Функция СтруктураИменПолейОтветаБанка()
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПредложенияБанков", "banks");
	Результат.Вставить("БИКБанка", "bankBIC");
	Результат.Вставить("НаименованиеБанка", "bankName");
	Результат.Вставить("Лимит", "limit");
	Результат.Вставить("ИННБанка", "inn");
	Результат.Вставить("ДоступнаВыдачаНаСчетВДругомБанке", "externalCustomerAllowed");
	Результат.Вставить("СуммаЗаявки", "amount");
	Результат.Вставить("ТипЗаемщика", "type");
	Результат.Вставить("ИНН", "inn");
	Результат.Вставить("КПП", "kpp");
	Результат.Вставить("ОГРН", "ogrn");
	Результат.Вставить("ТелефонКонтактногоЛица", "contactPhone");
	Результат.Вставить("БИКБанкаСчета", "clientBankBIC");
	Результат.Вставить("СчетОрганизации", "clientAccount");
	Результат.Вставить("СчетОрганизацииВДругомБанке", "recipientAccount");
	Результат.Вставить("ИННПолучателя", " recipientINN");
	Результат.Вставить("КПППолучателя", "recipientKPP");
	Результат.Вставить("Наименование", "recipientName");
	Результат.Вставить("ТипПеревода", "transferType");
	Результат.Вставить("КоррСчет", "bankCorrespondentAccount");	
	Результат.Вставить("ИдентификаторЗаявки", "dealId");
	Результат.Вставить("Статус", "status");
	Результат.Вставить("ПояснениеКСтатусу", "explanation");
	Результат.Вставить("КодПродукта", "productCode");
	Результат.Вставить("ТипПродукта", "productType");
	Результат.Вставить("СсылкаНаЗаявку", "bankLink");
	Результат.Вставить("ЧерныйСписок", "regionBlacklist");
	Результат.Вставить("БелыйСписок", "regionWhitelis");

	Возврат Результат;
	
КонецФункции

Функция ПроверитьЗаполнение(Форма) Экспорт

	Отказ = Ложь;
	
	Объект               = Форма.Объект;
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Организация,
			"Ссылка, ЮридическоеФизическоеЛицо, ОбособленноеПодразделение, ОГРН, ИНН, КПП");

	// Организация
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , НСтр("ru = 'Организация'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Объект.Организация", , Отказ);
		
		// Остальные поля не проверяем, пока не заполнят организацию.
		Возврат Ложь;
	КонецЕсли;
	
	ПроверитьЗаполнениеДанныхОрганизации(Форма, РеквизитыОрганизации, Отказ);
	
	Если Не ЗначениеЗаполнено(Объект.СчетОрганизации) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , НСтр("ru = 'Счет для зачисления'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "Объект.СчетОрганизации", , Отказ);
	КонецЕсли;
	
	Возврат НЕ Отказ;

КонецФункции

Функция НомерТелефонаТолькоЦифры(ПредставлениеТелефона)
	
	ТелефонТолькоЦифры = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" +()-", СокрЛП(ПредставлениеТелефона), "");
	
	Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ТелефонТолькоЦифры) Или СтрДлина(ТелефонТолькоЦифры) <> 11 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат ТелефонТолькоЦифры;
	
КонецФункции

Процедура ПроверитьЗаполнениеДанныхОрганизации(Форма, РеквизитыОрганизации, Отказ)
	
	Объект = Форма.Объект;
	КлючДанных   = РеквизитыОрганизации.Ссылка;
		
	ПроверяемыеВидыКонтактнойИнформации = Новый Массив;
	ПроверяемыеВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
			
	КонтактнаяИнформация = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияОбъектовНаДату(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РеквизитыОрганизации.Ссылка),
		,
		ПроверяемыеВидыКонтактнойИнформации,
		Объект.Дата);

	ЭтоЮрЛицо = РеквизитыОрганизации.ЮридическоеФизическоеЛицо <> Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;

	// ИНН
	Если ЗначениеЗаполнено(РеквизитыОрганизации.ИНН) Тогда
		РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(
			РеквизитыОрганизации.ИНН, ЭтоЮрЛицо);

		Если НЕ РезультатПроверки.СоответствуетТребованиям Тогда
			ОбщегоНазначения.СообщитьПользователю(
				РезультатПроверки.ОписаниеОшибки,
				КлючДанных,
				"ИНН",
				,
				Отказ);
		КонецЕсли;
	Иначе
		ТекстСообщения =  ТекстОшибкиЗаполненияРеквизита(НСтр("ru = 'ИНН'"));
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения, КлючДанных, "ИНН", , Отказ);
	КонецЕсли;
	
	// КПП 
	Если ЭтоЮрЛицо Тогда
		Если ЗначениеЗаполнено(РеквизитыОрганизации.КПП) Тогда
			РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямКПП(
				РеквизитыОрганизации.КПП,
				Истина,
				РеквизитыОрганизации.ОбособленноеПодразделение,
				Ложь);

			Если НЕ РезультатПроверки.СоответствуетТребованиям Тогда
				ОбщегоНазначения.СообщитьПользователю(
					РезультатПроверки.ОписаниеОшибки,
					КлючДанных,
					"КПП",
					,
					Отказ);
			КонецЕсли;
		Иначе
			ТекстСообщения =  ТекстОшибкиЗаполненияРеквизита(НСтр("ru = 'КПП'"));
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения, КлючДанных, "КПП", , Отказ);
		КонецЕсли;
	КонецЕсли;

	// ОГРН
	Если ЗначениеЗаполнено(РеквизитыОрганизации.ОГРН) Тогда
		ТекстСообщения = "";
		Успешно = РегламентированныеДанныеКлиентСервер.ОГРНСоответствуетТребованиям(
			РеквизитыОрганизации.ОГРН, ЭтоЮрЛицо, ТекстСообщения);

		Если НЕ Успешно Тогда
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения, КлючДанных, "ОГРН", , Отказ);
		КонецЕсли;
	Иначе
		Если НЕ ЭтоЮрЛицо Тогда
			ТекстСообщения =  ТекстОшибкиЗаполненияРеквизита(НСтр("ru = 'ОГРНИП'"));
		Иначе
			ТекстСообщения = ТекстОшибкиЗаполненияРеквизита(НСтр("ru = 'ОГРН'"));
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения, КлючДанных, "ОГРН", , Отказ);
	КонецЕсли;
	
	// Телефон
	Телефон = "";
	НайденнаяСтрока = КонтактнаяИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации, "Вид");
	Если НайденнаяСтрока <> Неопределено Тогда
		Телефон = НайденнаяСтрока.Представление;  
		НомерТелефонаТолькоЦифры = НомерТелефонаТолькоЦифры(Телефон);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Телефон) Тогда
		ТекстСообщения = ТекстОшибкиЗаполненияРеквизита(НСтр("ru = 'Телефон'"));
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения, КлючДанных, "КонтактнаяИнформацияПолеТелефонОрганизации", , Отказ);
	Иначе
		Если СтрДлина(НомерТелефонаТолькоЦифры) <> 11 Тогда
			ТекстСообщения = НСтр("ru = 'Количество цифр номера телефона организации должно быть равно 11'");
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения, КлючДанных, "КонтактнаяИнформацияПолеТелефонОрганизации", , Отказ);
		КонецЕсли;
	КонецЕсли; 
	
	// Сумма
	Если Объект.СуммаДокумента = 0 Тогда
		Если Форма.ТаблицаБанковскихДокументов.Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Не выбраны платежи из списка'");
		Иначе
			ТекстСообщения = НСтр("ru = 'По организации за последнее время нет оплат поставщикам, которые можно было бы включить в заявку'");
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ТаблицаБанковскихДокументов", , Отказ);
   	КонецЕсли;

КонецПроцедуры

Функция ТекстОшибкиЗаполненияРеквизита(ИмяРеквизита)
	
	Шаблон = НСтр("ru = 'Не заполнен реквизит ""%1"" справочника ""Организации""'");
	
	Возврат СтрШаблон(Шаблон, ИмяРеквизита);
	
КонецФункции

#КонецОбласти

#КонецЕсли