#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Дата = НачалоДня(ТекущаяДатаСеанса()); // Заявку заполняем всегда по состоянию "на сегодня".
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения); // Общие для документов реквизиты (организация и т.п.)
	
	// В заявке можно выбирать головную организацию.
	Организация = ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация);	
	СчетОрганизации = Неопределено;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СуммаДокумента = 0;
	БанковскиеДокументы.Очистить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СостояниеЗаявокНаКредит.УстановитьСостояниеЗаявкиНаКредитПоВыписке(Ссылка, 
		Перечисления.СостоянияЗаявокНаКредит.Черновик);

КонецПроцедуры

#КонецОбласти

#КонецЕсли