#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОтправитьСтатистикуВСервис", Истина);
	
КонецПроцедуры

// Возвращает таблицу с реквизитами документов списаний с расчетного счета.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, по которой нужно получить данные.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица списаний с расчетного счета.
//
Функция ДоступныеБанковскиеДокументы(Организация) Экспорт
	
	Возврат ЗаявкиНаКредитПоВыпискеБП.ДоступныеБанковскиеДокументы(Организация);
	
КонецФункции

// Выполняет запрос к серверу сервиса.
//
// Параметры:
//  ПараметрыЗапроса - Структура - параметры запроса к серверу сервиса.
//  ПараметрыПодключения - Структура - параметры подключения к серверу сервиса.
//
// Возвращаемое значение:
//  Структура - результат выполнения запроса к серверу сервиса.
//
Функция ВыполнитьЗапросКСерверу(ПараметрыЗапроса, ПараметрыПодключения = Неопределено) Экспорт

	Возврат УниверсальныйОбменСБанками.ВыполнитьЗапросКСерверу(ПараметрыЗапроса, ПараметрыПодключения);

КонецФункции

// Отправляет статистику.
//
// Параметры:
//  Параметры - Структура - параметры отправки статистики.
//  АдресХранилища - Строка - адрес временного хранилища, в которое будет помещен результат выполнения запроса.
//
// Возвращаемое значение:
//  Структура - результат выполнения запроса.
//
Процедура ОтправитьСтатистикуВСервис(Параметры, АдресХранилища) Экспорт
	
	ЗаявкиНаКредитПоВыпискеБП.ОтправитьСтатистикуВСервис(Параметры, АдресХранилища);
	
КонецПроцедуры

// Возвращает первый расчетный счет из списка подходящих банковских счетов.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, по которой нужно получить данные.
//  МассивБанков - Массив - Массив доступных банков.
//
// Возвращаемое значение:
//  СправочникСсылка.БанковскиеСчета - Расчетный счет.
//
Функция СчетОрганизацииПоУмолчанию(Организация, МассивБанков) Экспорт
		
	Возврат ЗаявкиНаКредитПоВыпискеБП.СчетОрганизацииПоУмолчанию(Организация, МассивБанков);
	
КонецФункции

// Возвращает наименование конфигурации.
//
// Возвращаемое значение:
//  Строка - название конфигурации.
//
Функция ИмяКонфигурации() Экспорт
		
	Возврат ЗаявкиНаКредитПоВыпискеБП.ИмяКонфигурации();
	
КонецФункции

#КонецОбласти

#КонецЕсли