#Область СлужебныйПрограммныйИнтерфейс

Процедура ПометитьНаУдалениеПрисоединенныеФайлыЧековНПД(Файлы) Экспорт
	
	Для Каждого Ссылка Из Файлы Цикл
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Ссылка);
			ФайлОбъект = Ссылка.ПолучитьОбъект();
			ФайлОбъект.УстановитьПометкуУдаления(Истина);
			РазблокироватьДанныеДляРедактирования(Ссылка);
		Исключение
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Не удалось установить пометку удаления для присоединенного файла %1, по причине:
					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()), Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'ЗагрузкаЧековНПД.УдалитьПрисоединенныеФайлы'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				,
				Ссылка,
				ТекстОшибки);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти