// Регистрация БП/3.0.191: ОбменРозницаБухгалтерияПредприятия30 от 25.09.2026 11:54:00
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает представление регистрации.
// Возвращаемое значение:
//  Строка.
Функция ИнформацияОПравилах() Экспорт

	Параметры = ПараметрыРегистрации();
	ШаблонТекста = НСтр("ru = 'Правила регистрации объектов этой информационной базы (%1 версия %2) от %3'");
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(ШаблонТекста, 
		Параметры.СинонимКонфигурации, Параметры.ВерсияКонфигурации, Параметры.ДатаВремяСоздания);	
	
КонецФункции

// Возвращает ключевые параметры регистрации в виде структуры.
// Возвращаемое значение:
//  Структура.
Функция ПараметрыРегистрации() Экспорт
	Результат = Новый Структура();
	Наименование = НСтр("ru = 'БП/3.0.191: ОбменРозницаБухгалтерияПредприятия30'");
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("ДатаВремяСоздания", Дата(2026,9,25,11,54,0));
	Результат.Вставить("ПланаОбмена", "ОбменРозницаБухгалтерияПредприятия30");
	Результат.Вставить("Конфигурация", "БухгалтерияПредприятияКОРП");
	СинонимКонфигурации = "Бухгалтерия предприятия КОРП, редакция 3.0";
	ТекстСинонимКонфигурации = НСтр("ru = '%1'");
	ТекстСинонимКонфигурации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСинонимКонфигурации, СинонимКонфигурации);
	Результат.Вставить("СинонимКонфигурации", ТекстСинонимКонфигурации);
	Результат.Вставить("ВерсияКонфигурации", "3.0.200.4");

	Возврат Результат;
КонецФункции

// Заполняет таблицу правил регистрации объектов.
//
// Параметры:
//  ПравилаРегистрацииОбъектов - ТаблицаЗначений - таблица значений, в которую добавляются правила
//  ИмяМенеджераРегистрации - Строка - Имя модуля менеджера правил регистрации объектов 
Процедура ИнициализацияПравилРегистрации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации) Экспорт
	Если ПравилаРегистрацииОбъектов.Колонки.Найти("Идентификатор") = Неопределено Тогда
		ПравилаРегистрацииОбъектов.Колонки.Добавить("Идентификатор");
	КонецЕсли;
	ДобавитьПРО_Справочник_БанковскиеСчета(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_БанковскиеСчета2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Контрагенты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ДоговорыКонтрагентов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Организации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ФизическиеЛица(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Банки(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_СтатьиДвиженияДенежныхСредств(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_ФИОФизическихЛиц(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ВедомостьНаВыплатуЗарплаты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_СписаниеСРасчетногоСчета(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ВедомостьНаВыплатуЗарплатыВКассу(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ПоступлениеНаРасчетныйСчет(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
КонецПроцедуры

// Обработчик события ПередОбработкой правила регистрации 
// Параметры:
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных, соответствующий объекту.
//  Выгрузка - Булево - контекст выполнения правила регистрации, если Истина то происходит выгрузка объекта.
Процедура ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка) Экспорт
	Если ПРО.Идентификатор = "Справочник_БанковскиеСчета" Тогда 
		ПРО_Справочник_БанковскиеСчета_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_БанковскиеСчета2" Тогда 
		ПРО_Справочник_БанковскиеСчета2_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_Контрагенты" Тогда 
		ПРО_Справочник_Контрагенты_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ДоговорыКонтрагентов" Тогда 
		ПРО_Справочник_ДоговорыКонтрагентов_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_СписаниеСРасчетногоСчета" Тогда 
		ПРО_Документ_СписаниеСРасчетногоСчета_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_ПоступлениеНаРасчетныйСчет" Тогда 
		ПРО_Документ_ПоступлениеНаРасчетныйСчет_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	КонецЕсли;
КонецПроцедуры

// Обработчик события ПриОбработке правила регистрации
// Параметры:
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ТекстЗапроса - Строка - текст запроса для определения узлов получателей.
//  ПараметрыЗапроса - Структура - параметры запроса для определения узлов получателей.
//  ИспользоватьКэш - Булево - использование платформенного механизма повторно используемых значений.
//  Выгрузка - Булево - контекст выполнения правила регистрации, если Истина то происходит выгрузка объекта. 
//  ДополнительныеСвойства - Структура.
Процедура ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства) Экспорт
	Если ПРО.Идентификатор = "Справочник_БанковскиеСчета2" Тогда 
		ПРО_Справочник_БанковскиеСчета2_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства);
	ИначеЕсли ПРО.Идентификатор = "Справочник_Контрагенты" Тогда 
		ПРО_Справочник_Контрагенты_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства);
	КонецЕсли;
КонецПроцедуры

// Обработчик события ПриОбработкеДополнительный правила регистрации 
// Параметры:
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ТекстЗапроса - Строка - текст запроса для определения узлов получателей.
//  ПараметрыЗапроса - Структура - параметры запроса для определения узлов получателей.
//  ИспользоватьКэш - Булево - использование платформенного механизма повторно используемых значений.
//  ДополнительныеСвойства - Структура.
Процедура ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства) Экспорт
	Если ПРО.Идентификатор = "Справочник_БанковскиеСчета2" Тогда 
		ПРО_Справочник_БанковскиеСчета2_ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства);
	ИначеЕсли ПРО.Идентификатор = "Справочник_Контрагенты" Тогда 
		ПРО_Справочник_Контрагенты_ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура УстановитьОтборы(ПравилоРегистрации, ОтборПоСвойствамПланаОбмена, ОтборПоСвойствамОбъекта)
	Обработка = Обработки.ЗагрузкаПравилРегистрацииОбъектов.Создать();
	
	ПравилаXML = Новый ЧтениеXML;
	
	//ОтборПоСвойствамПланаОбмена
	ПравилоРегистрации.ОтборПоСвойствамПланаОбмена = ОбменДаннымиСервер.ИнициализацияТаблицыОтборПоСвойствамПланаОбмена().Скопировать();
	
	ПравилаXML.УстановитьСтроку(ОтборПоСвойствамПланаОбмена);
	ПравилаXML.Прочитать();
	Обработка.ЗагрузитьДеревоОтбораПоСвойствамПланаОбмена(ПравилаXML, ПравилоРегистрации.ОтборПоСвойствамПланаОбмена);
	
	Обработка.Регистрация = Новый Структура("ИмяПланаОбмена", ПравилоРегистрации.ИмяПланаОбмена);
	Обработка.ПодготовитьПравилоРегистрацииПоСвойствамПланаОбмена(ПравилоРегистрации);
	
	//ОтборПоСвойствамОбъекта
	ПравилаXML.УстановитьСтроку(ОтборПоСвойствамОбъекта);
	ПравилаXML.Прочитать();
	
	ПравилоРегистрации.ОтборПоСвойствамОбъекта = ОбменДаннымиСервер.ИнициализацияТаблицыОтборПоСвойствамОбъекта().Скопировать();
	Обработка.ЗагрузитьДеревоОтбораПоСвойствамОбъекта(ПравилаXML, ПравилоРегистрации.ОтборПоСвойствамОбъекта);
КонецПроцедуры 

#Область Справочник_БанковскиеСчета
Процедура ДобавитьПРО_Справочник_БанковскиеСчета(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_БанковскиеСчета";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.БанковскиеСчета";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_БанковскиеСчета_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_БанковскиеСчета_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ПередаватьНСИ</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ПередаватьНСИ</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Владелец</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Владелец</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Свойство</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Процедура ПРО_Справочник_БанковскиеСчета_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	Если ТипЗнч(Объект.Владелец) <> Тип("СправочникСсылка.Организации") Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_БанковскиеСчета2
Процедура ДобавитьПРО_Справочник_БанковскиеСчета2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_БанковскиеСчета2";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.БанковскиеСчета";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_БанковскиеСчета2_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	Если ТипЗнч(Объект.Владелец) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Отказ = Истина;
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)");
		Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда 
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура ПРО_Справочник_БанковскиеСчета2_ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства)
	ИспользоватьКэш = Ложь;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)");
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	ПараметрыЗапроса.Вставить("Организации", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация"));
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
	|ИЗ
	|ПланОбмена.ОбменРозницаБухгалтерияПредприятия30 КАК ПланОбменаОсновнаяТаблица
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|ПланОбмена.ОбменРозницаБухгалтерияПредприятия30.Организации КАК ОрганизацииТЧ
	|ПО ПланОбменаОсновнаяТаблица.Ссылка = ОрганизацииТЧ.Ссылка
	|ГДЕ
	|ПланОбменаОсновнаяТаблица.ПередаватьНСИ
	|И (ОрганизацииТЧ.Организация В(&СвойствоОбъекта_Организации)
	|ИЛИ НЕ ПланОбменаОсновнаяТаблица.ИспользоватьОтборПоОрганизациям)
	|
	|И НЕ ПланОбменаОсновнаяТаблица.Ссылка = &ОбменРозницаБухгалтерияПредприятия30ЭтотУзел
	|И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления";
КонецПроцедуры

Процедура ПРО_Справочник_БанковскиеСчета2_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства)
	ИспользоватьКэш = Ложь;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)");
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	ПараметрыЗапроса.Вставить("Организации", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация"));
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
	|ИЗ
	|ПланОбмена.ОбменРозницаБухгалтерияПредприятия30 КАК ПланОбменаОсновнаяТаблица
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|ПланОбмена.ОбменРозницаБухгалтерияПредприятия30.Организации КАК ОрганизацииТЧ
	|ПО ПланОбменаОсновнаяТаблица.Ссылка = ОрганизацииТЧ.Ссылка
	|ГДЕ
	|ПланОбменаОсновнаяТаблица.ПередаватьНСИ
	|И (ОрганизацииТЧ.Организация В(&СвойствоОбъекта_Организации)
	|ИЛИ НЕ ПланОбменаОсновнаяТаблица.ИспользоватьОтборПоОрганизациям)
	|
	|И НЕ ПланОбменаОсновнаяТаблица.Ссылка = &ОбменРозницаБухгалтерияПредприятия30ЭтотУзел
	|И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления";
КонецПроцедуры
#КонецОбласти
#Область Справочник_Контрагенты
Процедура ДобавитьПРО_Справочник_Контрагенты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Контрагенты";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Контрагенты";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_Контрагенты_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	Если Объект.ЭтоГруппа Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|  ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|  ПО Контрагенты.Ссылка = ДоговорыКонтрагентов.Владелец
		|  И Контрагенты.Родитель = &Ссылка
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)");
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда 
			Отказ = Истина;
		КонецЕсли;	                     
	Иначе	
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)");
		Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда 
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Процедура ПРО_Справочник_Контрагенты_ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства)
	Если НЕ Объект.ЭтоГруппа Тогда
		
		ИспользоватьКэш = Ложь;
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоговорыКонтрагентов.Организация КАК Организация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)");
		Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
		РезультатЗапросаПоДоговорам = Запрос.Выполнить();
		ПараметрыЗапроса.Вставить("ЕстьДоговораСПоставщиком", НЕ РезультатЗапросаПоДоговорам.Пустой());
		ПараметрыЗапроса.Вставить("Организации", РезультатЗапросаПоДоговорам.Выгрузить().ВыгрузитьКолонку("Организация"));
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
		|ИЗ
		|ПланОбмена.ОбменРозницаБухгалтерияПредприятия30 КАК ПланОбменаОсновнаяТаблица
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|ПланОбмена.ОбменРозницаБухгалтерияПредприятия30.Организации КАК ОрганизацииТЧ
		|ПО ПланОбменаОсновнаяТаблица.Ссылка = ОрганизацииТЧ.Ссылка
		|ГДЕ
		|ПланОбменаОсновнаяТаблица.ПередаватьНСИ
		|И (Организации.Организация В(&СвойствоОбъекта_Организации)
		|ИЛИ НЕ ПланОбменаОсновнаяТаблица.ИспользоватьОтборПоОрганизациям)
		|И &СвойствоОбъекта_ЕстьДоговораСПоставщиком
		|И НЕ ПланОбменаОсновнаяТаблица.Ссылка = &ОбменРозницаБухгалтерияПредприятия30ЭтотУзел
		|И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления";
		
	КонецЕсли;
КонецПроцедуры

Процедура ПРО_Справочник_Контрагенты_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства)
	Если НЕ Объект.ЭтоГруппа Тогда
		
		ИспользоватьКэш = Ложь;
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоговорыКонтрагентов.Организация КАК Организация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)");
		Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
		РезультатЗапросаПоДоговорам = Запрос.Выполнить();
		ПараметрыЗапроса.Вставить("ЕстьДоговораСПоставщиком", НЕ РезультатЗапросаПоДоговорам.Пустой());
		ПараметрыЗапроса.Вставить("Организации", РезультатЗапросаПоДоговорам.Выгрузить().ВыгрузитьКолонку("Организация"));
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ 
		|ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
		|ИЗ
		|ПланОбмена.ОбменРозницаБухгалтерияПредприятия30 КАК ПланОбменаОсновнаяТаблица
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|ПланОбмена.ОбменРозницаБухгалтерияПредприятия30.Организации КАК ОрганизацииТЧ
		|ПО ПланОбменаОсновнаяТаблица.Ссылка = ОрганизацииТЧ.Ссылка
		|ГДЕ
		|ПланОбменаОсновнаяТаблица.ПередаватьНСИ
		|И (Организации.Организация В(&СвойствоОбъекта_Организации)
		|ИЛИ НЕ ПланОбменаОсновнаяТаблица.ИспользоватьОтборПоОрганизациям)
		|И &СвойствоОбъекта_ЕстьДоговораСПоставщиком
		|И НЕ ПланОбменаОсновнаяТаблица.Ссылка = &ОбменРозницаБухгалтерияПредприятия30ЭтотУзел
		|И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления";
		
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ДоговорыКонтрагентов
Процедура ДобавитьПРО_Справочник_ДоговорыКонтрагентов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ДоговорыКонтрагентов";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ДоговорыКонтрагентов";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_ДоговорыКонтрагентов_ОтборПоСвойствамПланаОбмена(),
		Справочник_ДоговорыКонтрагентов_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_ДоговорыКонтрагентов_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ПередаватьНСИ</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ПередаватьНСИ</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция Справочник_ДоговорыКонтрагентов_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ЭтоГруппа</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ЭтоГруппа</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>ПеречислениеСсылка.ВидыДоговоровКонтрагентов</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ВидДоговора</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ВидДоговора</Наименование>
			|				<Тип>ПеречислениеСсылка.ВидыДоговоровКонтрагентов</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

Процедура ПРО_Справочник_ДоговорыКонтрагентов_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	Если Объект.ЭтоГруппа
		ИЛИ Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_Организации
Процедура ДобавитьПРО_Справочник_Организации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Организации";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Организации";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_Организации_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_Организации_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ПередаватьНСИ</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ПередаватьНСИ</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Ссылка</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Ссылка</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Свойство</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_ФизическиеЛица
Процедура ДобавитьПРО_Справочник_ФизическиеЛица(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ФизическиеЛица";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ФизическиеЛица";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область Справочник_Банки
Процедура ДобавитьПРО_Справочник_Банки(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Банки";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Банки";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область Справочник_СтатьиДвиженияДенежныхСредств
Процедура ДобавитьПРО_Справочник_СтатьиДвиженияДенежныхСредств(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_СтатьиДвиженияДенежныхСредств";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.СтатьиДвиженияДенежныхСредств";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область РегистрСведений_ФИОФизическихЛиц
Процедура ДобавитьПРО_РегистрСведений_ФИОФизическихЛиц(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_ФИОФизическихЛиц";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.ФИОФизическихЛиц";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗарплаты
Процедура ДобавитьПРО_Документ_ВедомостьНаВыплатуЗарплаты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ВедомостьНаВыплатуЗарплаты";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ВедомостьНаВыплатуЗарплаты";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ВедомостьНаВыплатуЗарплаты_ОтборПоСвойствамПланаОбмена(),
		Документ_ВедомостьНаВыплатуЗарплаты_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Документ_ВедомостьНаВыплатуЗарплаты_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ЗарплатаВыплачиваетсяИзКассыВРозничнойОптовойСети</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ЗарплатаВыплачиваетсяИзКассыВРозничнойОптовойСети</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>И</БулевоЗначениеГруппы>
			|		<Группа>
			|			<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|				<ТаблицаСвойствОбъекта>
			|					<Свойство>
			|						<Наименование>Организация</Наименование>
			|						<Тип>СправочникСсылка.Организации</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>[Организации]</Наименование>
			|						<Вид>ТабличнаяЧасть</Вид>
			|					</Свойство>
			|					<Свойство>
			|						<Наименование>Организация</Наименование>
			|						<Тип>СправочникСсылка.Организации</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>false</СвойствоОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|						<Тип>Булево</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|		</Группа>
			|		<Группа>
			|			<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>СправочникСсылка.ПодразделенияОрганизаций</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>[ПодразделенияОрганизаций].ПодразделениеОрганизации</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>ПодразделениеОрганизации</СвойствоОбъекта>
			|				<ТаблицаСвойствОбъекта>
			|					<Свойство>
			|						<Наименование>ПодразделениеОрганизации</Наименование>
			|						<Тип>СправочникСсылка.ПодразделенияОрганизаций</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>[ПодразделенияОрганизаций]</Наименование>
			|						<Вид>ТабличнаяЧасть</Вид>
			|					</Свойство>
			|					<Свойство>
			|						<Наименование>ПодразделениеОрганизации</Наименование>
			|						<Тип>СправочникСсылка.ПодразделенияОрганизаций</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>ИспользоватьОтборПоПодразделениямОрганизации</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>false</СвойствоОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>ИспользоватьОтборПоПодразделениямОрганизации</Наименование>
			|						<Тип>Булево</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|		</Группа>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция Документ_ВедомостьНаВыплатуЗарплаты_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>ПеречислениеСсылка.ВидыМестВыплатыЗарплаты</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>МестоВыплаты</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Перечисления.ВидыМестВыплатыЗарплаты.Касса;</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>МестоВыплаты</Наименование>
			|				<Тип>ПеречислениеСсылка.ВидыМестВыплатыЗарплаты</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>СправочникСсылка.ПодразделенияОрганизаций</ТипСвойстваОбъекта>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ПодразделениеОрганизации</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ПодразделениеОрганизации</Наименование>
			|				<Тип>СправочникСсылка.ПодразделенияОрганизаций</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти
#Область Документ_СписаниеСРасчетногоСчета
Процедура ДобавитьПРО_Документ_СписаниеСРасчетногоСчета(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_СписаниеСРасчетногоСчета";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.СписаниеСРасчетногоСчета";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_СписаниеСРасчетногоСчета_ОтборПоСвойствамПланаОбмена(),
		Документ_СписаниеСРасчетногоСчета_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Документ_СписаниеСРасчетногоСчета_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция Документ_СписаниеСРасчетногоСчета_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>НеПодтвержденоВыпискойБанка</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>НеПодтвержденоВыпискойБанка</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>ПеречислениеСсылка.ВидыОперацийСписаниеДенежныхСредств</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ВидОперации</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику;</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ВидОперации</Наименование>
			|				<Тип>ПеречислениеСсылка.ВидыОперацийСписаниеДенежныхСредств</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

Процедура ПРО_Документ_СписаниеСРасчетногоСчета_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	Если (Объект.РасшифровкаПлатежа.Количество() = 0) ИЛИ 
		(Не ЗначениеЗаполнено(Объект.РасшифровкаПлатежа[0].Сделка)) ИЛИ
		(ТипЗнч(Объект.РасшифровкаПлатежа[0].Сделка) <> Тип("ДокументСсылка.ПоступлениеТоваровУслуг")) ИЛИ
		(ТипЗнч(Объект.Контрагент) <> Тип("СправочникСсылка.Контрагенты")) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗарплатыВКассу
Процедура ДобавитьПРО_Документ_ВедомостьНаВыплатуЗарплатыВКассу(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ВедомостьНаВыплатуЗарплатыВКассу";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ВедомостьНаВыплатуЗарплатыВКассу";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ВедомостьНаВыплатуЗарплатыВКассу_ОтборПоСвойствамПланаОбмена(),
		Документ_ВедомостьНаВыплатуЗарплатыВКассу_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Документ_ВедомостьНаВыплатуЗарплатыВКассу_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ЗарплатаВыплачиваетсяИзКассыВРозничнойОптовойСети</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ЗарплатаВыплачиваетсяИзКассыВРозничнойОптовойСети</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>И</БулевоЗначениеГруппы>
			|		<Группа>
			|			<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|				<ТаблицаСвойствОбъекта>
			|					<Свойство>
			|						<Наименование>Организация</Наименование>
			|						<Тип>СправочникСсылка.Организации</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>[Организации]</Наименование>
			|						<Вид>ТабличнаяЧасть</Вид>
			|					</Свойство>
			|					<Свойство>
			|						<Наименование>Организация</Наименование>
			|						<Тип>СправочникСсылка.Организации</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>false</СвойствоОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|						<Тип>Булево</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|		</Группа>
			|		<Группа>
			|			<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>СправочникСсылка.ПодразделенияОрганизаций</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>[ПодразделенияОрганизаций].ПодразделениеОрганизации</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>Подразделение</СвойствоОбъекта>
			|				<ТаблицаСвойствОбъекта>
			|					<Свойство>
			|						<Наименование>Подразделение</Наименование>
			|						<Тип>СправочникСсылка.ПодразделенияОрганизаций</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>[ПодразделенияОрганизаций]</Наименование>
			|						<Вид>ТабличнаяЧасть</Вид>
			|					</Свойство>
			|					<Свойство>
			|						<Наименование>ПодразделениеОрганизации</Наименование>
			|						<Тип>СправочникСсылка.ПодразделенияОрганизаций</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>ИспользоватьОтборПоПодразделениямОрганизации</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>false</СвойствоОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>ИспользоватьОтборПоПодразделениямОрганизации</Наименование>
			|						<Тип>Булево</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|		</Группа>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция Документ_ВедомостьНаВыплатуЗарплатыВКассу_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>СправочникСсылка.ПодразделенияОрганизаций</ТипСвойстваОбъекта>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>Подразделение</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Подразделение</Наименование>
			|				<Тип>СправочникСсылка.ПодразделенияОрганизаций</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти
#Область Документ_ПоступлениеНаРасчетныйСчет
Процедура ДобавитьПРО_Документ_ПоступлениеНаРасчетныйСчет(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ПоступлениеНаРасчетныйСчет";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ПоступлениеНаРасчетныйСчет";
	НовоеПравило.ИмяПланаОбмена = "ОбменРозницаБухгалтерияПредприятия30";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ПоступлениеНаРасчетныйСчет_ОтборПоСвойствамПланаОбмена(),
		Документ_ПоступлениеНаРасчетныйСчет_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Документ_ПоступлениеНаРасчетныйСчет_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция Документ_ПоступлениеНаРасчетныйСчет_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>ПеречислениеСсылка.ВидыОперацийПоступлениеДенежныхСредств</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ВидОперации</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ВозвратОтПоставщика;</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ВидОперации</Наименование>
			|				<Тип>ПеречислениеСсылка.ВидыОперацийПоступлениеДенежныхСредств</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

Процедура ПРО_Документ_ПоступлениеНаРасчетныйСчет_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	Если Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
		ПерваяСтрокаРасшифровкиПлатежа = Объект.РасшифровкаПлатежа[0];
		ДокументСделка = ПерваяСтрокаРасшифровкиПлатежа.Сделка;
	
		Если НЕ ЗначениеЗаполнено(ДокументСделка) ИЛИ
			 (ТипЗнч(ДокументСделка) <> Тип("ДокументСсылка.СписаниеСРасчетногоСчета")) ИЛИ
			 (ТипЗнч(Объект.Контрагент) <> Тип("СправочникСсылка.Контрагенты")) Тогда
			Отказ = Истина;
		Иначе
			ПерваяСтрокаРасшифровкиПлатежаОснования = ДокументСделка.РасшифровкаПлатежа[0];
			Если Не ЗначениеЗаполнено(ПерваяСтрокаРасшифровкиПлатежаОснования.Сделка) ИЛИ
			 	ТипЗнч(ПерваяСтрокаРасшифровкиПлатежаОснования.Сделка) <> Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

Функция ПустойОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта/>" ;
КонецФункции

Функция ОтборПоСвойствамПланаОбмена_1()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ПередаватьНСИ</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ПередаватьНСИ</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>" ;
КонецФункции

Функция ПустойОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена/>" ;
КонецФункции

#КонецОбласти
