///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получает описание предопределенных наборов свойств.
//
// Параметры:
//  Наборы - ДеревоЗначений:
//     * Имя           - Строка - имя набора свойств. Формируется из полного имени объекта
//          метаданных заменой символа "." на "_".
//          Например, "Документ_ЗаказПокупателя".
//     * Идентификатор - УникальныйИдентификатор - уникальный идентификатор предопределенного набора свойств.
//          Не должен повторяться в других наборах свойств.
//          Формат идентификатора Random UUID (Version 4).
//          Чтобы получить идентификатор, нужно в режиме 1С:Предприятие вычислить значение
//          конструктора платформы "Новый УникальныйИдентификатор" или воспользоваться online-генератором,
//          например, https://www.uuidgenerator.net/version4.
//     * Используется  - Неопределено
//                     - Булево - признак того, что набор свойств используется.
//          Например, можно использовать для скрытия набора по функциональным опциям.
//          Значение по умолчанию - Неопределено, соответствует значению Истина.
//     * ЭтоГруппа     - Булево - Истина, если набор свойств является группой.
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	// ЗарплатаКадрыПодсистемы
	ЗарплатаКадры.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	// Конец ЗарплатаКадрыПодсистемы
	
	Справочники.Банки.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.БанковскиеСчета.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.Билеты.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.ВидыВзаиморасчетов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.ДенежныеДокументы.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.ДоговорыКонтрагентов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.ДоходыБудущихПериодов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.КлассификаторЕдиницИзмерения.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.КонтактныеЛица.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.Контрагенты.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.НаправленияИспользованияПрибыли.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.НематериальныеАктивы.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.Номенклатура.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.НоменклатурныеГруппы.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.ОбъектыСтроительства.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.Организации.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.ОснованияФинансирования.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.ОсновныеСредства.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.Патенты.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.ПодразделенияОрганизаций.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.ПрочиеДоходыИРасходы.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.РасходыБудущихПериодов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.Склады.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.СпецификацииНоменклатуры.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.СтатьиДвиженияДенежныхСредств.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.СтатьиЗатрат.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.ЦенныеБумаги.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	
	Справочники.ТранспортныеСредства.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	УчетОбесцененияАктивов.НастроитьНаборыСвойств(Наборы);
	Документы.АвансовыйОтчет.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.АктОбОказанииПроизводственныхУслуг.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.АктСверкиВзаиморасчетов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВводНачальныхОстатков.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВозвратМатериаловИзЭксплуатации.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВозвратОСОтАрендатора.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВозвратТоваровОтПокупателя.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВозвратТоваровПоставщику.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВосстановлениеНДС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВосстановлениеНДСПоОбъектамНедвижимости.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВыдачаДенежныхДокументов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВыкупПредметовЛизинга.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВыплатыСамозанятым.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВыработкаМатериалов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВыработкаНМА.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВыработкаОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.Доверенность.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ДокументРасчетовСКонтрагентом.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ЗаписьКнигиУчетаДоходовИРасходовИП.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ЗаписьКУДиР.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИзменениеГрафиковАмортизацииОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИзменениеОтраженияРасходовПоАренднымПлатежамОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИзменениеПараметровНачисленияАмортизацииОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИзменениеСпециальногоКоэффициентаНМА.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИзменениеСостоянияОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИзменениеСпециальногоКоэффициентаОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИзменениеСпособовОтраженияРасходовПоАмортизацииНМА.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИзменениеСпособовОтраженияРасходовПоАмортизацииОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИзменениеУсловийАренды.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИнвентаризацияКассы.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИнвентаризацияНЗП.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИнвентаризацияОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИнвентаризацияРасчетовСКонтрагентами.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИнвентаризацияТоваровНаСкладе.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.КомплектацияНоменклатуры.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.КорректировкаДолга.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.КорректировкаПоступления.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.КорректировкаРеализации.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.МодернизацияОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.НачислениеДивидендов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.НачислениеНДСпоСМРхозспособом.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.НачислениеПеней.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОказаниеУслуг.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОперацияБух.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОперацияСБилетом.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОплатаПлатежнойКартой.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОприходованиеТоваров.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОтражениеЗарплатыВУчете.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОтражениеНачисленияНДС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОтражениеНДСКВычету.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОтчетКомиссионераОПродажах.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОтчетКомитентуОПродажах.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОтчетОРозничныхПродажах.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОтчетОператораСистемыПлатон.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОтчетПроизводстваЗаСмену.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.Партия.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПартияМатериаловВЭксплуатации.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПереводОСВМалоценноеОборудование.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПередачаЗадолженностиНаФакторинг.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПередачаМатериаловВЭксплуатацию.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПередачаНМА.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПередачаОборудованияВМонтаж.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПередачаОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПередачаОСВАренду.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПередачаТоваров.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПеремещениеОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПеремещениеТоваров.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПереоценкаТоваровВРознице.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПересортицаТоваров.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПлатежноеПоручение.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПлатежноеТребование.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПодготовкаКПередачеОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПодтверждениеНулевойСтавкиНДС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПоступлениеТоваровУслуг.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПоступлениеВАренду.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПоступлениеДенежныхДокументов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПоступлениеДопРасходов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПоступлениеИзПереработки.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПоступлениеНаРасчетныйСчет.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПриходныйКассовыйОрдер.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПоступлениеНМА.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПрекращениеАренды.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПринятиеКУчетуНМА.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПринятиеКУчетуОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПутевойЛист.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.РаспределениеНДС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ТребованиеНакладная.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.РасходыНаОнлайнКассыУменьшающиеНалоги.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.РасходыПредпринимателя.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.РеализацияТоваровУслуг.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.РеализацияОтгруженныхТоваров.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.РеализацияУслугПоПереработке.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.РегистрацияОплатыОсновныхСредствДляУСН.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.РегистрацияОплатыОсновныхСредствДляИП.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.РегистрацияСуммыУбыткаУСН.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.РегламентнаяОперация.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.РозничнаяПродажа.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СведенияОбУдержанномНДФЛ.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СписаниеМатериаловИзЭксплуатации.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СписаниеНМА.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СписаниеОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СписаниеСРасчетногоСчета.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СписаниеТоваров.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СписаниеНДС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СтатистикаПерсонала.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СчетНаОплатуПокупателю.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СчетНаОплатуПоставщика.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СчетФактураВыданный.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СчетФактураПолученный.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.УстановкаПорядкаЗакрытияПодразделений.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.УстановкаЦенНоменклатуры.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ФормированиеЗаписейКнигиПокупок.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ФормированиеЗаписейКнигиПродаж.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ФормированиеЗаписейРаздела7ДекларацииНДС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ФормированиеУставногоКапитала.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	
	УчетПроцентовПоОбязательствам.НастроитьНаборыСвойств(Наборы);
	
	Справочники.ОснованияЛьготПоИмущественнымНалогам.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.ДокументыПодтверждающиеЛьготыПоИмущественнымНалогам.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.ОбъектыВыполненияРабот.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Справочники.КомпонентыАмортизацииОС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОперацияПоЕдиномуНалоговомуСчету.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.РасходныйКассовыйОрдер.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.УведомлениеОбИсчисленныхСуммахНалогов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ЗаявлениеОЗачетеВСчетПредстоящейОбязанности.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.УведомлениеОбУменьшенииНалогаПоПатенту.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОперацияСПатентом.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.КорректировкаЕНС.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.СведенияОбУплатеНалогов.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ЗаявлениеОВвозеТоваровПолученное.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ТаможеннаяДекларацияЭкспорт.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ГТДИмпорт.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ЗаявлениеОВвозеТоваров.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ПодтверждениеОплатыНДСВБюджет.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	КомпонентыАмортизацииОС.НастроитьНаборыСвойств(Наборы);
	Документы.ПрочееВзаимодействие.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИнвентаризацияНМА.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.НачалоСтадииРазработокНМА.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.НачислениеТуристическогоНалога.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ИнвентаризацияОбъектовУчета.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.КоммерческоеПредложение.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОперацияСИнвестиционнымВычетом.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОтражениеЗарплатыВБухучете.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ВедомостьНаВыплатуЗарплаты.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	Документы.ОтражениеДОППВДекларацииПоКосвеннымНалогам.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	
	УчетОбособленныхПодразделений.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	
КонецПроцедуры

// Получает наименования наборов свойств второго уровня на разных языках.
//
// Параметры:
//  Наименования - Соответствие из КлючИЗначение - представление набора на переданном языке:
//     * Ключ     - Строка - имя набора свойств. Например, "Справочник_Партнеры_Общие".
//     * Значение - Строка - наименование набора для переданного кода языка.
//  КодЯзыка - Строка - код языка. Например, "en".
//
// Пример:
//  Наименования["Справочник_Партнеры_Общие"] = НСтр("ru='Общие'; en='General';", КодЯзыка);
//
Процедура ПриПолученииНаименованийНаборовСвойств(Наименования, КодЯзыка) Экспорт
	
	
	
КонецПроцедуры

// Заполняет наборы свойств объекта. Обычно требуется, если наборов более одного.
//
// Параметры:
//  Объект       - ЛюбаяСсылка      - ссылка на объект со свойствами.
//               - ФормаКлиентскогоПриложения - форма объекта, к которому подключены свойства.
//               - ДанныеФормыСтруктура - описание объекта, к которому подключены свойства.
//
//  ТипСсылки    - Тип - тип ссылки владельца свойств.
//
//  НаборыСвойств - ТаблицаЗначений:
//     * Набор - СправочникСсылка.НаборыДополнительныхРеквизитовИСведений
//     * ОбщийНабор - Булево - Истина, если набор свойств содержит свойства,
//                             общие для всех объектов.
//    // Далее свойства элемента формы типа ГруппаФормы вида обычная группа
//    // или страница, которая создается, если наборов больше одного без учета
//    // пустого набора, который описывает свойства группы удаленных реквизитов.
//
//    // Если значение Неопределено, значит, использовать значение по умолчанию.
//
//    // Для любой группы управляемой формы.
//     * Высота                   - Число
//     * Заголовок                - Строка
//     * Подсказка                - Строка
//     * РастягиватьПоВертикали   - Булево
//     * РастягиватьПоГоризонтали - Булево
//     * ТолькоПросмотр           - Булево
//     * ЦветТекстаЗаголовка      - Цвет
//     * Ширина                   - Число
//     * ШрифтЗаголовка           - Шрифт
//                    
//    // Для обычной группы и страницы.
//     * Группировка              - ГруппировкаПодчиненныхЭлементовФормы
//
//    // Для обычной группы.
//     * Отображение              - ОтображениеОбычнойГруппы
//
//    // Для страницы.
//     * Картинка                 - Картинка
//     * ОтображатьЗаголовок      - Булево
//
//  СтандартнаяОбработка - Булево - начальное значение Истина. Указывает, получать ли
//                         основной набор, когда НаборыСвойств.Количество() равно нулю.
//
//  КлючНазначения   - Неопределено - (начальное значение) - указывает вычислить
//                      ключ назначения автоматически и добавить к значениям свойств
//                      формы КлючНазначенияИспользования и КлючСохраненияПоложенияОкна,
//                      чтобы изменения формы (настройки, положение и размер) сохранялись
//                      отдельно для разного состава наборов.
//                      Например, для каждого вида номенклатуры - свой состав наборов.
//
//                   - Строка - (не более 32 символа) - использовать указанный ключ
//                      назначения для добавления к значениям свойств формы.
//                      Пустая строка - не изменять свойства ключей формы, т.к. они
//                      устанавливается в форме и уже учитывают различия состава наборов.
//
//                    Добавка имеет формат "КлючНаборовСвойств<КлючНазначения>",
//                    чтобы <КлючНазначения> можно было обновлять без повторной добавки.
//                    При автоматическом вычислении <КлючНазначения> содержит хеш
//                    идентификаторов ссылок упорядоченных наборов свойств.
//
Процедура ЗаполнитьНаборыСвойствОбъекта(Знач Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка, КлючНазначения) Экспорт
	
	
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
// 
// Параметры:
//  Настройки - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов.Настройки
//
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
//
// Параметры:
//  КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//  Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//  ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлементов
//
// Параметры:
//  Объект                  - СправочникОбъект.РолиИсполнителей - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

