#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
		Если ТипДанныхЗаполнения = Тип("Структура")
		   И ДанныеЗаполнения.Свойство("Основание")
		   И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Основание.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения.Основание;
		ИначеЕсли ТипДанныхЗаполнения <> Тип("Структура")
		        И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения;
		КонецЕсли;
		
		ЗаполнитьПоДокументуОснованию(ДокументОснование);
		
	КонецЕсли;
		
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если НЕ ПолучитьФункциональнуюОпцию("ВестиУчетПоДоговорам") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДоговорКонтрагента");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ДОПП Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ДокументПартии");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КодВидаТранспорта");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КоличествоПоТНВЭД");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.СтранаПроисхождения");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.СтавкаНДС");
		ПроверитьПоляПрослеживаемости(Отказ);
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ДатаВвоза");
		МассивНепроверяемыхРеквизитов.Добавить("Перевозчик");
		МассивНепроверяемыхРеквизитов.Добавить("РегистрационныйЗнак");
		МассивНепроверяемыхРеквизитов.Добавить("ОсобыйПризнакДОПП");
		МассивНепроверяемыхРеквизитов.Добавить("ОсобыйПризнакЗаявителя");
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ОсобыйПризнакДОПП");
	КонецЕсли;
	
	РаздельныйУчетНДСНаСчете19 = УчетнаяПолитика.РаздельныйУчетНДСНаСчете19(Организация, Дата);
	ЗабалансовыеСчета          = ПланыСчетов.Хозрасчетный.СчетаЗабалансовогоУчетаЗапасов();
	ПлательщикНДС              = УчетнаяПолитика.ПлательщикНДС(Организация, Дата)
		ИЛИ УчетнаяПолитика.ПлательщикНДСНаУСНСВычетами(Организация, Дата);
	ВедетсяПростойУчетЕНП      = УчетНДСПереопределяемый.ВедетсяПростойУчетЕНП(Дата, Организация);
	
	ЕстьЗабалансовыеСчета = Ложь;
	ДатаДекларирования    = '00010101'; // для проверки того, что товары в документе ввезены в одном месяце
	Для Каждого Строка Из Товары Цикл
		
		Префикс = "Объект.Товары[%1].";
		Префикс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Префикс, Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ="));
		
		СчетУчетаЗабалансовый = ЗабалансовыеСчета.Найти(Строка.СчетУчета) <> Неопределено;
		
		Если СчетУчетаЗабалансовый
			И НЕ ЕстьЗабалансовыеСчета Тогда
			
			ЕстьЗабалансовыеСчета = Истина;
			
		КонецЕсли;
		
		Если СчетУчетаЗабалансовый
			И Строка.СуммаНДС <> 0 Тогда
			
			Если НЕ ЗначениеЗаполнено(Строка.Контрагент) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Колонка",
					"Заполнение",
					НСтр("ru='Комитент'"),
					Строка.НомерСтроки,
					НСтр("ru='Товары, ввозимые из стран Таможенного Союза'"));
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Префикс + "Контрагент", , Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Строка.ДоговорКонтрагента) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Заполнение",
				НСтр("ru='Договор комитента'"),
				Строка.НомерСтроки,
				НСтр("ru='Товары, ввозимые из стран Таможенного Союза'"));
			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Префикс + "ДоговорКонтрагента", , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если (ЗначениеЗаполнено(Строка.Контрагент)
			ИЛИ ЗначениеЗаполнено(Строка.ДоговорКонтрагента))
			И НЕ СчетУчетаЗабалансовый Тогда
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Корректность",
				НСтр("ru='Счет учета'"),
				Строка.НомерСтроки,
				НСтр("ru='Товары, ввозимые из стран Таможенного Союза'"),
				НСтр("ru='Следует указать забалансовый счет.'"));
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Префикс + "СчетУчета", , Отказ);
				
		КонецЕсли;
		
		Если Строка.СуммаНДС <> 0
			И НЕ ЗначениеЗаполнено(Строка.СчетУчетаНДС)
			И ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ЗаявлениеОВвозе
			И (ПлательщикНДС
				ИЛИ СчетУчетаЗабалансовый) Тогда
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Заполнение",
				НСтр("ru='Счет учета НДС'"),
				Строка.НомерСтроки,
				НСтр("ru='Товары, ввозимые из стран Таможенного Союза'"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Префикс + "СчетУчетаНДС", , Отказ);
			
		КонецЕсли;
		
		Если Строка.СуммаНДС <> 0
			И НЕ ЗначениеЗаполнено(Строка.СтавкаНДС) Тогда
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Заполнение",
				НСтр("ru='% НДС'"),
				Строка.НомерСтроки,
				НСтр("ru='Товары, ввозимые из стран Таможенного Союза'"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Префикс + "СтавкаНДС", , Отказ);
			
		КонецЕсли;
		
		Если РаздельныйУчетНДСНаСчете19
			И НЕ ЗначениеЗаполнено(Строка.СпособУчетаНДС)
			И ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ЗаявлениеОВвозе
			И Строка.СуммаНДС <> 0
			И НЕ СчетУчетаЗабалансовый Тогда
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Заполнение",
				НСтр("ru='Способ учета НДС'"),
				Строка.НомерСтроки,
				НСтр("ru='Товары, ввозимые из стран Таможенного Союза'"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Префикс + "СпособУчетаНДС", , Отказ);
			
		КонецЕсли;
		
		Если ВедетсяПростойУчетЕНП Тогда
			ПервыйДеньМесяцаПринятияНаУчет = НачалоМесяца(Строка.ДатаПринятияНаУчет);
			Если Не ЗначениеЗаполнено(ДатаДекларирования) Тогда
				ДатаДекларирования = ПервыйДеньМесяцаПринятияНаУчет;
				Продолжить;
			КонецЕсли;
			
			Если ПервыйДеньМесяцаПринятияНаУчет <> ДатаДекларирования Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Колонка",
					"Корректность",
					НСтр("ru='Документ партии'"),
					Строка.НомерСтроки,
					НСтр("ru='Товары, ввозимые из стран Таможенного Союза'"),
					НСтр("ru='В документ следует включать партии товаров, принятые на учет в одном месяце.'"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Префикс + "ДокументПартии", , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Строка.ПодакцизныйТовар 
			И ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ЗаявлениеОВвозе
			И Строка.СуммаАкциза <> 0 
			И Не ЗначениеЗаполнено(Строка.СчетАкциза) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен ""Счет акциза""'");
			
			Поле = "Товары["+ Формат(Строка.НомерСтроки-1,"ЧГ=") + "].СчетАкциза";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	// Проверка заполнения поля Склад в табличной части
	ТекстСообщения = "";
	Если ЗаполнениеДокументов.ПроверитьНеобходимостьУказанияСкладаВТабличнойЧасти(Товары, ТекстСообщения) Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , "Склад", Отказ);
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.ЗаявлениеОВвозеТоваров.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	// Начисление НДС
	УчетНДС.СформироватьДвиженияВвозТоваровИзТаможенногоСоюза(
		ПараметрыПроведения.ТаблицаНачисленияНДС,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	УчетНДСРаздельный.СформироватьДвиженияВвозТоваровИзТаможенногоСоюза(
		ПараметрыПроведения.ТаблицаНачисленияНДС,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
	
	// Включение НДС в стоимость
	УчетТоваров.СформироватьДвиженияИзменениеСебестоимостиОстатковТоваров(
		ПараметрыПроведения.ТаблицаНДСВСтоимости,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	Документы.ЗаявлениеОВвозеТоваров.СформироватьПроводкуРезервированиеОбеспечительногоПлатежа(
		ПараметрыПроведения.ТаблицаРезервированиеОбеспечительногоПлатежа,
		ПараметрыПроведения.Реквизиты, Движения, Отказ);
		
	Документы.ЗаявлениеОВвозеТоваров.СоздатьНалогиПоКБК(
		ПараметрыПроведения.ТаблицаСозданиеНалогов);
	
	// УСН
	УчетУСН.ПоступлениеРасходовУСН(
		ПараметрыПроведения.ТаблицаПоступлениеРасходовУСН,
		ПараметрыПроведения.ТаблицаРеквизитыУСН, 0, Движения, Отказ);

	Если НЕ Отказ И Движения.РасходыПриУСН.Количество()>0 Тогда
		Движения.РасходыПриУСН.Записать(Истина);
		Движения.РасходыПриУСН.Записывать = Ложь;
	КонецЕсли;
	
	// Учет акцизов
	УчетАкцизов.СформироватьДвиженияНачисленияАкцизовПриВвозеИзЕАЭС(
		ПараметрыПроведения.ТаблицаАкцизы,
		ПараметрыПроведения.Реквизиты,
		Движения);
		
	УчетАкцизов.СформироватьДвиженияОперацииСПодакцизнымиТоварами(
		ПараметрыПроведения.ТаблицаАкцизы,
		ПараметрыПроведения.Реквизиты,
		Движения);

	СтруктураТаблицУСН = Новый Структура("ТаблицаРасчетов", ПараметрыПроведения.ТаблицаПрочиеРасчетыУСН);
	НалоговыйУчетУСН.СформироватьДвиженияУСН(ЭтотОбъект, СтруктураТаблицУСН);
	
	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСДоговорамиКонтрагентовБП.ЗаполнитьДоговорПередЗаписью(ЭтотОбъект);
	
	Если ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ДОПП Тогда
		СуммаДокумента = Окр(Товары.Итог("ОбеспечительныйПлатеж"));
	Иначе
		СуммаДокумента = Окр(Товары.Итог("СуммаНДС"));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидОперации) Тогда
		ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ЗаявлениеОВвозе;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров")
		И ПрослеживаемостьБРУ.ВедетсяУчетПрослеживаемыхТоваров(Дата) Тогда
	
		ИменаТабличныхЧастей = Новый Массив;
		ИменаТабличныхЧастей.Добавить("Товары");
		ОбщегоНазначенияБПКлиентСервер.ЗаполнитьИдентификаторыСтрок(ЭтотОбъект, ИменаТабличныхЧастей);
		
		ПрослеживаемыйТовар = Товары.НайтиСтроки(Новый Структура("ПрослеживаемыйТовар", Истина));
		Если ПрослеживаемыйТовар.Количество() = 0 Тогда
			СведенияПрослеживаемости.Очистить();
		Иначе
			ОбщегоНазначенияБП.ОчиститьЛишниеДанныеПоПрослеживаемости(ЭтотОбъект, ИменаТабличныхЧастей);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров")
		И ПрослеживаемостьБРУ.ВедетсяУчетПрослеживаемыхТоваров(Дата) Тогда
		СведенияПрослеживаемости.Очистить();
		РаботаСНоменклатуройБП.ОбновитьПризнакПрослеживаемости(Товары, Истина, Дата);
	КонецЕсли;
	
	ПоставкаОтменена = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоДокументуОснованию(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "ВидОперации");
				
		Если ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия
			И ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары
			И ВидОперации <> Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Оборудование Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнениеДокументов.ЗаполнитьПоОснованию(ЭтотОбъект, Основание);
		ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ЗаявлениеОВвозе;
		
		ДанныеОбъекта = Новый Структура("Дата, Организация, ВалютаДокумента");
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ЭтотОбъект);
		ДанныеОбъекта.Вставить("ВалютаРегламентированногоУчета", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
		ДанныеОбъекта.Вставить("ВалютаДолларыСША", Справочники.Валюты.НайтиПоКоду("840"));
		
		ТоварыПоДаннымПоступления = Документы.ЗаявлениеОВвозеТоваров.ТоварыПоДаннымПоступления(ДанныеОбъекта, Основание);
		
		Если ТоварыПоДаннымПоступления.Количество() > 0 Тогда
			Товары.Загрузить(ТоварыПоДаннымПоступления);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		
		ЗаполнениеДокументов.ЗаполнитьПоОснованию(ЭтотОбъект, Основание);
		ВидОперации = Перечисления.ВидыОперацийВвозТоваровИзЕАЭС.ДОПП;
		
		ДатаВвоза = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Дата");
		ДанныеОбъекта = Новый Структура("Дата,Организация,ВалютаДокумента,ДатаВвоза,ОсобыйПризнакЗаявителя");
		ЗаполнитьЗначенияСвойств(ДанныеОбъекта, ЭтотОбъект);
		ДанныеОбъекта.Вставить("ВалютаРегламентированногоУчета", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
		
		ТоварыПоСчетуПоставщика = Документы.ЗаявлениеОВвозеТоваров.ТоварыПоСчетуПоставщика(ДанныеОбъекта, Основание);
		
		Если ТоварыПоСчетуПоставщика.Количество() > 0 Тогда
			Товары.Загрузить(ТоварыПоСчетуПоставщика);
		КонецЕсли;
		
		ЗаполнениеДокументов.Заполнить(ЭтотОбъект, Основание, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПоляПрослеживаемости(Отказ)
	
	Если ИнтерфейсыВзаимодействияБРО.ОрганизацияИмеетУчетнуюЗапись(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Товары Цикл
		
		ИмяТаблицы = "Товары";
		СуммаВключаетНДС = Истина; // Вычитать из стоимости сумму начисленного НДС при ввозе не требуется
		Префикс = "Товары[%1].";
		Префикс = СтрШаблон(Префикс, Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ="));
		
		НужноЗаполнениеКолонкиНоменклатура    = Ложь;
		НужноЗаполнениеКолонкиСумма           = Ложь;
			
		Если СтрокаТаблицы.ПрослеживаемыйТовар
		   И СтрокаТаблицы.Количество > 0 Тогда
			
			Отбор = Новый Структура("ИдентификаторСтроки", СтрокаТаблицы.ИдентификаторСтроки);
			МассивСтрокСведенияПрослеживаемости = СведенияПрослеживаемости.Выгрузить(Отбор);

			Если СтрокаТаблицы.ПрослеживаемыйКомплект И МассивСтрокСведенияПрослеживаемости.Количество() = 0 Тогда
				ТекстСообщенияРасшифрвка = НСтр("ru = 'Не заполнены данные по РНПТ'");
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка","Корректность", НСтр("ru = 'РНПТ'"),
				СтрокаТаблицы.НомерСтроки, ИмяТаблицы, ТекстСообщенияРасшифрвка);
				Поле = Префикс + "РНПТ";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			ИначеЕсли Не СтрокаТаблицы.ПрослеживаемыйКомплект И (МассивСтрокСведенияПрослеживаемости.Количество() = 0 
					ИЛИ (ПрослеживаемостьБП.КоличествоРНПТКСтроке(МассивСтрокСведенияПрослеживаемости) <> СтрокаТаблицы.Количество)) Тогда
					ТекстСообщенияРасшифрвка = НСтр("ru = 'Количество РНПТ не совпадает с количеством товара в строке.'");
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка","Корректность", НСтр("ru = 'РНПТ'"),
					СтрокаТаблицы.НомерСтроки, ИмяТаблицы, ТекстСообщенияРасшифрвка);
					Поле = Префикс + "РНПТ";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			// Для прослеживаемого товара обязательно указывается страна происхождения.
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтранаПроисхождения) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Страна происхождения'"),
					СтрокаТаблицы.НомерСтроки, ИмяТаблицы);
				Поле = Префикс + "СтранаПроисхождения";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			Если СтрокаТаблицы.ПрослеживаемыйКомплект Тогда
				СуммаБезНДС = СтрокаТаблицы.ФактурнаяСтоимость - СтрокаТаблицы.СуммаАкциза;
				Если СуммаБезНДС < МассивСтрокСведенияПрослеживаемости.Итог("Сумма") Тогда 
					ТекстСообщения = НСтр("ru = 'Сумма по прослеживаемым комплектующим больше стоимости товара'");
					Поле = "" + ИмяТаблицы + "["+ Формат(СтрокаТаблицы.НомерСтроки-1,"ЧГ=") + "].РНПТ";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого Строка Из МассивСтрокСведенияПрослеживаемости Цикл
				Если СтрокаТаблицы.ПрослеживаемыйКомплект И Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда 
					ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Комплектующие"" в данных по РНПТ'");
					Поле = "" + ИмяТаблицы + "["+ Формат(СтрокаТаблицы.НомерСтроки-1,"ЧГ=") + "].РНПТ";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Строка.Количество) Тогда
					ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Количество"" в данных по РНПТ'");
					Поле = "" + ИмяТаблицы + "["+ Формат(СтрокаТаблицы.НомерСтроки-1,"ЧГ=") + "].РНПТ";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
				
				Если СтрокаТаблицы.ПрослеживаемыйКомплект И Не ЗначениеЗаполнено(Строка.Сумма) Тогда
					ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""Сумма без НДС"" в данных по РНПТ'");
					Поле = "" + ИмяТаблицы + "["+ Формат(СтрокаТаблицы.НомерСтроки-1,"ЧГ=") + "].РНПТ";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Строка.РНПТ) Тогда
					ТекстСообщения = НСтр("ru = 'Не заполнена колонка ""РНПТ"" в данных по РНПТ'");
					Поле = "" + ИмяТаблицы + "["+ Формат(СтрокаТаблицы.НомерСтроки-1,"ЧГ=") + "].РНПТ";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
				
			КонецЦикла;
		
		ИначеЕсли Не СтрокаТаблицы.ПрослеживаемыйТовар Тогда
			
			Отбор = Новый Структура("ИдентификаторСтроки", СтрокаТаблицы.ИдентификаторСтроки);
			СтрокиСРНПТ = СведенияПрослеживаемости.НайтиСтроки(Отбор);
			Для Каждого СтрокаСРНПТ Из СтрокиСРНПТ Цикл
				СведенияПрослеживаемости.Удалить(СтрокаСРНПТ);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли



