
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьКартинкиФормы();
	
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	
	ОформитьПригласительныйБаннер();
	
	УстановитьФункциональныеОпцииФормы();
	
	СтатусыОрганизаций = СтатусыРегистрацииОрганизацийВСервисе();
	ВыбранныеОрганизации.ЗагрузитьЗначения(СтатусыОрганизаций.Организации);
	
	НастроитьСовместимостьИнтерфейсов();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКартинкиФормы()
	
	НаименованиеКартинкиБаннера = СервисСверкиРасчетовПереопределяемый.КартинкаЛоготипаПомощника("БаннерПодключения");
	Если ЗначениеЗаполнено(НаименованиеКартинкиБаннера) Тогда
		Элементы.ДекорацияПомощник.Картинка = БиблиотекаКартинок[НаименованиеКартинкиБаннера];
	КонецЕсли;
	НаименованиеКартинкиСервисВключен = СервисСверкиРасчетовПереопределяемый.КартинкаЛоготипаПомощника("СтатусСервисВключен");
	Если ЗначениеЗаполнено(НаименованиеКартинкиСервисВключен) Тогда
		Элементы.ДекорацияСервисВключен.Картинка = БиблиотекаКартинок[НаименованиеКартинкиСервисВключен];
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "БизнесСеть_РегистрацияОрганизаций" Тогда
		УстановитьФункциональныеОпцииФормы();
		УправлениеФормой(ЭтотОбъект);
		СтатусыОрганизаций = СтатусыРегистрацииОрганизацийВСервисе(Ложь);
		Если СтатусыОрганизаций.КоличествоПодключенных = 0 
			И НЕ ЕстьОжиданиеОбработкиЗаявления Тогда
			ОтключитьСервис();
			Если ЭтоПолныйИнтерфейс Тогда
				ОбновитьИнтерфейс();
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ОбсужденияПодключены" Тогда 
		УстановитьФункциональныеОпцииФормы();
		Если ОбсужденияПодключены И Не ОповещенияСверкиВключены Тогда
			ПодключитьОбсужденияФрагмент(Ложь);
		КонецЕсли;
		УправлениеФормой(ЭтотОбъект);
	ИначеЕсли ИмяСобытия = "ОповещенияСверкиВключены" Тогда
		УстановитьФункциональныеОпцииФормы();
		УправлениеФормой(ЭтотОбъект);
	ИначеЕсли ИмяСобытия = "ВыбраныОрганизацииДляПодключенияСверки" Тогда 
		Если Параметр.Количество() > 0 Тогда
			// Не загружаем список если ничего не выбрано.
			ВыбранныеОрганизации.ЗагрузитьЗначения(Параметр);
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы И Не ЭтоПолныйИнтерфейс Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДекорацияКраткаяИнформацияОСервисОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "open:Description" Тогда
		СтандартнаяОбработка = Ложь;
		СервисСверкиРасчетовКлиент.ОткрытьНавигационнуюСсылкуПодробнееОСервисе();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПользовательскоеСоглашениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "open:userAgreement" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("ОбщаяФорма.СервисСверкиРасчетовПользовательскоеСоглашение");
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДекорацияНастроитьОповещенияНажатие(Элемент)
	
	Если ОповещенияСверкиВключены Тогда
		КлючГлобальнойНастройкиОповещений = СервисСверкиРасчетовВызовСервера.КлючГлобальнойНастройкиОповещений();
		Если КлючГлобальнойНастройкиОповещений <> Неопределено Тогда
			ОткрытьФорму("Справочник.СервисСверкиРасчетовНастройкиОповещенийПользователей.ФормаОбъекта", 
			Новый Структура("Ключ, ПерсональнаяНастройка", КлючГлобальнойНастройкиОповещений, Ложь));
		КонецЕсли;
	Иначе
		Если ЭтоПолноправныйПользователь Тогда
			ПодключитьОбсужденияФрагмент(Ложь);
		Иначе
			ТекстСообщения =
			НСтр("ru = 'Для подключения обсуждений нужны права администратора'") + Символы.ПС + Символы.ПС
			+ НСтр("ru = 'Попросите администратора подключить обсуждения'") + Символы.ПС
			+ НСтр("ru = 'по ссылке ""Подключить обсуждения"" на этой форме или в административных настройках'");
			
			ПоказатьПредупреждение(,ТекстСообщения,, НСтр("ru = 'Подключение обсуждений'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодключенныеОрганизацииНажатие(Элемент)
	
	ОткрытьФорму("ОбщаяФорма.СервисСверкиРасчетовПодключенныеОрганизации");
	
КонецПроцедуры

&НаКлиенте
Процедура ПояснениеВключенногоСервисаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьОрганизацииДляОтправкиЗаявлений" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму("ОбщаяФорма.СервисСверкиРасчетовПодключенныеОрганизации");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОрганизацииКПодключениюНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборОрганизацийДляПодключения", Истина);
	ПараметрыФормы.Вставить("ВыбранныеОрганизации", ВыбранныеОрганизации);
	ПараметрыФормы.Вставить("ПоказыватьСтатус", КоличествоОрганизацийДляПовторногоПодключения > 0);
	
	ОткрытьФорму("ОбщаяФорма.СервисСверкиРасчетовПодключенныеОрганизации", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСервисаНажатие(Элемент)
	
	СписокДействий = Новый СписокЗначений;
	СписокДействий.Добавить("КакРаботает", НСтр("ru = 'Подробнее о сервисе'"));
	Если ОповещенияСверкиВключены Тогда
		СписокДействий.Добавить("Оповещения", НСтр("ru = 'Настроить оповещения'"));
	КонецЕсли;
	СписокДействий.Добавить("Отключить", НСтр("ru = 'Отключить сервис...'"));

	Оповещение = Новый ОписаниеОповещения(
		"ПослеВыбораДействияНастроекСервиса",
		ЭтаФорма);

	ПоказатьВыборИзСписка(
		Оповещение,
		СписокДействий,
		Элементы.НастройкаСервиса);

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОткрытьОтчетНажатие(Элемент)
	
	СервисСверкиРасчетовКлиент.СформироватьОтчетОСверкеКонтекстно();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьСервис(Команда)
	
	Если НЕ ИнтернетПоддержкаПодключена Тогда
		ПодключитьИнтернетПоддержкуПользователей();
		Возврат;
	КонецЕсли;
	
	ВключитьСервисФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьСервисФрагмент()
	
	Если НЕ ОповещенияСверкиВключены
		И ОбсужденияПодключены Тогда
		ПодключитьОбсужденияФрагмент(Истина);
		Возврат;
	КонецЕсли;
	
	Элементы.ТекстОжиданияГотовности.Заголовок = НСтр("ru='Регистрация в сервисе.'");
	
	Элементы.ИнформацияОСервисе.Видимость     = Ложь;
	Элементы.БаннерВключенияСверки.Видимость  = Ложь;
	Элементы.ГруппаВключениеСервиса.Видимость = Истина;
	
	ПодключитьОбработчикОжидания("Подключаемый_РегистрацияОрганизацийВСервисеВФоне", 1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьСервис()
	
	СервисСверкиРасчетов.ОтключитьСверку();
	УстановитьФункциональныеОпцииФормы();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбсужденияФрагмент(ВключатьСервис = Истина)
	
	Если НЕ ОбсужденияПодключены Тогда
		МодульОбсужденияКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбсужденияКлиент");
		МодульОбсужденияКлиент.ПоказатьПодключение();
	Иначе 
		ОповещенияСверкиВключены = СервисСверкиРасчетовВызовСервера.ВключитьОповещениеСверки();
		Если ОповещенияСверкиВключены Тогда
			УправлениеФормой(ЭтотОбъект);
		КонецЕсли;
		Если ВключатьСервис Тогда
			ВключитьСервисФрагмент();
		Иначе
			ОтправитьТестовоеОповещение();
		КонецЕсли;
	КонецЕсли;
	УстановитьФункциональныеОпцииФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьСовместимостьИнтерфейсов()
	
	ЭтоИнтерфейсТакси = СервисСверкиРасчетов.ЭтоИнтерфейсТакси();
	
	Если НЕ ЭтоИнтерфейсТакси Тогда
		
		СистемнаяИнформация = Новый СистемнаяИнформация();
		ДоступенИнтерфейс85 = ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.5.1.1150") >= 0;
		Если ДоступенИнтерфейс85 Тогда
			Элементы.ДекорацияПомощник.Высота       = 4;
			Элементы.БаннерВключенияСверки.ЦветФона = Новый Цвет;
			Элементы.БаннерВключенияСверки.Ширина   = 74;
			
			// Свойства доступны, начиная с платформы 8.5
			Выполнить("Элементы.БаннерВключенияСверки.ОтображатьКакКарточку = Истина");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСообщенияФормы()
	
	КоличествоОрганизацийДляПовторногоПодключения = ОрганизацииДляПовторногоПодключения();
	СтатусыОрганизаций = СтатусыРегистрацииОрганизацийВСервисе();
	
	НиктоНеПодключен = СтатусыОрганизаций.КоличествоПодключенных = 0;
	
	// Сообщение включенного сервиса.
	ЧастиСообщения = Новый Массив;
	Если НиктоНеПодключен Тогда
		Если ЕстьОжиданиеОбработкиЗаявления Тогда
			Если КоличествоОрганизацийДляПовторногоПодключения > 1 Тогда
				ЧастиСообщения.Добавить(НСтр("ru='Ожидаем обработку заявлений (до 2 рабочих дней) '"));
			Иначе
				ЧастиСообщения.Добавить(НСтр("ru='Ожидаем обработку заявления (до 2 рабочих дней) '"));
			КонецЕсли;
			СсылкаНаОтправку = Новый ФорматированнаяСтрока("Подробнее",,,,"ОткрытьОрганизацииДляОтправкиЗаявлений");
			ЧастиСообщения.Добавить(СсылкаНаОтправку);
		Иначе
			ЧастиСообщения.Добавить(НСтр("ru='Для начала сверки необходимо '"));
			Если КоличествоОрганизацийДляПовторногоПодключения > 1 Тогда
				СсылкаНаОтправку = Новый ФорматированнаяСтрока("Отправить заявления",,,,"ОткрытьОрганизацииДляОтправкиЗаявлений");
			ИначеЕсли КоличествоОрганизацийДляПовторногоПодключения = 1 Тогда
				СсылкаНаОтправку = Новый ФорматированнаяСтрока("Отправить заявление",,,,"ОткрытьОрганизацииДляОтправкиЗаявлений");
			Иначе
				СсылкаНаОтправку = Новый ФорматированнаяСтрока("Подключить организацию",,,,"ОткрытьОрганизацииДляОтправкиЗаявлений");
			КонецЕсли;
			ЧастиСообщения.Добавить(СсылкаНаОтправку);
		КонецЕсли;
		
	ИначеЕсли ЕстьПервыеРезультатыСверки Тогда
		ЧастиСообщения.Добавить(НСтр("ru='Новые результаты сверки будут доступны: '"));
	Иначе
		ЧастиСообщения.Добавить(НСтр("ru='Первые результаты сверки будут доступны: '"));
	КонецЕсли;
	
	Если Не НиктоНеПодключен
		И ЗначениеЗаполнено(ДатаСледующегоОбмена) Тогда
		ДатаСледующегоОбменаСтрока = Формат(ДатаСледующегоОбмена, "ДФ='дддд, дд ММММ'");
		ДатаСледующегоОбменаСтрока = Новый ФорматированнаяСтрока(Строка(ДатаСледующегоОбменаСтрока), ШрифтыСтиля.СервисСверкиРасчетовПолужирныйШрифт);
		ЧастиСообщения.Добавить(ДатаСледующегоОбменаСтрока);
	КонецЕсли;
	Элементы.ПояснениеВключенногоСервиса.Заголовок = Новый ФорматированнаяСтрока(ЧастиСообщения);
	
	// Сообщения обсуждений.
	Если ОповещенияСверкиВключены Тогда
		Если ЕстьПервыеРезультатыСверки Тогда
			Элементы.ЗаголовокОбсуждения.Заголовок = НСтр("ru='Оповещения о новых расхождениях приходят на вкладку ""Обсуждения""'");
			Элементы.ПоясненияОбсуждения.Заголовок = НСтр("ru='Здесь можно настроить кому будут приходить оповещения'");
		Иначе
			Элементы.ЗаголовокОбсуждения.Заголовок = НСтр("ru='Первое оповещение о результатах сверки придет на вкладку ""Обсуждения""'");
			Если НиктоНеПодключен Тогда
				Элементы.ПоясненияОбсуждения.Заголовок = НСтр("ru='Далее оповещения будут приходить при обнаружении новых расхождений'");
			Иначе
				Элементы.ПоясненияОбсуждения.Заголовок = НСтр("ru='Тестовое сообщение уже отправлено.
					|Далее оповещения будут приходить при обнаружении новых расхождений'");
			КонецЕсли;
		КонецЕсли;
		Элементы.ДекорацияНастроитьОповещения.Заголовок = НСтр("ru='Настроить оповещения'");
	Иначе
		Если ОбсужденияПодключены Тогда
			Если ЕстьПервыеРезультатыСверки Тогда
				Элементы.ЗаголовокОбсуждения.Заголовок = НСтр("ru='Чтобы не пропустить новые расхождения, включите оповещения'");
			Иначе
				Элементы.ЗаголовокОбсуждения.Заголовок = НСтр("ru='Чтобы не пропустить первые результаты сверки, включите оповещения'");
			КонецЕсли;
			Элементы.ПоясненияОбсуждения.Заголовок = НСтр("ru='После этого сообщения о результатах сверки будут приходить автоматически'");
			Элементы.ДекорацияНастроитьОповещения.Заголовок = НСтр("ru='Включить оповещения'");
		Иначе
			Если ЕстьПервыеРезультатыСверки Тогда
				Элементы.ЗаголовокОбсуждения.Заголовок = НСтр("ru='Чтобы не пропустить новые расхождения, подключите ""Обсуждения""'");
			Иначе
				Элементы.ЗаголовокОбсуждения.Заголовок = НСтр("ru='Чтобы не пропустить первые результаты сверки, подключите ""Обсуждения""'");
			КонецЕсли;
			Элементы.ПоясненияОбсуждения.Заголовок = НСтр("ru='После этого сообщения о результатах сверки будут приходить автоматически'");
			Элементы.ДекорацияНастроитьОповещения.Заголовок = НСтр("ru='Подключить обсуждения'");
		КонецЕсли;
	КонецЕсли;
	
	// Сообщения отчета.
	Если ЕстьПервыеРезультатыСверки Тогда
		Элементы.ЗаголовокОтчет.Заголовок = НСтр("ru='Подробные результаты сверки можно посмотреть в отчете ""Сверка документов с контрагентами""'");
	КонецЕсли;
	
	// Инструкция по отправке заявлений
	Если НиктоНеПодключен И ЕстьОжиданиеОбработкиЗаявления Тогда
		Элементы.ЗаголовокИнструкция.Заголовок = НСтр("ru='Сейчас ничего делать не нужно'");
	Иначе
		Элементы.ЗаголовокИнструкция.Заголовок = НСтр("ru='После отправки заявлений ничего делать не нужно'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.КоличествоОрганизацийДляПовторногоПодключения = ОрганизацииДляПовторногоПодключения();
	
	// Включение сервиса
	СтатусыОрганизаций = СтатусыРегистрацииОрганизацийВСервисе();
	
	Элементы.ИнформацияОСервисе.Видимость     = НЕ Форма.СервисПодключен;
	Элементы.БаннерВключенияСверки.Видимость  = НЕ Форма.СервисПодключен;
	Элементы.ГруппаСервисВключен.Видимость    = Форма.СервисПодключен;
	Если Форма.СервисПодключен Тогда
		Элементы.ГруппаВключениеСервиса.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаНесколькоОрганизацийКПодключению.Видимость = Форма.ИспользоватьНесколькоОрганизаций;
	
	ПодключеноНольИТребуетсяЗаявление = СтатусыОрганизаций.КоличествоПодключенных = 0 И Форма.КоличествоОрганизацийДляПовторногоПодключения > 0;
	
	Элементы.ДекорацияПодключенныеОрганизации.Видимость = Форма.ИспользоватьНесколькоОрганизаций И НЕ ПодключеноНольИТребуетсяЗаявление;
	Элементы.ДекорацияОрганизаций.Видимость = Форма.ИспользоватьНесколькоОрганизаций И НЕ ПодключеноНольИТребуетсяЗаявление;
	
	Элементы.НадписьНичегоДелатьНеНужно.Видимость = Форма.КоличествоОрганизацийДляПовторногоПодключения = 0
		И НЕ Форма.ЕстьПервыеРезультатыСверки И Форма.ОповещенияСверкиВключены;
		
	Элементы.ИнструкцияПоОтправкеЗаявлений.Видимость = ПодключеноНольИТребуетсяЗаявление;
	Элементы.ГруппаОбсуждения.Видимость = НЕ ПодключеноНольИТребуетсяЗаявление;
	Элементы.ГруппаОтчет.Видимость      = НЕ ПодключеноНольИТребуетсяЗаявление;
	
	Если Форма.ИспользоватьНесколькоОрганизаций Тогда
		
		// Группа "Баннер включения сверки"
		Элементы.СсылкаОрганизацииКПодключению.Заголовок = СтрШаблон(
		НСтр("ru='%1 из %2'"),
		Форма.ВыбранныеОрганизации.Количество(),
		СтатусыОрганизаций.Количество);
		
		Элементы.ДекрацияОрганизацийКПодключению.Заголовок = ФормаСловаОрганизацииПослеИз(СтатусыОрганизаций.Количество);
		
		// Группа "Сервис включен"
		Если Не ПодключеноНольИТребуетсяЗаявление Тогда
			Элементы.НадписьСервисВключен.Заголовок = НСтр("ru='Сервис включен для '");
			Элементы.ДекорацияПодключенныеОрганизации.Заголовок = СтрШаблон(
			НСтр("ru='%1 из %2'"),
			СтатусыОрганизаций.КоличествоПодключенных,
			СтатусыОрганизаций.Количество);
			
			Элементы.ДекорацияОрганизаций.Заголовок = ФормаСловаОрганизацииПослеИз(СтатусыОрганизаций.Количество);
		Иначе
			Элементы.НадписьСервисВключен.Заголовок = НСтр("ru='Сервис включен'");
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ДекорацияТребуетсяЗаявление.Видимость = НЕ Форма.ЕстьОжиданиеОбработкиЗаявления И Форма.КоличествоОрганизацийДляПовторногоПодключения > 1;
	Элементы.ДекорацияОжидаемЗаявление.Видимость   = ПодключеноНольИТребуетсяЗаявление И Форма.ЕстьОжиданиеОбработкиЗаявления;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ФормаСловаОрганизацииПослеИз(Количество) 
	
	Количество = Количество % 100;
	ПоследняяЦифра = Количество % 10;
	
	Если ПоследняяЦифра = 1 И Количество <> 11 Тогда
		Возврат НСтр("ru='организации'");
	КонецЕсли;
	
	Возврат НСтр("ru='организаций'");
	
КонецФункции
	
&НаСервереБезКонтекста
Функция ОрганизацииДляПовторногоПодключения()
	
	Возврат СервисСверкиРасчетовПереключениеЛогинаИТС.ОрганизацииДляПовторногоПодключения().Количество();
	
КонецФункции

&НаСервереБезКонтекста
Функция ИнтернетПоддержкаПодключена()

	МодульИПП = ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователей");
	Возврат МодульИПП.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();

КонецФункции 

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуПользователей()

	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.БазоваяФункциональностьБИП") Тогда
		Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетПоддержкаПользователейКлиент");
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуЗавершение", ЭтотОбъект);
		Модуль.ПодключитьИнтернетПоддержкуПользователей(ОповещениеОЗакрытии, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		УстановитьФункциональныеОпцииФормы();
		ВключитьСервисФрагмент();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()

	ЭтоПолныйИнтерфейс               = СервисСверкиРасчетовПереопределяемый.ЭтоПолныйИнтерфейс();
	ИспользоватьНесколькоОрганизаций = СервисСверкиРасчетовПереопределяемый.ИспользоватьНесколькоОрганизаций(); 
	НастройкаОбсужденийДоступна      = СервисСверкиРасчетовПереопределяемый.НастройкаОбсужденийДоступна();
	ИнтернетПоддержкаПодключена      = ИнтернетПоддержкаПодключена();
	ЕстьОжиданиеОбработкиЗаявления   = СервисСверкиРасчетов.ЕстьОжидающиеЗаявления();
	
	СервисПодключен = ПолучитьФункциональнуюОпцию("ИспользуетсяСервисСверкиРасчетов");
	Если СервисПодключен Тогда
		ДатаАктуальностиРасхождений = РегистрыСведений.СервисСверкиРасчетовОчередьЗапросов.ДатаАктуальностиРасхождений(Неопределено, '00010101', '00010101');
		Если ЗначениеЗаполнено(ДатаАктуальностиРасхождений) Тогда
			ЕстьПервыеРезультатыСверки = Истина;
		КонецЕсли;
		ДатаСледующегоОбмена = СервисСверкиРасчетов.ДатаБлижайшегоОбменаССервисом();
	КонецЕсли;
	
	ОбсужденияПодключены     = СервисСверкиРасчетовВызовСервера.ОбсужденияПодключены();
	ОповещенияСверкиВключены = СервисСверкиРасчетовВызовСервера.ОповещенияСверкиВключены();
	
	УстановитьСообщенияФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатусыРегистрацииОрганизацийВСервисе(ТолькоДоступные = Истина)
	
	Возврат СервисСверкиРасчетов.СтатусыРегистрацииОрганизацийВСервисе(ТолькоДоступные);
	
КонецФункции

&НаСервере
Процедура УстановитьПризнакПодключенияСервиса()
	
	Константы.ИспользуетсяСервисСверкиРасчетов.Установить(Истина);
	УстановитьФункциональныеОпцииФормы();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РегистрацияОрганизацийВСервисеВФоне()
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	РегистрацияОрганизацийВСервисе = ЗарегистрироватьОрганизацииВСервисеВФоне(УникальныйИдентификатор, АдресХранилища, ВыбранныеОрганизации.ВыгрузитьЗначения());
	Если РегистрацияОрганизацийВСервисе.Статус = "Выполнено" Тогда
		ПослеЗавершенияРегистрацииОрганизацийВСервисеВФоне(РегистрацияОрганизацийВСервисе);
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении   = Новый ОписаниеОповещения("ПослеЗавершенияРегистрацииОрганизацийВСервисеВФоне", ЭтотОбъект);
	ПараметрыОжидания       = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РегистрацияОрганизацийВСервисе, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияРегистрацииОрганизацийВСервисеВФоне(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус <> "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	ПослеЗавершенияРегистрацииОрганизацийВСервисеВФонеФрагмент(Результат);
	
	Если Не УспешнаяРегистрацияОрганизаций Тогда
		Возврат;
	КонецЕсли;
	
	Если СервисПодключен Тогда
		Элементы.ТекстОжиданияГотовности.Заголовок = НСтр("ru='Подготовка документов к сверке..'");
		ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьДействияПоПодключениюСервисаВФоне", 1, Истина);
	КонецЕсли;

	Если ЭтоПолныйИнтерфейс Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗавершенияРегистрацииОрганизацийВСервисеВФонеФрагмент(Знач Результат)
	
	УспешнаяРегистрацияОрганизаций = Ложь;
	
	ТаблицаРезультатовРегистрации = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(ТаблицаРезультатовРегистрации) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоОшибокПодключения = 0;
	
	Для каждого СтрокаРегистрации Из ТаблицаРезультатовРегистрации Цикл
		Если ЗначениеЗаполнено(СтрокаРегистрации.ТекстОшибки) Тогда
			КоличествоОшибокПодключения = КоличествоОшибокПодключения + 1;
		КонецЕсли;
	КонецЦикла;
	
	СтатусыОрганизаций = СтатусыРегистрацииОрганизацийВСервисе(Ложь);
	УспешнаяРегистрацияОрганизаций = КоличествоОшибокПодключения < СтатусыОрганизаций.Количество;
	
	// Всегда включаем сервис, даже если не удалось подключить организации.
	УстановитьПризнакПодключенияСервиса();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗарегистрироватьОрганизацииВСервисеВФоне(УникальныйИдентификатор, АдресХранилища, ОрганизацииДляПодключения)
	
	НаименованиеЗадания = СтрШаблон("%1. Регистрация организаций в сервисе 1С:Бизнес-сеть", СервисСверкиРасчетов.ИмяСервиса());
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "СервисСверкиРасчетов.ЗарегистрироватьОрганизацииВСервисе", АдресХранилища, ОрганизацииДляПодключения);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьДействияПоПодключениюСервисаВФоне()
	
	РегистрацияДокументовКСверке = ЗарегистрироватьКСверкеРанееВведенныеДокументыВФоне(УникальныйИдентификатор);
	Если РегистрацияДокументовКСверке.Статус = "Выполнено" Тогда
		ПослеЗавершенияРегистрацииДокументовКСверке(РегистрацияДокументовКСверке);
		Возврат;
	КонецЕсли;
	
	Элементы.ТекстОжиданияГотовности.Заголовок = НСтр("ru='Подготовка документов к сверке...'");
	
	ОповещениеОЗавершении   = Новый ОписаниеОповещения("ПослеЗавершенияРегистрацииДокументовКСверке", ЭтотОбъект);
	ПараметрыОжидания       = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РегистрацияДокументовКСверке, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗарегистрироватьКСверкеРанееВведенныеДокументыВФоне(УникальныйИдентификатор)
	
	НаименованиеЗадания = СтрШаблон("%1. Регистрация к сверке ранее введенных документов", СервисСверкиРасчетов.ИмяСервиса());
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "СервисСверкиРасчетов.ЗарегистрироватьКСверкеРанееВведенныеДокументы");
	
КонецФункции

&НаКлиенте
Процедура ПослеЗавершенияРегистрацииДокументовКСверке(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	УправлениеФормой(ЭтотОбъект);
	
	Если ОповещенияСверкиВключены Тогда 
		ОтправитьТестовоеОповещение();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НаименованиеКонтрагентаДляБаннера(Контрагент)
	
	НаименованиеКонтрагента = Строка(Контрагент);
	// Ограничим длину наименования контрагента 20 символами, чтобы поместилось в баннер.
	НаименованиеКонтрагента = ?(СтрДлина(НаименованиеКонтрагента) > 20,
		СтрШаблон("%1...", Лев(НаименованиеКонтрагента, 18)),
		НаименованиеКонтрагента);
		
	Возврат НаименованиеКонтрагента;
	
КонецФункции

&НаСервере
Процедура ОформитьПригласительныйБаннер()
	
	КэшДанныхОРелевантныхКонтрагентах  = СервисСверкиРасчетов.КэшДанныхОРелевантныхКонтрагентах(); 
	КоличествоПодключенныхКонтрагентов = ?(ЗначениеЗаполнено(КэшДанныхОРелевантныхКонтрагентах),
		КэшДанныхОРелевантныхКонтрагентах.КоличествоПодключенныхКонтрагентов, 0);
	
	Если Не ЗначениеЗаполнено(КэшДанныхОРелевантныхКонтрагентах)
		ИЛИ КоличествоПодключенныхКонтрагентов < 3 Тогда
		Элементы.СводнаяИнформация.Видимость   = Истина;
		Элементы.ДетальнаяИнформация.Видимость = Ложь;
		Возврат;
	Иначе
		Элементы.СводнаяИнформация.Видимость   = Ложь;
		Элементы.ДетальнаяИнформация.Видимость = Истина;
	КонецЕсли;
	
	РелевантныеКонтрагенты   = КэшДанныхОРелевантныхКонтрагентах.РелевантныеКонтрагенты;
	КоличествоДокументовИтог = РелевантныеКонтрагенты.Итог("КоличествоДокументов");
	ОборотИтог               = РелевантныеКонтрагенты.Итог("Оборот");
	
	ПолужирныйШрифтБаннера = ШрифтыСтиля.СервисСверкиРасчетовПолужирныйШрифт;
	
	// Строка "Уже N ваших контрагентов подключено  к сервису"
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(НСтр("ru='Уже '"));
	
	ФорматнаяСтрока = "Л = ru_RU; ЧДЦ=0";
	
	ПредметКонтрагент = "контрагент,контрагента,контрагентов,м,,,,0";
	ПрописьЧислаКонтрагент = ЧислоПрописью(КоличествоПодключенныхКонтрагентов, ФорматнаяСтрока, ПредметКонтрагент);
	ПрописьЧислаЕщеКонтрагенты = ЧислоПрописью(КоличествоПодключенныхКонтрагентов - 3, ФорматнаяСтрока, ПредметКонтрагент);

	ИндексПредметаКонтрагент = СтрНайти(ПрописьЧислаКонтрагент, "контрагент");
	ИндексПредметаЕщеКонтрагенты = СтрНайти(ПрописьЧислаЕщеКонтрагенты, "контрагент");
	НадписьКонтрагент = Строка(Сред(ПрописьЧислаКонтрагент, ИндексПредметаКонтрагент, СтрДлина(ПрописьЧислаКонтрагент)- ИндексПредметаКонтрагент - 3));
	
	Если НадписьКонтрагент = "контрагент" Тогда
		ТекстКоличествоКонтрагентов = СтрШаблон(НСтр("ru='%1 ваш %2'"), Строка(КоличествоПодключенныхКонтрагентов), НадписьКонтрагент);
		ТекстПодключеноКСервису = НСтр("ru=' подключен к сервису'");
	Иначе
		ТекстКоличествоКонтрагентов = СтрШаблон(НСтр("ru='%1 ваших %2'"), Строка(КоличествоПодключенныхКонтрагентов), НадписьКонтрагент);
		ТекстПодключеноКСервису = НСтр("ru=' подключено к сервису'");
	КонецЕсли;
	
	ТекстКоличествоКонтрагентов = Новый ФорматированнаяСтрока(ТекстКоличествоКонтрагентов, ПолужирныйШрифтБаннера);
	ЧастиСообщения.Добавить(ТекстКоличествоКонтрагентов);
	ЧастиСообщения.Добавить(ТекстПодключеноКСервису);
	
	Элементы.НадписьКонтрагенты.Заголовок = Новый ФорматированнаяСтрока(ЧастиСообщения);
	
	// Строка "Можно сверить N документов за NNNN год"
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(НСтр("ru='Можно сверить '"));
	КоличествоДокументовСтрока = Новый ФорматированнаяСтрока(Строка(КоличествоДокументовИтог), ПолужирныйШрифтБаннера);
	ЧастиСообщения.Добавить(КоличествоДокументовСтрока);
	
	ПредметДокумент = "документ,документа,документов,м,,,,0";
	ПрописьЧислаДокумент = ЧислоПрописью(КоличествоДокументовИтог, ФорматнаяСтрока, ПредметДокумент);
	ИндексПредметаДокумент = СтрНайти(ПрописьЧислаДокумент, "документ");
	
	Если Год(СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов()) = Год(ТекущаяДата()) Тогда
		ПериодСверкиДокументов = Формат(Год(СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов()), "ЧДЦ=0; ЧН=0; ЧГ=;");
	Иначе
		ПериодСверкиДокументов = СтрШаблон("%1-%2",
			Формат(Год(СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов()), "ЧДЦ=0; ЧН=0; ЧГ=;"),
			Формат(Год(ТекущаяДата()), "ЧДЦ=0; ЧН=0; ЧГ=;"));
	КонецЕсли;
	
	ТекстДокументовЗаПериод = СтрШаблон(НСтр("ru=' %1 за %2 год'"),
		Строка(Сред(ПрописьЧислаДокумент, ИндексПредметаДокумент, СтрДлина(ПрописьЧислаДокумент)- ИндексПредметаДокумент - 3)), 
		ПериодСверкиДокументов);
		
	ЧастиСообщения.Добавить(ТекстДокументовЗаПериод);
	Элементы.НадписьДокументы.Заголовок = Новый ФорматированнаяСтрока(ЧастиСообщения);
	
	// Строка "На сумму N руб."
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(НСтр("ru='на сумму '"));
	СуммаДокументовСтрока = Новый ФорматированнаяСтрока(Строка(ОборотИтог), ПолужирныйШрифтБаннера);
	ЧастиСообщения.Добавить(СуммаДокументовСтрока);
	ЧастиСообщения.Добавить(НСтр("ru=' руб.'"));
	Элементы.НадписьСумма.Заголовок = Новый ФорматированнаяСтрока(ЧастиСообщения);
	
	КоличествоКонтрагентовЕще = 0;
	
	Для НомерСтроки = 0 По РелевантныеКонтрагенты.Количество() - 1 Цикл
		
		Если НомерСтроки < 3 Тогда
			ШаблонСтрокиКонтрагентаСДокументами = НСтр("ru='%1 — %2 %3 на %4 руб.'");
			
			СтрокаКонтрагент     = НаименованиеКонтрагентаДляБаннера(РелевантныеКонтрагенты[НомерСтроки].Контрагент);
			КоличествоДокументов = РелевантныеКонтрагенты[НомерСтроки].КоличествоДокументов;
			СуммаДокументов      = РелевантныеКонтрагенты[НомерСтроки].Оборот;
			
			ПрописьЧислаДокумент   = ЧислоПрописью(КоличествоДокументов, ФорматнаяСтрока, ПредметДокумент);
			ИндексПредметаДокумент = СтрНайти(ПрописьЧислаДокумент, "документ");
			СтрокаДокументов       = Строка(Сред(ПрописьЧислаДокумент, ИндексПредметаДокумент, СтрДлина(ПрописьЧислаДокумент)- ИндексПредметаДокумент - 3));
			
			Элементы["НадписьКонтрагент" + Строка(НомерСтроки + 1)].Заголовок = 
			СтрШаблон(ШаблонСтрокиКонтрагентаСДокументами, 
			СтрокаКонтрагент,
			КоличествоДокументов,
			СтрокаДокументов,
			СуммаДокументов);
			
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоКонтрагентовЕще = КоличествоПодключенныхКонтрагентов - 3;
	
	Если КоличествоКонтрагентовЕще > 0 Тогда
		ПрописьЧислаЕщеКонтрагенты = ЧислоПрописью(КоличествоКонтрагентовЕще, ФорматнаяСтрока, ПредметКонтрагент);
		ИндексПредметаЕщеКонтрагенты = СтрНайти(ПрописьЧислаЕщеКонтрагенты, "контрагент");
		Элементы.НадписьИЕще.Заголовок = СтрШаблон( НСтр("ru='и еще %1 %2'"),
			КоличествоКонтрагентовЕще,
			Сред(ПрописьЧислаЕщеКонтрагенты, ИндексПредметаЕщеКонтрагенты, СтрДлина(ПрописьЧислаЕщеКонтрагенты)- ИндексПредметаЕщеКонтрагенты - 3));
		Элементы.НадписьИЕще.Видимость = Истина;
	Иначе
		Элементы.НадписьИЕще.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьТестовоеОповещение()
	
	ЧастиСообщения = Новый Массив;
	Пользователь = Пользователи.ТекущийПользователь();
	
	ТекстСообщения = НСтр("ru='Сервис успешно включен'");
	ЧастиСообщения.Добавить(ТекстСообщения);
	ЧастиСообщения.Добавить(Символы.ПС);
	ЧастиСообщения.Добавить(Символы.ПС);
	ЧастиСообщения.Добавить(НСтр("ru='Сюда придет оповещение о первых результатах сверки.'"));
	ЧастиСообщения.Добавить(Символы.ПС);
	ЧастиСообщения.Добавить(НСтр("ru='Далее оповещения будут приходить только о новых расхождениях в соответствии с настройками'"));
	ИтоговоеСообщение = Новый ФорматированнаяСтрока(ЧастиСообщения);
	Действия = Новый СписокЗначений;
	Действия.Добавить("ПоказатьНастройки", "Настроить оповещения"); 
	СервисСверкиРасчетов.ОтправитьСообщениеСистемыВзаимодействия(Пользователь.ИдентификаторПользователяИБ, ИтоговоеСообщение, Действия, Неопределено);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользуетсяСервисСверкиРасчетов()
	
	Возврат СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов();
	
КонецФункции

&НаКлиенте
Процедура ПослеПодтвержденияОтключенияСервиса(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	ОтключитьСервис();

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДействияНастроекСервиса(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ВыбранныйЭлемент.Значение = "Оповещения" Тогда

		КлючГлобальнойНастройкиОповещений = СервисСверкиРасчетовВызовСервера.КлючГлобальнойНастройкиОповещений();
		Если КлючГлобальнойНастройкиОповещений <> Неопределено Тогда
			ОткрытьФорму("Справочник.СервисСверкиРасчетовНастройкиОповещенийПользователей.ФормаОбъекта", 
			Новый Структура("Ключ, ПерсональнаяНастройка", КлючГлобальнойНастройкиОповещений, Ложь));
		КонецЕсли;
		
	ИначеЕсли ВыбранныйЭлемент.Значение = "КакРаботает" Тогда

		СервисСверкиРасчетовКлиент.ОткрытьНавигационнуюСсылкуПодробнееОСервисе();

	ИначеЕсли ВыбранныйЭлемент.Значение = "Отключить" Тогда

		ПоказатьПодтверждениеОтключенияСервиса();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодтверждениеОтключенияСервиса()
	
	ТекстВопроса =
		НСтр("ru = 'Отключить 1С:Сверку 2.0?'") + Символы.ПС + Символы.ПС
		+ НСтр("ru = 'Сервис перестанет сверять документы с контрагентами.'") + Символы.ПС
		+ НСтр("ru = 'Результаты сверки станут недоступны.'");

	Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияОтключенияСервиса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

#КонецОбласти

