#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОбслуживающиеОрганизацииАбонента", Истина);
	
КонецПроцедуры

// Обертка для ПрограммныйИнтерфейсСервиса.ОбслуживающиеОрганизацииАбонента()
// для запуска этого метода в фоне.
Функция ОбслуживающиеОрганизацииАбонента() Экспорт
	
	Возврат ПрограммныйИнтерфейсСервиса.ОбслуживающиеОрганизацииАбонента();
	
КонецФункции

#КонецОбласти
