
&Вместо("СоздатьДокументы")
Функция Расш1_СоздатьДокументы(Выписка, РаспознаннаяВыписка, Настройки, Отбор)

	РезультатСозданияДокументов = Новый Соответствие; // Ключ - идентификатор операции, значение - см. НовыйРезультатЗаписиДокумента()

	СохранятьДанныеАвтозаполнения = СохранятьДанныеАвтозаполненияДокументов();

	Для Каждого Операция Из Выписка.Операции Цикл

		Если Отбор <> Неопределено И Отбор.Найти(Операция.Идентификатор) = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		РаспознаннаяОперация = РаспознаннаяВыписка.Операции.Найти(Операция.Идентификатор, "Идентификатор");
		Если РаспознаннаяОперация = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ХозяйственнаяОперация = РаспознаннаяОперация.ХозяйственнаяОперация;
		Если ХозяйственнаяОперация = Неопределено 
			И Не ЗначениеЗаполнено(РаспознаннаяОперация.ПлатежноеПоручение)
			И Не ЗначениеЗаполнено(РаспознаннаяОперация.Ссылка) Тогда
			// Записывать такой документ не имеет смысла
			Продолжить;
		КонецЕсли;

		Если ЗначениеЗаполнено(РаспознаннаяОперация.Ссылка) Тогда
			// 1. Может быть "распознана" пользователем. В этом случае следует записать результат его работы.
			// 2. Банковский документ может быть создан вручную, при загрузке получаем только отметку подтверждения выпиской банка.
			ОбъектДокумента = РаспознаннаяОперация.Ссылка.ПолучитьОбъект();

			Если Операция.ПоступилоСписано = "Списано"
				И ТипЗнч(ОбъектДокумента) = Тип("ДокументОбъект.СписаниеСРасчетногоСчета") Тогда
				// Если документ уже подтвержден выпиской банка, то отметку не изменяем, чтобы не устанавливалась
				// "модифицированность" документа, т.к. в ЗаписатьДокумент() если документ модифицирован,
				// он обязательно будет перезаписан, а это замедляет загрузку Выписки и сбивает Последовательность документов.
				// А также может привести к тому, что у документов будет отменено проведение, если в Настройках не установлено,
				// что документы нужно Проводить после загрузки.
				Если ОбъектДокумента.НеПодтвержденоВыпискойБанка Тогда
					ОбъектДокумента.НеПодтвержденоВыпискойБанка = Ложь;
				КонецЕсли;

				// Документ "Списание с расчетного счета" может быть создан на основании документа "Платежное поручение",
				// до выгрузки платежа в банк.
				// Дата банковского документа при этом будет такой же, как в платежном поручении.
				// При загрузке выписки необходимо привести дату банковского документа в соответствие с датой исполнения платежа.
				Если ЗначениеЗаполнено(Операция.ДатаИсполнения)
					И НачалоДня(Операция.ДатаИсполнения) <> НачалоДня(ОбъектДокумента.Дата) Тогда
					ВремяДокумента = ОбъектДокумента.Дата - НачалоДня(ОбъектДокумента.Дата);
					ОбъектДокумента.Дата = Операция.ДатаИсполнения + ВремяДокумента;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СохранятьДанныеАвтозаполнения Тогда
			ОбъектДокумента = РанееЗаполненныйОбъект(ХозяйственнаяОперация, Настройки);
		Иначе
			ОбъектДокумента = Неопределено;
		КонецЕсли;

		Если ОбъектДокумента = Неопределено Тогда
			ТипСсылки = ТипДокументаОперацииВыписки(Операция);
			Если ТипСсылки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Новый(ТипСсылки));
			Если МенеджерДокумента = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ОбъектДокумента = МенеджерДокумента.СоздатьДокумент();
			ДанныеЗаполнения = НовыйДанныеЗаполнения(
			Операция,
			РаспознаннаяОперация.ПлатежноеПоручение,
			ХозяйственнаяОперация,
			РаспознаннаяВыписка.ВладелецСчета);
			ОбъектДокумента.Заполнить(ДанныеЗаполнения);
		КонецЕсли;
		Если СохранятьДанныеАвтозаполнения Тогда
			СохранитьДанныеАвтозаполненияДокумента(ОбъектДокумента, ХозяйственнаяОперация);
		КонецЕсли;

		ЕстьРазметкаАУСН = ЗначениеЗаполнено(Операция.РазметкаАУСН);
		Если ЕстьРазметкаАУСН Тогда
			ОбъектДокумента.РазметкаАУСНБанка.Загрузить(Операция.РазметкаАУСН);
		КонецЕсли;
		Если ЗначениеЗаполнено(Операция.ТипДокументаАУСН) Тогда
			Если Операция.ТипДокументаАУСН = Перечисления.ТипыДокументовАУСН.БанковскаяВыпискаСРучнойРазметкой
				И ЕстьРазметкаАУСН Тогда
				ОбъектДокумента.ИсточникРазметкиАУСН = Перечисления.ИсточникиРазметкиАУСН.Банк;
			ИначеЕсли Не ЗначениеЗаполнено(ОбъектДокумента.ИсточникРазметкиАУСН) Тогда
				ОбъектДокумента.ИсточникРазметкиАУСН = Перечисления.ИсточникиРазметкиАУСН.ИсточникПоУмолчанию();
			КонецЕсли;
		КонецЕсли;

		Если ВидОперацииТребуетЗаполненияКурса(ОбъектДокумента.ВидОперации) И
			Не ЗначениеЗаполнено(ОбъектДокумента.КурсНаДатуПриобретенияРеализацииВалюты) Тогда
			Если ОбъектДокумента.ВалютаДокумента
				= ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета() Тогда
				ВалютаВзаиморасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				ОбъектДокумента.РасшифровкаПлатежа[0].ДоговорКонтрагента, "ВалютаВзаиморасчетов");
			Иначе
				ВалютаВзаиморасчетов = ОбъектДокумента.ВалютаДокумента;
			КонецЕсли;
			ИнформацияОКурсе = РаботаСКурсамиВалют.ПолучитьКурсВалюты(
			ВалютаВзаиморасчетов, ОбъектДокумента.ДатаВходящегоДокумента);
			ОбъектДокумента.КурсНаДатуПриобретенияРеализацииВалюты = ИнформацияОКурсе.Курс;
			Для Каждого СтрокаРасшифровки Из ОбъектДокумента.РасшифровкаПлатежа Цикл
				СтрокаРасшифровки.КурсНаДатуПриобретенияРеализацииВалюты = ОбъектДокумента.КурсНаДатуПриобретенияРеализацииВалюты;
			КонецЦикла;
		КонецЕсли;
		//+++
		Если НЕ ЗначениеЗаполнено(ОбъектДокумента.ПодразделениеОрганизации) тогда
			ОбъектДокумента.ПодразделениеОрганизации = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");		
			Если ТипЗнч(ОбъектДокумента.ссылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") тогда
				ОбъектДокумента.ПодразделениеКт = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");			
			Иначе 
				ОбъектДокумента.ПодразделениеДт = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");			
			КонецЕсли;
		КонецЕсли;	
		//---
		Проводить = ЗначениеНастройкиСозданияДокументов(Настройки, "ПроводитьДокумент", ТипЗнч(ОбъектДокумента.Ссылка));
		РезультатСозданияДокумента = ЗаписатьДокумент(ОбъектДокумента, Проводить);

		Если ЗначениеЗаполнено(РезультатСозданияДокумента.Ссылка) Тогда
			РаспознаннаяОперация.Ссылка = РезультатСозданияДокумента.Ссылка;
		КонецЕсли;

		РезультатСозданияДокументов.Вставить(Операция.Идентификатор, РезультатСозданияДокумента);

	КонецЦикла;

	Возврат РезультатСозданияДокументов;

КонецФункции
