 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		
		Если Параметры.ЗначенияЗаполнения.Свойство("Организация") Тогда
			Организация = Параметры.ЗначенияЗаполнения.Организация;
		Иначе
			Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		КонецЕсли;
		
		Если Параметры.ЗначенияЗаполнения.Свойство("СервисОбменаСБанками") Тогда
			СервисОбменаСБанками = Параметры.ЗначенияЗаполнения.СервисОбменаСБанками; 
		КонецЕсли;	 
		
	КонецЕсли;
	
	Если СервисОбменаСБанками = Перечисления.СервисыОбменаСБанками.ЗаявкиНаКредитПоВыписке
		Или Не ЗначениеЗаполнено(СервисОбменаСБанками) Тогда
		КредитПоВыписке = 1;
	Иначе
		КредитПоПакету = 1;
	КонецЕсли;
	
	Элементы.ГруппаОрганизацияГоризонтальная.Видимость = Справочники.Организации.ИспользуетсяНесколькоОрганизаций();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ВидКредитаПриИзменении(Элемент) 
	
	Если Элемент.Имя = "КредитПоПакету" Тогда
		КредитПоВыписке = 0;
	Иначе
		КредитПоПакету = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДалееВыборБанков(Команда)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Организация", , );
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	ПараметрыСоздания = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);

	Если ЗначениеЗаполнено(КредитПоВыписке) Тогда
		
		КлючеваяОперация = "СозданиеФормыЗаявкаНаКредитПоВыписке"; 
		НаименованиеФормы = "Документ.ЗаявкаНаКредитПоВыписке.ФормаОбъекта";
		ОтправленнаяЗаявкаНаКредитПоВыписке = ЗаявкаВСтатусеОтправлено(Организация);
		
		Если ЗначениеЗаполнено(ОтправленнаяЗаявкаНаКредитПоВыписке) Тогда
			ОткрытьФорму("Документ.ЗаявкаНаКредитПоВыписке.Форма.ФормаОтправленнойЗаявки", 
				Новый Структура("Ключ", ОтправленнаяЗаявкаНаКредитПоВыписке));
		Иначе 
			ПараметрыСоздания.Вставить("ИмяФормы", Параметры.ИмяФормы);	
			ОткрытьФорму("Документ.ЗаявкаНаКредитПоВыписке.ФормаОбъекта", ПараметрыСоздания, Этотобъект.ВладелецФормы);
		КонецЕсли;
	Иначе
		КлючеваяОперация = "СозданиеФормыЗаявкаНаКредит";
		ОткрытьФорму("Документ.ЗаявкаНаКредит.ФормаОбъекта", ПараметрыСоздания, Этотобъект.ВладелецФормы);
	КонецЕсли;
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);
		
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаявкаВСтатусеОтправлено(Организация)
	 Возврат Документы.ЗаявкаНаКредитПоВыписке.ЗаявкаВСтатусеОтправлено(Организация);
КонецФункции

#КонецОбласти

