#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 20, 0);
	
КонецФункции

#Область Свойства

// Получает описание предопределенных наборов свойств.
//
// Параметры:
//  Наборы - ДеревоЗначений - с колонками:
//     * Имя           - Строка - Имя набора свойств. Формируется из полного имени объекта
//                       метаданных заменой символа "." на "_".
//                       Например, "Документ_ЗаказПокупателя".
//     * Идентификатор - УникальныйИдентификатор - Идентификатор ссылки предопределенного элемента.
//     * Используется  - Неопределено, Булево - Признак того, что набор свойств используется.
//                       Например, можно использовать для скрытия набора по функциональным опциям.
//                       Значение по умолчанию - Неопределено, соответствует значению Истина.
//     * ЭтоГруппа     - Булево - Истина, если набор свойств является группой.
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_РегистрацияСуммыУбыткаУСН";
	Набор.Идентификатор = Новый УникальныйИдентификатор("15f3052b-8edd-4190-913c-f9af0d15d53c");
	Набор.Используется  = Истина;
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

Процедура ОбработатьИзменениеГодаНаСервере(Объект) Экспорт
	
	Если Объект.Убытки.Количество() <> 10 Тогда
		Объект.Убытки.Очистить();
		Для СтрокаГод = 1 По 10 Цикл
			Строка = Объект.Убытки.Вставить(0);
			
			ГодСтроки 		= ДобавитьМесяц(Объект.Дата, - 12 * СтрокаГод);
			НачалоПериода 	= ВыборПериодаКлиентСервер.НачалоПериодаОтчета(Перечисления.ДоступныеПериодыОтчета.Год, ГодСтроки);
			КонецПериода  	= ВыборПериодаКлиентСервер.КонецПериодаОтчета(Перечисления.ДоступныеПериодыОтчета.Год, ГодСтроки);
	        Строка.Год 		= ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(Перечисления.ДоступныеПериодыОтчета.Год, НачалоПериода, КонецПериода);
			
		КонецЦикла;
	ИначеЕсли НачалоГода(Объект.Дата) <= Дата(Число(Объект.Убытки[9].Год),01,01) Тогда
		//год документа сдвинут назад
		Пока НачалоГода(Объект.Дата) <= Дата(Число(Объект.Убытки[9].Год),01,01) Цикл
			Объект.Убытки.Удалить(9);
			Строка = Объект.Убытки.Вставить(0);
			
			ГодСтроки 		= ДобавитьМесяц(Дата(Число(Объект.Убытки[1].Год),01,01), -12);
			НачалоПериода 	= ВыборПериодаКлиентСервер.НачалоПериодаОтчета(Перечисления.ДоступныеПериодыОтчета.Год, ГодСтроки);
			КонецПериода  	= ВыборПериодаКлиентСервер.КонецПериодаОтчета(Перечисления.ДоступныеПериодыОтчета.Год, ГодСтроки);
	        Строка.Год 		= ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(Перечисления.ДоступныеПериодыОтчета.Год, НачалоПериода, КонецПериода);
			
		КонецЦикла;
	ИначеЕсли ДобавитьМесяц(НачалоГода(Объект.Дата), - 12 * 10) > Дата(Число(Объект.Убытки[0].Год),01,01) Тогда
		//год документа сдвинут вперед
		Пока ДобавитьМесяц(НачалоГода(Объект.Дата), - 12 * 10) > Дата(Число(Объект.Убытки[0].Год),01,01) Цикл
			Объект.Убытки.Удалить(0);
			Строка = Объект.Убытки.Добавить();
			
			ГодСтроки 		= ДобавитьМесяц(Дата(Число(Объект.Убытки[8].Год),01,01), 12);
			НачалоПериода 	= ВыборПериодаКлиентСервер.НачалоПериодаОтчета(Перечисления.ДоступныеПериодыОтчета.Год, ГодСтроки);
			КонецПериода  	= ВыборПериодаКлиентСервер.КонецПериодаОтчета(Перечисления.ДоступныеПериодыОтчета.Год, ГодСтроки);
	        Строка.Год 		= ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(Перечисления.ДоступныеПериодыОтчета.Год, НачалоПериода, КонецПериода);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#КонецЕсли
