
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстПояснения = НСтр("ru = 'Отправка данных для банка'");
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("Подключаемый_ОтправитьЗаявку", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьОтправку(Команда)
	
	ОтменитьОтправкуНаСервере(СведенияОДлительнойОперации);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОтменитьОтправкуНаСервере(СведенияОДлительнойОперации)
	
	Если ЗначениеЗаполнено(СведенияОДлительнойОперации)
	   И ЗначениеЗаполнено(СведенияОДлительнойОперации.ДлительнаяОперация.ИдентификаторЗадания) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(СведенияОДлительнойОперации.ДлительнаяОперация.ИдентификаторЗадания);
	КонецЕсли;
		
КонецПроцедуры

#Область ДвижениеИндикатора

&НаКлиенте
Процедура СообщитьПрогрессВыполнения(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Свойство("Прогресс")
	 Или ТипЗнч(Результат.Прогресс) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Прогресс = Результат.Прогресс;
	Если Не Прогресс.Свойство("Процент") Или Не Прогресс.Свойство("Текст") Тогда
		ТекстПояснения = НСтр("ru = 'Ошибка работы фонового задания'");
		Возврат;
	КонецЕсли;

	ТекстПояснения = Прогресс.Текст;
	
	ПроцентВыполнения = Прогресс.Процент;
	
	ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияОтправки(Знач Результат, ДополнительныеПараметры) Экспорт

	СведенияОВыполнении = НовыеСведенияОВыполнении();
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда // остается только закрыть форму
		ОбработатьНеудачнуюОтправку(СведенияОВыполнении);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус <> "Выполнено"
		 Или Не ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда

		СведенияОВыполнении.ОписаниеОшибки = ?(Результат.Статус = "Ошибка", Результат.ПодробноеПредставлениеОшибки, "");
		ОбработатьНеудачнуюОтправку(СведенияОВыполнении);
		Возврат;
			
	КонецЕсли;
		
	Результат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	
	// Приводим состав полей в результате к одинаковому составу.
	ЗаполнитьЗначенияСвойств(СведенияОВыполнении, Результат);
	
	Если СведенияОВыполнении.Выполнено = Истина Тогда
		ОбработатьУспешнуюОтправку(Результат, ДополнительныеПараметры);
	Иначе
		ОбработатьНеудачнуюОтправку(СведенияОВыполнении);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ОтправитьЗаявку()
	
	СведенияОДлительнойОперации = Новый Структура();
	СведенияОДлительнойОперации.Вставить("Имя", "");
	СведенияОДлительнойОперации.Вставить("ДлительнаяОперация");
	НачатьОтправку();
	ОжидатьЗавершениеДлительнойОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершениеДлительнойОперации()
	
	Если СведенияОДлительнойОперации.ДлительнаяОперация = Неопределено Тогда
		// Фоновое задание не запущено.
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеВыполненияОтправки", ЭтотОбъект, ДополнительныеПараметры);

	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("СообщитьПрогрессВыполнения", ЭтотОбъект);

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания       = Ложь; // Используем собственное окно
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессеВыполнения;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СведенияОДлительнойОперации.ДлительнаяОперация, 
		ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Процедура НачатьОтправку()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение           = 0; // Не ждем завершения.
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отправка заявки на кредит по выписке'");
	ПараметрыВыполнения.КлючФоновогоЗадания = ПараметрыВыполнения.КлючФоновогоЗадания;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Организация", Параметры.Организация);
	ПараметрыПроцедуры.Вставить("СчетОрганизации", Параметры.СчетОрганизации);
	ПараметрыПроцедуры.Вставить("Банк", Параметры.Банк);
	ПараметрыПроцедуры.Вставить("ИННБанка", Параметры.ИННБанка);
	ПараметрыПроцедуры.Вставить("СуммаЗаявки", Параметры.СуммаЗаявки);
	ПараметрыПроцедуры.Вставить("Лимит", Параметры.Лимит);
	ПараметрыПроцедуры.Вставить("ЗаявкаНаКредитПоВыписке", Параметры.ЗаявкаНаКредитПоВыписке);
	ПараметрыПроцедуры.Вставить("ФормаИсточник", Параметры.ФормаИсточник);
	
	СведенияОДлительнойОперации.Имя = "ОтправитьЗаявку";	
	СведенияОДлительнойОперации.ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Документы.ЗаявкаНаКредитПоВыписке.ОтправитьЗаявку", ПараметрыПроцедуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНеудачнуюОтправку(СведенияОВыполнении)
	
	Если ПустаяСтрока(СведенияОВыполнении.ОписаниеОшибки) Тогда
		// Произошла ошибка. Закрываем форму с индикатором.
		// Сообщение пользователю могло быть выдано ранее в месте возникновения ошибки,
		// здесь ничего не сообщает.
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
		
	Иначе
		// Произошла ошибка. Сообщаем о ней пользователю, затем закрываем форму с индикатором.
		
		ДополнительныеПараметры = Новый Структура();
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытьПослеСообщения", ЭтотОбъект, ДополнительныеПараметры);
		Заголовок = НСтр("ru = 'Отправка заявки'");

		ПоказатьОшибку(СведенияОВыполнении.ОписаниеОшибки, ЭтотОбъект, Заголовок, ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму ошибки, содержащую секцию "Подробнее".
//
// Параметры:
//  ОписаниеОшибки - Строка - текст, выводимый в предупреждении.
//  ФормаСОшибками - ФормаКлиентскогоПриложения - владелец для формы с текстом ошибки.
//  Заголовок    - Строка - заголовок предупреждения.
//  ДействиеПослеПредупреждения - ОписаниеОповещения - оповещение о закрытии формы.
//
&НаКлиенте
Процедура ПоказатьОшибку(ОписаниеОшибки, ФормаСОшибками, Заголовок = "", ДействиеПослеПредупреждения = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	
	Если Не ПустаяСтрока(Заголовок) Тогда
		
		ПараметрыФормы.Вставить("Заголовок", Заголовок);
		
	КонецЕсли;
		
	ОткрытьФорму("Документ.ЗаявкаНаКредитПоВыписке.Форма.СообщениеОбОшибкахЗаявкаНаКредитПоВыписке",
		ПараметрыФормы, ФормаСОшибками, , , , ДействиеПослеПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПослеСообщения(Результат, ДополнительныеПараметры) Экспорт

	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("Выполнено", Ложь);
	
	Закрыть(РезультатВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьУспешнуюОтправку(Результат, ДополнительныеПараметры)
		
	СведенияОДлительнойОперации.ДлительнаяОперация = Неопределено; // Сбросим признак выполнения.

	Закрыть(Результат);

		
КонецПроцедуры

&НаКлиенте
Функция НовыеСведенияОВыполнении()

	Результат = Новый Структура();
	
	Результат.Вставить("Выполнено", Ложь);
	Результат.Вставить("ОписаниеОшибки", "");
		
	Возврат Результат;

КонецФункции

#КонецОбласти
