
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение Тогда
		
		// Обеспечим начальные данные: статья затрат, вид номенклатуры, единица измерения
		КлассификаторыДоходовРасходов.ОбеспечитьФункциональность(Справочники.СтатьиЗатрат, "ВедетсяУчетПоПутевымЛистам");
		Справочники.ВидыНоменклатуры.НайтиСоздатьЭлементТопливо(); // Вид номенклатуры - Топливо
		Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду("112"); // Литры
		
	КонецЕсли;
	
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = Значение;
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ПутевойЛист", ПараметрыНабора);
	
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = Значение;
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_ТранспортныеСредства", ПараметрыНабора);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли