#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализируем реквизиты формы, которые будут передаваться
	// в качестве параметров команд, расположенных в данной панели
	Организация = Параметры.Организация;
	Период = Параметры.Период;
	
	ПараметрыОпции = Новый Структура;
	ПараметрыОпции.Вставить("Организация", Организация);
	ПараметрыОпции.Вставить("Период", Период);
	
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыОпции);
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ИмяОбъектаКонсолидацияОтчетности());
	Если ОбъектМетаданных <> Неопределено Тогда
		Элементы.КонсолидацияОтчетностиПоНДС.Видимость = ПравоДоступа("Использование", ОбъектМетаданных);
	Иначе
		// В ПРОФ консолиция отчетности по НДС недоступна
		Элементы.КонсолидацияОтчетностиПоНДС.Видимость = Ложь;
	КонецЕсли;
	
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КонсолидацияОтчетностиПоНДС(Команда)
	
	ПараметрыФормы = ПростойИнтерфейсКлиент.ПараметрыОткрытияЗависимыхФорм(ЭтотОбъект);
	ОткрытьФорму(СтрШаблон("%1.Форма", ИмяОбъектаКонсолидацияОтчетности()),
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяОбъектаКонсолидацияОтчетности()
	
	Возврат "Обработка.КонсолидацияОтчетностиПоНДС";
	
КонецФункции

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.ГруппаЛеваяКолонка,
		"ОтчетКнигаПокупокОткрыть,ОтчетКнигаПродажОткрыть");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
#КонецОбласти