#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Подключенные подсистемы:
// - СтандартныеПодсистемы.ВерсионированиеОбъектов
#Область СлужебныйПрограммныйИнтерфейс

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// СтандартныеПодсистемы.Свойства

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ВключитьИспользованиеДополнительныхРеквизитовИСведений");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ВключитьИспользованиеДополнительныхРеквизитовИСведений() Экспорт
	
	НаборДополнительныхРеквизитовИСведенийСсылка = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_НаправленияДеятельности");
	Если ЗначениеЗаполнено(НаборДополнительныхРеквизитовИСведенийСсылка) Тогда
		НаборДополнительныхРеквизитовИСведенийОбъект = НаборДополнительныхРеквизитовИСведенийСсылка.ПолучитьОбъект();
		НаборДополнительныхРеквизитовИСведенийОбъект.Используется = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НаборДополнительныхРеквизитовИСведенийОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
