#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗавершениеЗагрузкиЧековНПДНаСервере(Форма, Результат) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	Чеки = ПолучитьИзВременногоХранилища(Результат.АдресЧеков);
	Если ТипЗнч(Чеки) = Тип("ТаблицаЗначений") Тогда
		Объект.ЧекиНПД.Загрузить(Чеки);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ЧекиНПД) Тогда
		Форма.ПолученЧекНПД = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.ЧекиНПД) И Результат.ЧекиУдалялись Тогда
		Форма.ПолученЧекНПД = Ложь;
	КонецЕсли;
	Форма.Записать();
	
	УдаляемыеФайлы = Результат.УдаляемыеФайлы;
	Для Каждого Файл Из УдаляемыеФайлы Цикл
		ФайлОбъект = Файл.ПолучитьОбъект();
		ФайлОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти