


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура abc_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьСписокПоступлений();
	ЗаполнитьКолонкуКлассификаторыТНВЭД();	
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРазделы

&НаКлиенте
Процедура РазделыКодТНВЭДПриИзменении(Элемент)
	
	НомерРаздела = Элементы.Разделы.ТекущиеДанные.НомерСтроки;
	ЗаполнитьПоПоступлению(ЭтотОбъект[СтруктураИменРеквизитов("ИмяРеквизита.Имя")], НомерРаздела);	
	
КонецПроцедуры

//abc++ 68783 Перенес из примера с адаптацией
//
&НаКлиенте
Процедура abc_РазделыПриИзмененииВместо(Элемент)
	
	Если Объект.Разделы.Количество() = 0 Тогда
		Объект.Разделы.Добавить();
		//ДК
		НомерРаздела = Объект.Разделы[0].НомерСтроки; 
		ИмяРеквизита = СтруктураИменРеквизитов("ИмяРеквизита.Имя");
		ЗаполнитьПоПоступлению(ЭтотОбъект[ИмяРеквизита], НомерРаздела);
		//ДК
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
&После("ДобавитьИзПоступленияЗавершение")
Процедура abc_ДобавитьИзПоступленияЗавершение(РезультатЗакрытия, ДополнительныеПараметры)
	
	ЗаполнитьСписокПоступлений();
	
	ИмяРеквизита = abc_ГТДИмпортКлиентСервер.СтруктураИменРеквизитов("ИмяРеквизита.Имя");	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, ИмяРеквизита) Тогда
		
		ИмяКолонки = abc_ГТДИмпортКлиентСервер.СтруктураИменРеквизитов("ИмяКолонки.Имя");
		ЭлементРеквизита = Элементы.Найти(ИмяКолонки);
		
		Если ЭлементРеквизита <> Неопределено Тогда 
			
			СписокКодовТНВЭД = ПолучитьСписокВыбора(); 
			ЭлементРеквизита.СписокВыбора.ЗагрузитьЗначения(СписокКодовТНВЭД);
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СтруктураИменРеквизитов(ПутьКЗначению = "")
	
	Возврат abc_ГТДИмпортКлиентСервер.СтруктураИменРеквизитов(ПутьКЗначению);
	
КонецФУнкции      

&НаСервереБезКонтекста
Процедура ДобавитьЗаполнитьКолонкуКодТНВЭД(Таблица, ИмяКолонки)
	
	Таблица.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("СправочникСсылка.КлассификаторТНВЭД"));
	
	Для Каждого Строка ИЗ Таблица Цикл
		Строка[ИмяКолонки] = Строка.Номенклатура.КодТНВЭД;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДополнительныеЭлементыФормы()
	
	//СтруктураИменРеквизитов = СтруктураИменРеквизитов();
	//
	//МассивРеквизитов = Новый Массив;
	////МассивРеквизитов.Добавить(Новый РеквизитФормы(СтруктураИменРеквизитов.ИмяСписка.Имя, Новый ОписаниеТипов("СписокЗначений"),,СтруктураИменРеквизитов.ИмяСписка.Заголовок));
	//МассивРеквизитов.Добавить(Новый РеквизитФормы(СтруктураИменРеквизитов.ИмяРеквизита.Имя, Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг"),,СтруктураИменРеквизитов.ИмяРеквизита.Заголовок));
	//МассивРеквизитов.Добавить(Новый РеквизитФормы(СтруктураИменРеквизитов.ИмяКолонки.Имя, Новый ОписаниеТипов("СправочникСсылка.КлассификаторТНВЭД"), "Объект.Разделы", СтруктураИменРеквизитов.ИмяКолонки.Заголовок));
	//	
	//ИзменитьРеквизиты(МассивРеквизитов);
	////ЭтотОбъект[СтруктураИменРеквизитов.ИмяРеквизита.Имя].ТипЗначения = Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг");
	//
	//ЗаполнитьСписокПоступлений(СтруктураИменРеквизитов.ИмяРеквизита.Имя);
	//
	//// Не знаю нужно ли это, но перенес как в том примере который нужен клиенту
	//ЗаполнитьНомерГТД(СтруктураИменРеквизитов.ИмяРеквизита.Имя);
	//
	////ЭлементГруппаНДС = Элементы.Найти("ГруппаНДС"); 
	//ЭлементРазделыПошлинаВВалюте = Элементы.Найти("РазделыПошлинаВВалюте");
	//ЭлементРазделы = Элементы.Найти("Разделы"); 
	//ЭлементГруппаГлавное = Элементы.Найти("ГруппаГлавное");
	//Если ЭлементГруппаГлавное = Неопределено ИЛИ ЭлементРазделыПошлинаВВалюте = Неопределено ИЛИ ЭлементРазделы = Неопределено Тогда 
	//	Возврат;	
	//КонецЕсли;

	//НовыйЭлемент = Элементы.Добавить(СтруктураИменРеквизитов.ИмяРеквизита, Тип("ПолеФормы"), ЭлементГруппаГлавное);
	//НовыйЭлемент.Вид   = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = СтруктураИменРеквизитов.ИмяРеквизита.Имя;
	////НовыйЭлемент.КнопкаВыбора = Истина;
	//
	//НовыйЭлемент = Элементы.Вставить(СтруктураИменРеквизитов.ИмяКолонки.Имя, Тип("ПолеФормы"), ЭлементРазделы, ЭлементРазделыПошлинаВВалюте);
	//НовыйЭлемент.Вид   = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать; 
	//НовыйЭлемент.РежимВыбораИзСписка = Истина;
	//НовыйЭлемент.ПутьКДанным = "Объект.Разделы." + СтруктураИменРеквизитов.ИмяКолонки.Имя;
	//НовыйЭлемент.УстановитьДействие("ПриИзменении", "РазделыКодТНВЭДПриИзменении");
	//
	//СписокКодовТНВЭД = ПолучитьСписокВыбора(СтруктураИменРеквизитов);
	//НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(СписокКодовТНВЭД);
	//	
	//ЗаполнитьКолонкуКлассификаторыТНВЭД();
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьСписокВыбора(СтруктураИменРеквизитов = Неопределено)
	
	Если СтруктураИменРеквизитов = Неопределено Тогда
		СтруктураИменРеквизитов = СтруктураИменРеквизитов();
	КонецЕсли;
	
	//МассивСсылок = ЭтотОбъект[СтруктураИменРеквизитов.ИмяРеквизита.Имя].ВыгрузитьЗначения();
	Ссылка = ЭтотОбъект[СтруктураИменРеквизитов.ИмяРеквизита.Имя];   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугТовары.Номенклатура.КодТНВЭД КАК НоменклатураКодТНВЭД
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	//|	ПоступлениеТоваровУслугТовары.Ссылка В (&Ссылка)
	|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураКодТНВЭД
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	//Запрос.УстановитьПараметр("Ссылка", МассивСсылок);	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НоменклатураКодТНВЭД");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокПоступлений(ИмяРеквизита = "")
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда
		СтруктураИменРеквизитов = СтруктураИменРеквизитов();
		ИмяРеквизита = СтруктураИменРеквизитов.ИмяРеквизита.Имя;
	КонецЕсли; 
	
	ИмяКолонки = "ДокументПартии";
	ТаблицаПартий = Объект.Товары.Выгрузить(, ИмяКолонки);
	ТаблицаПартий.Свернуть(ИмяКолонки);
	
	МассивПартий = ТаблицаПартий.ВыгрузитьКолонку(ИмяКолонки);
	
	Если МассивПартий.Количество() = 1 Тогда
		ВыбраннаяПартия = МассивПартий[0];
		ЭтотОбъект[ИмяРеквизита] = ВыбраннаяПартия;
	Иначе
		ЭтотОбъект[ИмяРеквизита] = Неопределено;
	КонецЕсли;		
	
	//ЭтотОбъект[ИмяРеквизита].ЗагрузитьЗначения(МассивПартий);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкуКлассификаторыТНВЭД()
		
	ИмяКолонки = СтруктураИменРеквизитов("ИмяКолонки.Имя");
	
	Для Каждого Раздел ИЗ Объект.Разделы Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("НомерРаздела", Раздел.НомерСтроки);
		НайденыеСтроки = Объект.Товары.НайтиСтроки(Отбор);
		ТаблицаПоРазделу = Объект.Товары.Выгрузить(НайденыеСтроки, "Номенклатура");   
			
		ДобавитьЗаполнитьКолонкуКодТНВЭД(ТаблицаПоРазделу, ИмяКолонки);
		ТаблицаПоРазделу.Свернуть(ИмяКолонки);
		Если ТаблицаПоРазделу.Количество() = 1 Тогда
			Строка = ТаблицаПоРазделу[0];
			Раздел[ИмяКолонки] = Строка[ИмяКолонки]; 
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНомерГТД(ИмяРеквизита)
	
	Если НЕ ЗначениеЗаполнено(Объект.НомерГТД) Тогда
		Объект.НомерГТД = Справочники.НомераГТД.НайтиПоКоду(ЭтотОбъект[ИмяРеквизита].НомерВходящегоДокумента);  
		Модифицированность = Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
&Вместо("ЗаполнитьПоПоступлению")
Процедура abc_ЗаполнитьПоПоступлению(ДокументПоступления, НомерРаздела)

	ДанныеОбъекта = Новый Структура("Дата, Организация, Склад, ВалютаДокумента, КурсДокумента, КратностьДокумента");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);

	ТоварыПоДаннымПоступления = Документы.ГТДИмпорт.ТоварыПоДаннымПоступления(ДанныеОбъекта, ДокументПоступления, НомерРаздела);
	//abc++ 68783 Перенес из примера с адаптацией 
	//Для каждого ДанныеНовойСтроки Из ТоварыПоДаннымПоступления Цикл
	//	НоваяСтрока = Объект.Товары.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеНовойСтроки);
	//КонецЦикла;
	
	СтруктураИменРеквизитов = СтруктураИменРеквизитов();
	
	ДанныеРаздела = Объект.Разделы.Получить(НомерРаздела - 1);
	СтруктураОтбора = Новый Структура("НомерРаздела", НомерРаздела);
	СтруктураНоменклатура = Новый Структура("Номенклатура,ФактурнаяСтоимость");
	ОчищаемыеТовары = Объект.Товары.НайтиСтроки(СтруктураОтбора);
	Для каждого Стр Из ОчищаемыеТовары Цикл
		Объект.Товары.Удалить(Стр);	
	КонецЦикла;
	//КодТНВЭД = ДанныеРаздела.дкКодТНВЭД;
	КодТНВЭД = ДанныеРаздела[СтруктураИменРеквизитов.ИмяКолонки.Имя];
	Для каждого ДанныеНовойСтроки Из ТоварыПоДаннымПоступления Цикл
		Если НЕ ДанныеНовойСтроки.Номенклатура.КодТНВЭД = КодТНВЭД И ЗначениеЗаполнено(КодТНВЭД) Тогда
			Продолжить;					
		КонецЕсли;
		СтруктураНоменклатура.Номенклатура = ДанныеНовойСтроки.Номенклатура;
		СтруктураНоменклатура.ФактурнаяСтоимость = ДанныеНовойСтроки.ФактурнаяСтоимость;
		ДобавленныеТовары = Объект.Товары.НайтиСтроки(СтруктураНоменклатура);
		ПропуститьСтроку = ложь;
		Для каждого Стр Из ДобавленныеТовары Цикл
			Если Стр.НомерРаздела <> ДанныеНовойСтроки.НомерРаздела Тогда
				ПропуститьСтроку = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		//ДК 
		Если ПропуститьСтроку Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеНовойСтроки);

			
	КонецЦикла;
	//abc--
	
	ПересчитатьИтогиРаздела(НомерРаздела);
	ЗаполнитьДобавленныеКолонкиТаблиц();

КонецПроцедуры

//abc++ 68383 Перенес из примера с адаптацей
//
&НаСервере
&Вместо("ПересчитатьИтогиРаздела")
Процедура abc_ПересчитатьИтогиРаздела(НомерРаздела, ИмяКолонки)

	Если НомерРаздела = 0 Тогда
		Возврат;
	КонецЕсли;

	ДанныеРаздела = Объект.Разделы.Получить(НомерРаздела - 1);
    //ДК
	СтараяТаможеннаяСтоимость = ДанныеРаздела.ТаможеннаяСтоимость;

	//ДК 
	//Итоги = Новый Структура("СуммаПошлины,СуммаНДС", 0, 0);
	Итоги = Новый Структура("СуммаПошлины,СуммаНДС,ТаможеннаяСтоимость", 0, 0, 0);

	ТоварыРаздела = Объект.Товары.НайтиСтроки(Новый Структура("НомерРаздела", НомерРаздела));
	Для Каждого СтрокаТаблицы Из ТоварыРаздела Цикл

		Итоги.СуммаПошлины = Итоги.СуммаПошлины + СтрокаТаблицы.СуммаПошлины;
		Итоги.СуммаНДС     = Итоги.СуммаНДС     + СтрокаТаблицы.СуммаНДС;
        //ДК
		Итоги.ТаможеннаяСтоимость = Итоги.ТаможеннаяСтоимость + СтрокаТаблицы.ФактурнаяСтоимость;
	КонецЦикла;

	Если ИмяКолонки = "" Тогда
		ЗаполнитьЗначенияСвойств(ДанныеРаздела, Итоги);
	Иначе
		ДанныеРаздела[ИмяКолонки] = Итоги[ИмяКолонки];
	КонецЕсли; 
	
	//ДК
	Если СтараяТаможеннаяСтоимость <> ДанныеРаздела.ТаможеннаяСтоимость Тогда
		ПриИзмененииСтоимостиСтавкиПошлины(НомерРаздела);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроцедуруИзВнеФормы(ИмяПроцедуры, МассивПараметров = Неопределено) Экспорт
	
	СтрокаПараметров = abc_ГТДИмпортКлиентСервер.СтрокаПараметров(МассивПараметров);
	Выполнить(ИмяПроцедуры +"(" + СтрокаПараметров + ")"); 
	
КонецПроцедуры 

&НаСервере
Функция ВыполнитьФункциюИзВнеФормы(ИмяПроцедуры, МассивПараметров = Неопределено) Экспорт
	
	СтрокаПараметров = abc_ГТДИмпортКлиентСервер.СтрокаПараметров(МассивПараметров);
	Возврат Вычислить(ИмяПроцедуры +"(" + СтрокаПараметров + ")");
	
КонецФункции



#КонецОбласти