#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если НаДату > '20110101' Тогда
		Возврат Перечисления.ВерсииФорматовВыгрузки.ВерсияФСГС;
	КонецЕсли;
	
КонецФункции

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",      ОписаниеТиповСтрока, "Редакция формы", 20);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2020Кв1";
	НоваяФорма.ОписаниеОтчета     = "Форма по приказу Росстата от 29.12.2012 № 676";
	НоваяФорма.РедакцияФормы	  = "29.12.2012 № 676";
	НоваяФорма.ДатаНачалоДействия = '20190101';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

Функция ДанныеРеглОтчета(ЭкземплярРеглОтчета) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ДеревоФормИФорматов() Экспорт
	
	ФормыИФорматы = Новый ДеревоЗначений;
	ФормыИФорматы.Колонки.Добавить("Код");
	ФормыИФорматы.Колонки.Добавить("ДатаПриказа");
	ФормыИФорматы.Колонки.Добавить("НомерПриказа");
	ФормыИФорматы.Колонки.Добавить("ДатаНачалаДействия");
	ФормыИФорматы.Колонки.Добавить("ДатаОкончанияДействия");
	ФормыИФорматы.Колонки.Добавить("ИмяОбъекта");
	ФормыИФорматы.Колонки.Добавить("Описание");
	
	Форма20120101 = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "609015", '20121229', "676", "ФормаОтчета2020Кв1");
	РегламентированнаяОтчетность.ОпределитьФорматВДеревеФормИФорматов(Форма20120101, "1.0");
	
	Возврат ФормыИФорматы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

#Область ПечатьУстаревших

Функция СформироватьСписокЛистов(Ссылка) Экспорт 
	РеквизитыКлюча = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ВыбраннаяФорма,ИсточникОтчета,Ссылка,ДанныеОтчета");
	Если РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2017Кв1" Тогда 
		Возврат СформироватьСписокЛистов_ФормаОтчета2017Кв1(РеквизитыКлюча);
	КонецЕсли;
КонецФункции

Функция СформироватьСписокЛистов_ФормаОтчета2017Кв1(РеквизитыКлюча)
	КонтекстПечати = РегламентированнаяОтчетность.КонтекстПечати(РеквизитыКлюча);
	ПечатнаяФормаМакет = РегламентированнаяОтчетность.ПустойМакетИзСписка(
		КонтекстПечати.ИмяФормы, КонтекстПечати.СписокИспользуемыхМакетов, РеквизитыКлюча.ВыбраннаяФорма + "_ФормаОтчета");
		
	ДанныеОтчета = РеквизитыКлюча.ДанныеОтчета.Получить();
	СтруктураДанныхТитульный = ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаФормаОтчета;
	
	ПечатнаяФорма = РегламентированнаяОтчетность.НоваяСтраница();
	ПечатнаяФорма.Вывести(ПечатнаяФормаМакет.ПолучитьОбласть("ОбщиеДанные"));
	ПечатнаяФорма.Вывести(ПечатнаяФормаМакет.ПолучитьОбласть("ORG_INFO"));
	ПечатнаяФорма.Вывести(ПечатнаяФормаМакет.ПолучитьОбласть("ОсновнаяЧасть3_1"));
	
	МнгИтер = 0;
	Пока Истина Цикл 
		МнгИтер = МнгИтер + 1;
		Если Не СтруктураДанныхТитульный.Свойство("П000003000101_" + МнгИтер) Тогда 
			Прервать;
		КонецЕсли;
		
		МнгСтр = ПечатнаяФормаМакет.ПолучитьОбласть("МногострочнаяЧасть2");
		МнгСтр.Области["УдалитьСтрокуП000003000101_1"].Текст = "";
		МнгСтр.Области["УдалитьСтрокуП000003000101_1"].Гиперссылка = Ложь;
		СтруктураДанныхТитульный.Свойство("П000003000101_" + МнгИтер, МнгСтр.Области["П000003000101_1"].Значение);
		МнгСтр.Области["П000003000101_1"].Имя = "";
		ПечатнаяФорма.Вывести(МнгСтр);
	КонецЦикла;
	
	ПечатнаяФорма.Вывести(ПечатнаяФормаМакет.ПолучитьОбласть("RPT_2TP_RECULT"));
	ПечатнаяФорма.Вывести(ПечатнаяФормаМакет.ПолучитьОбласть("ОсновнаяЧасть2_1"));
	
	МнгИтер = 0;
	Пока Истина Цикл 
		МнгИтер = МнгИтер + 1;
		Если Не СтруктураДанныхТитульный.Свойство("П000002000101_" + МнгИтер) Тогда 
			Прервать;
		КонецЕсли;
		
		МнгСтр = ПечатнаяФормаМакет.ПолучитьОбласть("МногострочнаяЧасть1");
		МнгСтр.Области["УдалитьСтрокуП000002000101_1"].Текст = "";
		МнгСтр.Области["УдалитьСтрокуП000002000101_1"].Гиперссылка = Ложь;
		Для Инд = 1 По 12 Цикл 
			ИндСтр = Формат(Инд, "ЧЦ=2; ЧВН=");
			СтруктураДанныхТитульный.Свойство("П0000020001" + ИндСтр + "_" + МнгИтер, МнгСтр.Области["П0000020001" + ИндСтр + "_1"].Значение);
			МнгСтр.Области["П0000020001" + ИндСтр + "_1"].Имя = "";
		КонецЦикла;
		ПечатнаяФорма.Вывести(МнгСтр);
	КонецЦикла;
	
	ПечатнаяФорма.Области["СгенерироватьИдентификатор"].Гиперссылка = Ложь;
	ПечатнаяФорма.Области["СгенерироватьИдентификатор"].Текст = "";
	РегламентированнаяОтчетность.ПоказателиВОбласти(СтруктураДанныхТитульный, ПечатнаяФорма);
	ПечатнаяФорма.Области["FINDIVID"].Формат = "БЛ=' '; БИ=V";
	КонтекстПечати.СтруктураРеквизитовФормы.мПечатныеФормы.Добавить(ПечатнаяФорма, "Форма 2-ТП(рекультивация)");
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(КонтекстПечати, , КонтекстПечати.СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	Возврат КонтекстПечати.СтруктураРеквизитовФормы.СписокПечатаемыхЛистов;
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли