#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДоступныеБанковскиеДокументы(Организация) Экспорт
	
	КоличествоМесяцев = Документы.ЗаявкаНаКредитПоВыписке.КоличествоМесяцевВыборкиДокументов();
	НачалоПериода = ДобавитьМесяц(ТекущаяДатаСеанса(), - КоличествоМесяцев);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеСРасчетногоСчета.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	СписаниеСРасчетногоСчета.Дата КАК Дата,
		|	СписаниеСРасчетногоСчета.Контрагент КАК Получатель,
		|	СписаниеСРасчетногоСчета.НазначениеПлатежа КАК НазначениеПлатежа,
		|	СписаниеСРасчетногоСчета.Комментарий КАК Комментарий,
		|	СписаниеСРасчетногоСчета.СуммаДокумента КАК Сумма,
		|	СписаниеСРасчетногоСчета.Ссылка КАК Документ
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|ГДЕ
		|	СписаниеСРасчетногоСчета.Проведен = ИСТИНА
		|	И СписаниеСРасчетногоСчета.Организация В(&Организации)
		|	И СписаниеСРасчетногоСчета.Дата >= &НачалоПериода
		|	И СписаниеСРасчетногоСчета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику)
		|	И СписаниеСРасчетногоСчета.ВалютаДокумента = &ВалютаРегУчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
	Запрос.УстановитьПараметр("Организации", Справочники.Организации.ВсяОрганизация(Организация));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ВалютаРегУчета", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
						
КонецФункции

Функция СчетОрганизацииПоУмолчанию(Организация, МассивБанков) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БанковскиеСчета.Ссылка КАК БанковскийСчет
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец = &Организация
		|	И БанковскиеСчета.ЦифровойСчет = ЛОЖЬ
		|	И НЕ БанковскиеСчета.ПометкаУдаления
		|	И БанковскиеСчета.Банк В(&МассивБанков)
		|	И БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ БанковскиеСчета.Валютный
		|
		|УПОРЯДОЧИТЬ ПО
		|	БанковскиеСчета.Наименование";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Если МассивБанков = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И БанковскиеСчета.Банк В(&МассивБанков)", "");
	Иначе
		Запрос.УстановитьПараметр("МассивБанков", МассивБанков);
	КонецЕсли;	

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.БанковскийСчет;
	КонецЕсли;
	
	Возврат Справочники.БанковскиеСчета.ПустаяСсылка();
	
КонецФункции

Процедура ОтправитьСтатистикуВСервис(Параметры, АдресХранилища) Экспорт
	
	// В сервис не отправляем данные с пустыми значениями
	Для Каждого ЭлементСтатистики Из Параметры.СодержимоеСтатистики.СтатистикаКредитПоВыписке Цикл
		УдалитьПустыеЭлементыСтруктуры(ЭлементСтатистики);
	КонецЦикла;
	
	СтрокаСтатистики = УниверсальныйОбменСБанками.СтруктуруВСтрокуJSON(Параметры.СодержимоеСтатистики);
	СтрокаСтатистики = СтрЗаменить(СтрокаСтатистики, Символы.ВК + Символы.ПС, ""); 
	СтрокаСтатистики = СтрЗаменить(СтрокаСтатистики, Символы.ПС, "");  
	СтрокаСтатистики = СтрЗаменить(СтрокаСтатистики, ",", "|");
	Результат = УниверсальныйОбменСБанками.СохранитьЗаписьАктивностиСервиса(Параметры.СервисОбменаСБанками,
		Параметры.ТокенАвторизации, "stat_CreditByStmt", СтрокаСтатистики);
	Если ЗначениеЗаполнено(АдресХранилища) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает наименование конфигурации.
//
// Возвращаемое значение:
//  Строка - название конфигурации.
//
Функция ИмяКонфигурации() Экспорт
	
	Если ВариантыПриложений.ЭтоБазоваяВерсия() Тогда
		Возврат НСтр("ru = 'БПБазовая'");
	ИначеЕсли ВариантыПриложений.ЭтоВерсияКОРП() Тогда 
		Возврат НСтр("ru = 'БПКОРП'");
	КонецЕсли; 
	
	Возврат НСтр("ru = 'БП'");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьПустыеЭлементыСтруктуры(ОбрабатываемаяСтруктура)
	
	КлючиПустыхЭлементов = Новый Массив;
	
	Для Каждого Элемент Из ОбрабатываемаяСтруктура Цикл
		Если НЕ ЗначениеЗаполнено(Элемент.Значение) Тогда
			КлючиПустыхЭлементов.Добавить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Ключ Из КлючиПустыхЭлементов Цикл
		ОбрабатываемаяСтруктура.Удалить(Ключ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли