
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("БыстроеРаспознавание") Тогда
		
		Элементы.ОК.Видимость = Ложь;
		Элементы.ФормаОтправитьБыстрое.Видимость = Истина;
		Элементы.ФормаОтправитьБыстрое.КнопкаПоУмолчанию = Истина;
		
		АдресЗаданияРаспознавания = ПоместитьВоВременноеХранилище(Параметры.ЗаданияРаспознавания, УникальныйИдентификатор);
		АдресEmail = АдресЭлектроннойПочтыДляУведомлений();

		Возврат;
	КонецЕсли;
	
	// Заполним реквизиты формы из параметров.
	Если Не ПустаяСтрока(Параметры.Комментарий) Тогда
		ДанныеJson = РаспознаваниеДокументовHTTP.JsonВОбъект(Параметры.Комментарий);
		ЭтотОбъект.ТекстПользователя = ДанныеJson.Получить("ТекстПользователя");
		ЭтотОбъект.АдресEmail = ДанныеJson.Получить("АдресEmail");
	КонецЕсли;
	
	Если ПустаяСтрока(АдресEmail) Тогда
		АдресEmail = АдресЭлектроннойПочтыДляУведомлений();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВДокумент Тогда
		СохранитьАдресЭлПочтыНаСервере();
		СтруктураРезультат = Новый Структура("Комментарий", РеквизитыФормыВJsonСтроку());
		ОповеститьОВыборе(СтруктураРезультат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		
		Отказ = Истина;
		
	ИначеЕсли Модифицированность И НЕ ПеренестиВДокумент Тогда
		
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ВопросСохраненияДанныхЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
		
	ИначеЕсли ПеренестиВДокумент Тогда
		
		Если Отказ Тогда
			Модифицированность = Истина;
			ПеренестиВДокумент = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПеренестиВДокумент = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Модифицированность = Ложь;
	ПеренестиВДокумент = Ложь;
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьБыстрое(Команда)
	
	ОтправитьБыстроеНаСервере();
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция РеквизитыФормыВJsonСтроку()
	
	ДанныеJson = Новый Структура("ТекстПользователя, АдресEmail", ТекстПользователя, АдресEmail);
	Возврат РаспознаваниеДокументовHTTP.ОбъектВJson(ДанныеJson);
	
КонецФункции

&НаКлиенте
Процедура ВопросСохраненияДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ПеренестиВДокумент = Истина;
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		ПеренестиВДокумент = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьАдресЭлПочтыНаСервере()
	
	Если ПустаяСтрока(АдресEmail) Тогда
		Возврат
	КонецЕсли;
	
	АдресЭлПочты = АдресЭлектроннойПочтыДляУведомлений();
	Если ПустаяСтрока(АдресЭлПочты) Тогда
		Возврат;
	КонецЕсли;
	
	РаспознаваниеДокументовSDK.УстановитьАдресЭлектроннойПочты(АдресEmail);
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.АдресЭлПочты = АдресEmail;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьБыстроеНаСервере()
	
	ЗаданияРаспознавания = ПолучитьИзВременногоХранилища(АдресЗаданияРаспознавания);
	
	ИдентификаторЗадания = ЗаданияРаспознавания[0].ИдентификаторЗадания;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("АдресЭлектроннойПочты", АдресEmail);
	ДополнительныеПараметры.Вставить("ТекущаяДата", ТекущаяДатаСеанса());
	ДополнительныеПараметры.Вставить("ЗаданияРаспознавания", ЗаданияРаспознавания);
	
	РаспознаваниеДокументовSDK.ОтправитьЖалобу(
		ИдентификаторЗадания, 
		ТекстПользователя, 
		ДополнительныеПараметры, 
		"fast_feedback");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресЭлектроннойПочтыДляУведомлений()
	
	АдресЭлПочты = "";
	ТекущиеНастройки = РегистрыСведений.ОбщиеНастройкиРаспознаваниеДокументов.ТекущиеНастройки();
	Если Не ТекущиеНастройки = Неопределено Тогда
		АдресЭлПочты = ТекущиеНастройки.АдресЭлПочты;
	КонецЕсли;
	
	Возврат АдресЭлПочты;

КонецФункции

#КонецОбласти

