#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// См. также БухгалтерскийУчетВызовСервераПовтИсп.ОсновнаяНоменклатурнаяГруппа(),
//           БухгалтерскийУчетВызовСервераПовтИсп.ИспользоватьОднуНоменклатурнуюГруппу()

#Область Свойства

// Получает описание предопределенных наборов свойств.
//
// Параметры:
//  Наборы - ДеревоЗначений - с колонками:
//     * Имя           - Строка - Имя набора свойств. Формируется из полного имени объекта
//                       метаданных заменой символа "." на "_".
//                       Например, "Документ_ЗаказПокупателя".
//     * Идентификатор - УникальныйИдентификатор - Идентификатор ссылки предопределенного элемента.
//     * Используется  - Неопределено, Булево - Признак того, что набор свойств используется.
//                       Например, можно использовать для скрытия набора по функциональным опциям.
//                       Значение по умолчанию - Неопределено, соответствует значению Истина.
//     * ЭтоГруппа     - Булево - Истина, если набор свойств является группой.
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Справочник_НоменклатурныеГруппы";
	Набор.Идентификатор = Новый УникальныйИдентификатор("f4d368df-f5a9-4c48-8126-91a9abfc21bb");
	Набор.Используется  = Истина;
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ПерезаполнитьКонстантуИспользоватьНесколькоНоменклатурныхГрупп() Экспорт
	
	МенеджерКонстанты = Константы.ИспользоватьНесколькоНоменклатурныхГрупп.СоздатьМенеджерЗначения();
	МенеджерКонстанты.Значение = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
	
КонецПроцедуры

#КонецОбласти

#Область ОсновнаяНоменклатурнаяГруппа

Функция НайтиСоздатьОсновнуюНоменклатурнуюГруппу() Экспорт
	
	КоличествоНоменклатурныхГрупп = КоличествоНоменклатурныхГрупп();
	Если КоличествоНоменклатурныхГрупп = 0 Тогда
		
		НаименованиеОсновнойНоменклатурнойГруппы = НСтр("ru = 'Основная номенклатурная группа'");
		
		УстановитьПривилегированныйРежим(Истина);
		
		НовыйЭлемент = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
		НовыйЭлемент.Заполнить(Неопределено);
		НовыйЭлемент.Наименование = НаименованиеОсновнойНоменклатурнойГруппы;
		НовыйЭлемент.Записать();
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ИспользоватьНесколькоНоменклатурныхГрупп

Процедура ПроверитьЗначениеОпцииИспользоватьНесколькоНоменклатурныхГрупп() Экспорт

	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоНоменклатурныхГрупп") И КоличествоНоменклатурныхГрупп() > 1 Тогда
	
		УстановитьПривилегированныйРежим(Истина);
		Константы.ИспользоватьНесколькоНоменклатурныхГрупп.Установить(Истина);
		ОбновитьПовторноИспользуемыеЗначения();
	
	КонецЕсли;

КонецПроцедуры

Функция КоличествоНоменклатурныхГрупп()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ
	|	НЕ НоменклатурныеГруппы.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Количество = Выборка.Количество;
	Иначе
		Количество = 0;
	КонецЕсли;
	
	Возврат Количество;
	
КонецФункции

#КонецОбласти

#КонецЕсли