#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
// 
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Записывает факт загрузки данных из другой учетной системы
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Система - Строка - наименование системы, из которой загружались данные
//
Процедура ЗаписатьСтатистикуЗагрузки(Организация, Система) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запись = СоздатьМенеджерЗаписи();
	Запись.Организация = Организация;
	Запись.Система = Система;
	Запись.ДатаЗагрузки = ТекущаяДатаСеанса();
	
	Запись.Записать();
	
КонецПроцедуры

//  Записывает пожелание пользователя добавить загрузку из системы, которую мы еще не поддерживаем
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Пожелание - Строка
//
Процедура ЗаписатьПожелание(Организация, Пожелание) Экспорт
	
	Если Не ЗначениеЗаполнено(Пожелание) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Система = ИмяСистемыОтсутствующейВСписке();
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Организация = Организация;
	Запись.Система = Система;
	Запись.Пожелание = Пожелание;
	Запись.ДатаЗагрузки = ТекущаяДатаСеанса();
	
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСистемыОтсутствующейВСписке()
	
	Возврат "Нет в списке (пожелание)";
	
КонецФункции

#КонецОбласти

#КонецЕсли