	
#Область ПрограммныйИнтерфейс

Функция СтрокаПараметров(МассивПараметров = Неопределено) Экспорт
	
	Если МассивПараметров = Неопределено Тогда
		ВОзврат "";
	КонецЕсли;
	
	Массив = Новый Массив;
	
	Для Индекс = 0 По МассивПараметров.Количество() -1 Цикл
		
		Массив.Добавить(СтрШаблон("МассивПараметров[%1]", Индекс));		
		
	КонецЦикла; 
	
	Возврат СтрСоединить(Массив, ",");
	
КонецФункции      

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//		ПутьКЗначению - Строка - Строка полного пути. Можно через точку. Пример "ИмяРеквизита.Имя"
Функция СтруктураИменРеквизитов(ПутьКЗначению = "") Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("ИмяСписка", Новый Структура("Имя, Заголовок", "abc_СписокПоступлений", "Поступления"));
	Структура.Вставить("ИмяРеквизита", Новый Структура("Имя, Заголовок", "abc_Поступление", "Поступление"));
	Структура.Вставить("ИмяКолонки", Новый Структура("Имя, Заголовок", "abc_КлассификаторТНВЭД", "Классификатор ТНВЭД"));	
	Структура.Вставить("ИмяРеквизитаКодТНВЭД", Новый Структура("Имя, Заголовок", "КодТНВЭД", "Код ТНВЭД"));
	
	Если НЕ ПустаяСтрока(ПутьКЗначению) Тогда
		
		МассивИмен = СтрРазделить(ПутьКЗначению, ".");
		Значение = Структура;
		Для Каждого Элем ИЗ МассивИмен Цикл
			Значение = Значение[Элем];
		КонецЦикла;
		
		Возврат Значение;
		
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти