
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриОткрытии(Форма) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ЗаданияРаспознаванияДокументов")
		И Форма.ЗаданияРаспознаванияДокументов.Количество() > 0 Тогда
		
		ПоказатьПанельРаспознаваниеДокументов(Форма);
		
		Форма.ПодключитьОбработчикОжидания("Подключаемый_ЗагрузитьДокументыРаспознаваниеДокументов", 0.1, Истина);
		Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСостояниеБаланса", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗакрытии(Форма) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ЗаданияРаспознаванияДокументов") Тогда
		УведомленияКлиента.ОтключитьОбработчик("РаспознаваниеДокументов.ДокументЗагружен");
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКоманду(Форма, Команда) Экспорт
	
	Если Команда.Имя = "ПоказатьПанельРаспознаваниеДокументов" Тогда
		
		ПоказатьПанельРаспознаваниеДокументов(Форма);
		
	ИначеЕсли Команда.Имя = "ЗакрытьПанельРаспознаваниеДокументов" Тогда
		
		ЗакрытьПанельРаспознаваниеДокументов(Форма);
		
	ИначеЕсли Команда.Имя = "ФайлыКОтправкеРаспознаваниеДокументовУдалить" Тогда
		
		ФайлыКОтправкеРаспознаваниеДокументовУдалить(Форма);
		
	ИначеЕсли Команда.Имя = "ФайлыКОтправкеРаспознаваниеДокументовПереместитьВниз" Тогда
		
		ФайлыКОтправкеРаспознаваниеДокументовПереместитьВниз(Форма);
		
	ИначеЕсли Команда.Имя = "ФайлыКОтправкеРаспознаваниеДокументовПереместитьВверх" Тогда
		
		ФайлыКОтправкеРаспознаваниеДокументовПереместитьВверх(Форма);
		
	ИначеЕсли Команда.Имя = "ФайлыКОтправкеРаспознаваниеДокументовДобавить" Тогда
		
		ФайлыКОтправкеРаспознаваниеДокументовДобавить(Форма);
		
	ИначеЕсли Команда.Имя = "Распознать" Тогда
		
		Распознать(Форма);
		
	ИначеЕсли Команда.Имя = "Пожаловаться" Тогда
		
		Пожаловаться(Форма);
		
	ИначеЕсли Команда.Имя = "СвернутьРазвернутьРаспознанныеФайлы" Тогда
		
		СвернутьРазвернутьРаспознанныеФайлы(Форма);
		
	ИначеЕсли РаспознаваниеДокументовКлиент.ЭтоКомандаБаланса(Команда) Тогда
		
		РаспознаваниеДокументовКлиент.ВыполнитьКомандуБаланса(ЭтотОбъект, Команда);
		
	Иначе
		
		ВызватьИсключение СтрШаблон(			НСтр("ru = 'Обработчика для команды %1 не существует'"),			Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьЗагрузкуФайловИнтерактивно(Форма) Экспорт
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов(НСтр("ru = 'Выберите файлы для загрузки'"));
	ВыполнитьЗагрузкуФайлов(Форма, ПараметрыДиалога);
	
КонецПроцедуры

Процедура ВыполнитьОтправкуФайлов(Форма) Экспорт
	
	Форма.Элементы.ДекорацияИдетЗагрузкаГруппаФайлы.Видимость = Истина;
	
	ФоновоеЗадание = РаспознаваниеДокументовБыстроеРаспознаваниеВызовСервера.ЗапуститьФоновуюОтправкуФайлов(
		Форма.ФайлыКОтправкеРаспознаваниеДокументов,
		Форма.УникальныйИдентификатор);
	
	Форма.ФайлыКОтправкеРаспознаваниеДокументов.Очистить();
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	
	Обработчик = Новый ОписаниеОповещения("ПослеОтправкиФайловНаРаспознавание", ЭтотОбъект, Новый Структура("Форма", Форма));
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

Процедура ПослеОтправкиФайловНаРаспознавание(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение НСтр("ru = 'Произошла ошибка при отправке файлов'");
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	ДанныеОтправки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если ДанныеОтправки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Файл Из ДанныеОтправки.Файлы Цикл
		
		НоваяСтрока = Форма.ЗаданияРаспознаванияДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Файл);
		
	КонецЦикла;
	
	Форма.Подключаемый_РаспознаваниеДокументовВызовСервера("ОтрисоватьФайлыНаФорме");
	Форма.ПодключитьОбработчикОжидания("Подключаемый_ЗагрузитьДокументыРаспознаваниеДокументов", 7, Истина);
	Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСостояниеБаланса", 1, Истина);	
	
КонецПроцедуры

Процедура ПриЗавершенииПомещенияФайлов(ПомещенныеФайлы, Контекст) Экспорт
	
	Форма = Контекст.Форма;
	
	Если Не ЗначениеЗаполнено(ПомещенныеФайлы) Тогда
		Форма.ОжиданиеРаспознавания = Ложь;
		Возврат;
	КонецЕсли;
	
	ОбновитьСостояниеФайлов(Форма, ПомещенныеФайлы);
	
	Если Форма.ОжиданиеРаспознавания И Не ЕстьНезагруженныеФайлы(Форма) Тогда
		Форма.ОжиданиеРаспознавания = Ложь;
		ВыполнитьОтправкуФайлов(Форма);
		Форма.Элементы.ГруппаОтправкаФайлов.ТекущаяСтраница = Форма.Элементы.ПредложениеПеретащить;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьФайлВСписок(Форма, СсылкиНаФайлы) Экспорт
	
	Если ТипЗнч(СсылкиНаФайлы) = Тип("СсылкаНаФайл") Тогда
		СсылкиНаФайлы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СсылкиНаФайлы);
	КонецЕсли;
	
	Для Каждого СсылкаНаФайл Из СсылкиНаФайлы Цикл
		Файл = ДобавитьФайл(Форма, СсылкаНаФайл.Имя, СсылкаНаФайл.ИдентификаторФайла, СсылкаНаФайл.Расширение);
	КонецЦикла;
	
	ВыполнитьЗагрузкуФайлов(Форма, СсылкиНаФайлы);
	
КонецПроцедуры

Процедура ЗагрузитьДокументыРаспознаваниеДокументов(Форма) Экспорт
	
	ЗаданияРаспознавания = Новый Массив;
	Для Каждого Строка Из Форма.ЗаданияРаспознаванияДокументов Цикл
		Если Не Строка.ЗагруженоПолностью Тогда
			ЗаданияРаспознавания.Добавить(Строка.ИдентификаторЗадания);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаданияРаспознавания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикПрогресса = Новый ОписаниеОповещения("ПослеПрогрессаЗагрузкиДокумента", ЭтотОбъект, Форма);
	УведомленияКлиента.ПодключитьОбработчик("РаспознаваниеДокументов.ДокументЗагружен", ОбработчикПрогресса);
	
	ФоновоеЗадание = РаспознаваниеДокументовБыстроеРаспознаваниеВызовСервера.ЗапуститьПараллельнуюЗагрузку(
		ЗаданияРаспознавания,
		Форма.УникальныйИдентификатор);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	НастройкиОжидания.Интервал = 10;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	Обработчик = Новый ОписаниеОповещения(
		"ПослеЗагрузкиДокументовРаспознаваниеДокументов",
		ЭтотОбъект,
		ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

Процедура ПослеПрогрессаЗагрузкиДокумента(Данные, Форма) Экспорт
	
	ОбработатьРезультатЗагрузки(Данные, Форма);
	
КонецПроцедуры

Процедура ПослеЗагрузкиДокументовРаспознаваниеДокументов(Задание, Контекст) Экспорт
	
	Форма = Контекст.Форма;
	ЭтоОшибка = Ложь;
	
	Если Задание <> Неопределено И Задание.Статус = "Выполнено" Тогда
		
		Результат = ПолучитьИзВременногоХранилища(Задание.АдресРезультата);
		
		Если Результат <> Неопределено Тогда
			ОбработатьРезультатЗагрузки(Результат, Форма);
		КонецЕсли;
		
	ИначеЕсли Задание <> Неопределено Тогда
		
		ЭтоОшибка = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не удалось загрузить распознанные документы. Подробности см. в журнале регистрации.'"));
		РаспознаваниеДокументовБыстроеРаспознаваниеВызовСервера.ЗаписатьСобытиеЖурналаРегистрации(
			"РаспознаваниеДокументов.ОшибкаЗагрузки",
			СтрШаблон(НСтр("ru = 'Статус фонового задания: %1'"), Задание.Статус));
		
	КонецЕсли;
	
	НезавершенныеЗадания = Форма.ЗаданияРаспознаванияДокументов.НайтиСтроки(
		Новый Структура("ЗагруженоПолностью", Ложь));
	
	Если Не ЭтоОшибка И НезавершенныеЗадания.Количество() > 0 Тогда
		Форма.ПодключитьОбработчикОжидания(
			"Подключаемый_ЗагрузитьДокументыРаспознаваниеДокументов", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьРезультатЗагрузки(Результат, Форма)
	
	Для Каждого ИдентификаторЗадания Из Результат.ЗавершенныеЗадания Цикл
		СтрокиЗадания = Форма.ЗаданияРаспознаванияДокументов.НайтиСтроки(
			Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания));
		Если СтрокиЗадания.Количество() > 0 Тогда
			СтрокиЗадания[0].ЗагруженоПолностью = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьТаблицуФормыЗаданияРаспознавания(Результат, Форма);
	ДобавитьРаспознанныеДокументыНаФорму(Результат, Форма);
	ОтметитьФайлыОбработанными(Форма);
	
	ТипДокумента = ТипДокументаИзФормы(Форма);
	РаспознаваниеДокументовКлиентПереопределяемый.ОбновитьИтогиДокументаПослеБыстрогоРаспознавания(Форма, ТипДокумента);
	
КонецПроцедуры

Процедура ИнициализироватьДанныеРаспознанногоРеквизита(Форма, Знач ИмяРеквизита) Экспорт
	
	СоответствиеРаспознанныхРеквизитов = Неопределено;
	РаспознаваниеДокументовКлиентПереопределяемый.СоответствиеРаспознанныхРеквизитов(Форма, СоответствиеРаспознанныхРеквизитов);
	Если СоответствиеРаспознанныхРеквизитов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	ДанныеРеквизита = СоответствиеРаспознанныхРеквизитов.Получить(ИмяРеквизита);
	Если ДанныеРеквизита = Неопределено Тогда
		ДанныеЯчейки = Новый Структура;
		ДанныеЯчейки.Вставить("РаспознанныйТекст", "");
		ДанныеЯчейки.Вставить("КоординатыКартинки", Неопределено);
		ДанныеЯчейки.Вставить("СтрокВИзображении", 0);
		ДанныеЯчейки.Вставить("ЗначенияВыбора", Новый Массив);
		
		ОбновитьПолнуюКартинку = Ложь;
	Иначе
	
		ОбновитьПолнуюКартинку = Форма.ТекущийРаспознанныйДокумент <> ДанныеРеквизита.Документ;
		
		ИменаРеквизитов = ИменаРеквизитовШапкиРаспознанногоДокумента(Форма);
		ИмяРеквизитаРаспознанногоДокумента = ИмяРеквизита;
		ИменаРеквизитов.Свойство(ИмяРеквизита, ИмяРеквизитаРаспознанногоДокумента);
		
		ПараметрыПолучения = Новый Структура;
		ПараметрыПолучения.Вставить("Ссылка", ДанныеРеквизита.Документ);
		ПараметрыПолучения.Вставить("УникальныйИдентификатор", Форма.УникальныйИдентификатор);
		ПараметрыПолучения.Вставить("ОбновитьПолнуюКартинку", ОбновитьПолнуюКартинку);
		ПараметрыПолучения.Вставить("ИмяРеквизита", ИмяРеквизитаРаспознанногоДокумента);
		
		Если ИмяРеквизитаРаспознанногоДокумента = "Договор" Тогда
			ПараметрыПолучения.Вставить("ИсточникПоляДоговорКонтрагент", Объект.Контрагент);
			ПараметрыПолучения.Вставить("ИсточникПоляДоговорОрганизация", Объект.Организация);
			ПараметрыПолучения.Вставить("ИсточникПоляДоговорВидДоговора", ВидыДоговоровПоТипуДокумента(Форма));
		КонецЕсли;
		
		ДанныеЯчейки = РаспознаваниеДокументовКомплектыВызовСервера.ДанныеЯчейкиШапкиНаСервере(ПараметрыПолучения);
	КонецЕсли;

	ОтобразитьДанныеРаспознавания(Форма, ДанныеЯчейки, ОбновитьПолнуюКартинку, Элементы[ИмяРеквизита], Объект[ИмяРеквизита]);
	
	Если ДанныеРеквизита <> Неопределено Тогда
		Форма.ТекущийРаспознанныйДокумент = ДанныеРеквизита.Документ;
	КонецЕсли;
	
	Форма.ИмяРаспознанногоРеквизита = ИмяРеквизита;
	
КонецПроцедуры

Процедура ИнициализироватьДанныеРаспознаннойЯчейки(Форма, Знач ИмяЭлемента, Знач ИдентификаторСтроки, ИмяТаблицы) Экспорт
	
	СоответствиеРаспознанныхРеквизитов = Неопределено;
	РаспознаваниеДокументовКлиентПереопределяемый.СоответствиеРаспознанныхРеквизитов(Форма, СоответствиеРаспознанныхРеквизитов);
	Если СоответствиеРаспознанныхРеквизитов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Строка = Объект[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ИмяКолонки = СтрЗаменить(ИмяЭлемента, ИмяТаблицы, "");
	
	ЗаменыИмен = Новый Структура;
	ЗаменыИмен.Вставить("НоменклатураЕдиницаИзмерения", "ЕдиницаИзмерения");
	ЗаменыИмен.Вставить("НоменклатураИнтерактивная", "Номенклатура");
	ЗаменыИмен.Вставить("ОсновноеСредствоИнтерактивная", "ОсновноеСредство");
	
	Если ЗаменыИмен.Свойство(ИмяКолонки) Тогда
		ИмяКолонки = ЗаменыИмен[ИмяКолонки];
	КонецЕсли;
	
	ДанныеСтроки = СоответствиеРаспознанныхРеквизитов.Получить(Строка);
	Если ДанныеСтроки = Неопределено Тогда
		
		РеквизитТаблицыДокумента = Новый Структура;
		РеквизитТаблицыДокумента.Вставить("РаспознанныйТекст", "");
		РеквизитТаблицыДокумента.Вставить("КоординатыКартинки", Неопределено);
		РеквизитТаблицыДокумента.Вставить("СтрокВИзображении", 0);
		РеквизитТаблицыДокумента.Вставить("ЗначенияВыбора", Новый Массив);

		ОбновитьПолнуюКартинку = Ложь;
		
	Иначе

		ОбновитьПолнуюКартинку = Форма.ТекущийРаспознанныйДокумент <> ДанныеСтроки.Документ;

		ПараметрыПолучения = Новый Структура;
		ПараметрыПолучения.Вставить("Ссылка", ДанныеСтроки.Документ);
		ПараметрыПолучения.Вставить("НомерСтрокиТЧ", ДанныеСтроки.НомерСтроки);
		ПараметрыПолучения.Вставить("УникальныйИдентификатор", Форма.УникальныйИдентификатор);
		ПараметрыПолучения.Вставить("ОбновитьПолнуюКартинку", ОбновитьПолнуюКартинку);
		ПараметрыПолучения.Вставить("ИмяРеквизита", ИмяКолонки);
		РеквизитТаблицыДокумента = РаспознаваниеДокументовКомплектыВызовСервера.ДанныеЯчейкиТаблицыНаСервере(
			ПараметрыПолучения);
	КонецЕсли;
	
	Если Объект[ИмяТаблицы].Количество() > 0
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект[ИмяТаблицы][0], ИмяКолонки) Тогда
		ТекущийРеквизит = Объект[ИмяТаблицы][0][ИмяКолонки];
	ИначеЕсли ИмяКолонки = "ЕдиницаИзмерения" Тогда
		ТекущийРеквизит = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка");
	Иначе
		ТекущийРеквизит = Неопределено;
	КонецЕсли;
	
	ОтобразитьДанныеРаспознавания(
		Форма, РеквизитТаблицыДокумента, ОбновитьПолнуюКартинку, Элементы[ИмяЭлемента], ТекущийРеквизит);
	
	Если ДанныеСтроки <> Неопределено Тогда
		Форма.ТекущийРаспознанныйДокумент = ДанныеСтроки.Документ;
	КонецЕсли;
	
	Форма.ИмяРаспознанногоРеквизита = ИмяТаблицы;
	
КонецПроцедуры

Процедура ОбновитьПолнуюКартинку(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Не ЗначениеЗаполнено(Форма.ТекущийРаспознанныйДокумент) Тогда
		Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбновитьПолнуюКартинку", 0.1, Истина);
		Возврат;
	КонецЕсли;
	
	Если Элементы.ПолеПросмотра.Документ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПолеПросмотра.Документ.defaultView.hide_buttons();
	
	АдресКартинки = РаспознаваниеДокументовКомплектыВызовСервера.ПолучитьАдресПолнойКартинки(
		Форма.ТекущийРаспознанныйДокумент, Форма.УникальныйИдентификатор);
	
	РаспознаваниеДокументовСлужебныйКлиент.ЗагрузитьКартинкуПоАдресу(Элементы.ПолеПросмотра, АдресКартинки);
	
КонецПроцедуры

Процедура ПриблизитьПоКоординатам(ПолеПросмотра, Координаты) Экспорт
	
	Если ПолеПросмотра.Документ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РаспознаваниеДокументовКлиентСервер.ВсеКоординатыНулевые(Координаты) Тогда
		ПолеПросмотра.Документ.defaultView.clean_bbox();
	Иначе
		ПолеПросмотра.Документ.defaultView.zoom_to_bbox_fullscreen(
			Координаты[0],
			Координаты[1],
			Координаты[2],
			Координаты[3],
			0);
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьЭлемент(Форма) Экспорт
	
	ТекущийРаспознанныйДокумент = Форма.ТекущийРаспознанныйДокумент;
	Элементы = Форма.Элементы;
	ИмяРаспознанногоРеквизита = Форма.ИмяРаспознанногоРеквизита;
	
	Если ИмяРаспознанногоРеквизита = "Товары"
		Или ИмяРаспознанногоРеквизита = "Услуги" Тогда
		
		Элемент = Элементы[ИмяРаспознанногоРеквизита].ТекущийЭлемент;
		ИмяРеквизита = СтрЗаменить(Элемент.Имя, ИмяРаспознанногоРеквизита, "");
		
		СоответствиеРаспознанныхРеквизитов = Неопределено;
		РаспознаваниеДокументовКлиентПереопределяемый.СоответствиеРаспознанныхРеквизитов(Форма, СоответствиеРаспознанныхРеквизитов);
		ДанныеРеквизита = СоответствиеРаспознанныхРеквизитов.Получить(
			Форма.Объект[ИмяРаспознанногоРеквизита].НайтиПоИдентификатору(Элементы[ИмяРаспознанногоРеквизита].ТекущаяСтрока));
		
		Если ДанныеРеквизита = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СвойстваЯчеекТаблицы = РаспознаваниеДокументовБыстроеРаспознаваниеВызовСервера.СвойстваЯчеекТаблицы(ДанныеРеквизита);
		НомерСтрокиТЧ = ДанныеРеквизита.НомерСтроки;
		
		Ключ = РаспознаваниеДокументовСлужебныйКлиентСервер.КлючСвойстваЯчеекТаблицы(ИмяРеквизита, НомерСтрокиТЧ);
		Свойства = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваЯчеекТаблицы, Ключ);
		
		Значение = Свойства.Значение;
		
		ИмяТаблицы = "РеквизитыТабличныхЧастей";
		
	Иначе
		
		Элемент = Элементы[ИмяРаспознанногоРеквизита];
		ИмяРеквизита = Элемент.Имя;
		
		ИменаРеквизитов = ИменаРеквизитовШапкиРаспознанногоДокумента(Форма);
		
		ИменаРеквизитов.Свойство(ИмяРеквизита, ИмяРеквизита);
		
		Значение = РаспознаваниеДокументовБыстроеРаспознаваниеВызовСервера.ЗначениеРеквизитаРаспознанногоДокумента(
			ТекущийРаспознанныйДокумент, ИмяРеквизита);
		
		ИмяТаблицы = "РеквизитыДокумента";
		
	КонецЕсли;
	
	ДатаДокумента = РаспознаваниеДокументовСлужебныйВызовСервера.ЗначениеРеквизитаОбъекта(
		ТекущийРаспознанныйДокумент, "ДатаДокумента");
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("РаспознанныйДокумент", ТекущийРаспознанныйДокумент);
	ДополнительныеДанные.Вставить("ИмяТаблицы", ИмяТаблицы);
	ДополнительныеДанные.Вставить("НомерСтрокиТЧ", НомерСтрокиТЧ);
	ДополнительныеДанные.Вставить("ДатаДокумента", ДатаДокумента);
	
	Если ИмяРеквизита = "Договор" Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Контрагент") Тогда
			ДополнительныеДанные.Вставить("Владелец", Форма.Объект.Контрагент);
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Организация") Тогда
			ДополнительныеДанные.Вставить("Организация", Форма.Объект.Организация);
		КонецЕсли;
	КонецЕсли;
	
	ВидыДоговоров = ВидыДоговоровПоТипуДокумента(Форма);
	СписокВидыДоговоров = Новый СписокЗначений;
	СписокВидыДоговоров.ЗагрузитьЗначения(ВидыДоговоров);
	
	ДополнительныеДанные.Вставить("ВидДоговора", СписокВидыДоговоров);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ЗапретОткрытияСозданныхЭлементов", Истина);
	ПараметрыОткрытия.Вставить("ИмяЭлемента", ИмяРеквизита);
	ПараметрыОткрытия.Вставить("ДополнительныеДанные", ДополнительныеДанные);
	ПараметрыОткрытия.Вставить("СоздаваемыйОбъект", Значение);
	ПараметрыОткрытия.Вставить("ИмяРаспознанногоРеквизита", ИмяРаспознанногоРеквизита);
	
	ОткрытьФорму("Обработка.РаспознаваниеДокументов.Форма.СозданиеЭлементаСОтображениемКартинки", ПараметрыОткрытия, Элемент);
	
КонецПроцедуры

Процедура ОбработкаВыбораПоля(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
		И ВыбранноеЗначение.Свойство("СозданВФормеБРД") Тогда
		
		ВыбранноеЗначение = ВыбранноеЗначение.Ссылка;
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение = "СоздатьЭлементБРД" Тогда
		СтандартнаяОбработка = Ложь;
		СоздатьЭлемент(Форма);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьОрганизациюПоУмолчанию(Форма)
	
	Если Не РаспознаваниеДокументовБыстроеРаспознаваниеВызовСервера.ИспользуетсяНесколькоОрганизаций() Тогда
		Возврат;
	КонецЕсли;
	
	// Защита от повторной очистки: если хотя бы один документ уже добавлен на форму — не трогаем
	Для Каждого Задание Из Форма.ЗаданияРаспознаванияДокументов Цикл
		Для Каждого СтрокаДокумента Из Задание.ДокументыПоЗаданию Цикл
			Если СтрокаДокумента.ДобавленНаФорму Тогда
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Форма.Объект.Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Распознать(Форма)
	
	Если Форма.ФайлыКОтправкеРаспознаваниеДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьНезагруженныеФайлы(Форма) Тогда
		Форма.ОжиданиеРаспознавания = Истина;
	Иначе
		Форма.ОжиданиеРаспознавания = Ложь;
		ВыполнитьОтправкуФайлов(Форма);
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	Элементы.ГруппаОтправкаФайлов.ТекущаяСтраница = Элементы.ПредложениеПеретащить;
	
КонецПроцедуры

Процедура Пожаловаться(Форма)
	
	Если Форма.ЗаданияРаспознаванияДокументов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'На распознавание не отправлено ни одного файла'"));
		Возврат;
	КонецЕсли;
	
	ЗаданияРаспознавания = ЗаданияРаспознаванияВМассив(Форма.ЗаданияРаспознаванияДокументов);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("БыстроеРаспознавание", Истина);
	ПараметрыОткрытия.Вставить("ЗаданияРаспознавания", ЗаданияРаспознавания);
	
	ОткрытьФорму("Обработка.РаспознаваниеДокументов.Форма.ФормаОбратнойСвязи", ПараметрыОткрытия);
	
КонецПроцедуры

Функция ЗаданияРаспознаванияВМассив(ЗаданияРаспознаванияДокументов)
	
	ЗаданияРаспознавания = Новый Массив;
	
	Для Каждого Задание Из ЗаданияРаспознаванияДокументов Цикл
		
		ДокументыПоЗаданию = Новый Массив;
		
		Для Каждого ДокументЗадания Из Задание.ДокументыПоЗаданию Цикл
			Документ = Новый Структура;
			Документ.Вставить("НомерСтраницы", ДокументЗадания.НомерСтраницы);
			Документ.Вставить("ОшибкаПриСозданииДокумента", Не ЗначениеЗаполнено(ДокументЗадания.РаспознанныйДокумент));
			Документ.Вставить("ДобавленНаФорму", ДокументЗадания.ДобавленНаФорму);
			
			ДокументыПоЗаданию.Добавить(Документ);
		КонецЦикла;
		
		ЗаданиеРаспознавания = Новый Структура;
		ЗаданиеРаспознавания.Вставить("ИдентификаторЗадания", Задание.ИдентификаторЗадания);
		ЗаданиеРаспознавания.Вставить("ЗагруженоПолностью", Задание.ЗагруженоПолностью);
		ЗаданиеРаспознавания.Вставить("ЕстьНаФорме", Задание.ЕстьНаФорме);
		ЗаданиеРаспознавания.Вставить("ИмяФайла", Задание.ИмяФайла);
		ЗаданиеРаспознавания.Вставить("ДокументыПоЗаданию", ДокументыПоЗаданию);
		
		ЗаданияРаспознавания.Добавить(ЗаданиеРаспознавания);
		
	КонецЦикла;
	
	Возврат ЗаданияРаспознавания;
	
КонецФункции

#Область РаботаСФайлами

Функция ЕстьНезагруженныеФайлы(Форма)
	
	Для Каждого Файл Из Форма.ФайлыКОтправкеРаспознаваниеДокументов Цикл
		Если ПустаяСтрока(Файл.Адрес) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ОбновитьСостояниеФайлов(Форма, ПомещенныеФайлы)
	
	Для Каждого ПомещенныйФайл Из ПомещенныеФайлы Цикл
		
		Файл = НайтиФайлПоИдентификатору(Форма.ФайлыКОтправкеРаспознаваниеДокументов, ПомещенныйФайл.СсылкаНаФайл.ИдентификаторФайла);
		
		Если Файл = Неопределено Тогда
			Файл = ДобавитьФайл(
				Форма,
				ПомещенныйФайл.СсылкаНаФайл.Имя,
				ПомещенныйФайл.СсылкаНаФайл.ИдентификаторФайла,
				ПомещенныйФайл.СсылкаНаФайл.Расширение
			);
		КонецЕсли;
		
		Файл.Адрес = ПомещенныйФайл.Адрес;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиФайлПоИдентификатору(Файлы, ИдентификаторВнутренний)
	
	Для Каждого Файл Из Файлы Цикл
		
		Если Файл.ИдентификаторВнутренний = ИдентификаторВнутренний Тогда
			Возврат Файл;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДобавитьФайл(Форма, Имя, ИдентификаторФайла, Расширение)
	
	НовыйФайл = Форма.ФайлыКОтправкеРаспознаваниеДокументов.Добавить();
	НовыйФайл.Наименование = Имя;
	НовыйФайл.ИдентификаторВнутренний = ИдентификаторФайла;
	НовыйФайл.Расширение = Расширение;
	НовыйФайл.ИндексКартинки = РаботаСФайламиСлужебныйКлиентСервер.ИндексПиктограммыФайла(Расширение);
	
	Возврат НовыйФайл;

КонецФункции

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ОтобразитьДанныеРаспознавания(Форма, ДанныеРаспознавания, ОбновитьПолнуюКартинку, ЭлементКолонка, ТекущийРеквизит)
	
	Если ДанныеРаспознавания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.РаспознанныйТекст = ДанныеРаспознавания.РаспознанныйТекст;
	Если ОбновитьПолнуюКартинку Тогда
		РаспознаваниеДокументовСлужебныйКлиент.ЗагрузитьКартинкуПоАдресу(
			Форма.Элементы.ПолеПросмотра, ДанныеРаспознавания.АдресПолнойКартинки);
	КонецЕсли;
	
	СписокДляВыбора = РаспознаваниеДокументовСлужебныйКлиент.ПолучитьЗначенияСпискаВыбора(
		ДанныеРаспознавания.РаспознанныйТекст, ТипЗнч(ТекущийРеквизит),
		ДанныеРаспознавания.ЗначенияВыбора);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементКолонка, "СписокВыбора") Тогда
		
		ЭлементКолонка.СписокВыбора.Очистить();
		
		ОтфильтрованныйСписок = ПолучитьОтфильтрованныйСписокНоменклатуры(
			СписокДляВыбора, ЭлементКолонка.Имя);
		
		Для Каждого ДанныеВыбора Из ОтфильтрованныйСписок Цикл
		ЭлементКолонка.СписокВыбора.Добавить(ДанныеВыбора.Значение, 
			ДанныеВыбора.Представление, , ДанныеВыбора.Картинка);
	КонецЦикла;
	
		ЭлементКолонка.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		ЭлементКолонка.КнопкаСоздания = Ложь;
		
	КонецЕсли;
	
	Форма.СтрокВИзображении = ДанныеРаспознавания.СтрокВИзображении;
	РаспознаваниеДокументовКлиентПереопределяемый.УстановитьКоординатыРаспознаннойОбласти(Форма, ДанныеРаспознавания.КоординатыКартинки);
	
	Форма.ПодключитьОбработчикОжидания("Подключаемый_ПриблизитьПоКоординатам", 0.1, Истина);
	
КонецПроцедуры

Функция ПолучитьОтфильтрованныйСписокНоменклатуры(СписокДляВыбора, ИмяКолонки)
	
	ОтфильтрованныйСписок = СписокДляВыбора;
	ЭтоТоварыНоменклатура = (ИмяКолонки = "ТоварыНоменклатура");
	ЭтоУслугиНоменклатура = (ИмяКолонки = "УслугиНоменклатура");
	
	Если ЭтоТоварыНоменклатура Или ЭтоУслугиНоменклатура Тогда
		
		СсылкиНоменклатуры = Новый Массив;
		Для Каждого ДанныеВыбора Из СписокДляВыбора Цикл
			Если ТипЗнч(ДанныеВыбора.Значение) = Тип("СправочникСсылка.Номенклатура") Тогда
				СсылкиНоменклатуры.Добавить(ДанныеВыбора.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Если СсылкиНоменклатуры.Количество() > 0 Тогда
			ЭтоУслугиСоответствие = РаспознаваниеДокументовБПВызовСервера.ЭтоУслугиНоменклатуры(СсылкиНоменклатуры);
			
			ОтфильтрованныйСписок = Новый Массив;
			Для Каждого ДанныеВыбора Из СписокДляВыбора Цикл
				Если ТипЗнч(ДанныеВыбора.Значение) = Тип("СправочникСсылка.Номенклатура") Тогда
					ЭтоУслуга = ЭтоУслугиСоответствие.Получить(ДанныеВыбора.Значение);
					Если ЭтоУслуга <> Неопределено Тогда
						НуженЭлемент = (ЭтоТоварыНоменклатура И Не ЭтоУслуга)
							Или (ЭтоУслугиНоменклатура И ЭтоУслуга);
						Если НуженЭлемент Тогда
							ОтфильтрованныйСписок.Добавить(ДанныеВыбора);
						КонецЕсли;
					Иначе
						ОтфильтрованныйСписок.Добавить(ДанныеВыбора);
					КонецЕсли;
				Иначе
					ОтфильтрованныйСписок.Добавить(ДанныеВыбора);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОтфильтрованныйСписок;
	
КонецФункции

Процедура ОбработкаВыбораРаспознанногоРеквизита(Форма, ВыбранноеЗначение) Экспорт
	
	Элементы = Форма.Элементы;
	
	ИмяРеквизита = Форма.ИмяРаспознанногоРеквизита;
	Если ИмяРеквизита = "Товары" Тогда
		Элемент = Элементы.Товары.ТекущийЭлемент;
		ИмяРеквизита = СтрЗаменить(Элемент.Имя, "Товары", "");
		
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные[ИмяРеквизита] = ВыбранноеЗначение;
		КонецЕсли;
		
	Иначе
		Форма.Объект[ИмяРеквизита] = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРаспознанныйДокументНаФорму(Форма, Документ, ИдентификаторЗадания = "")
	
	СоответствиеРаспознанныхРеквизитов = Неопределено;
	РаспознаваниеДокументовКлиентПереопределяемый.СоответствиеРаспознанныхРеквизитов(Форма, СоответствиеРаспознанныхРеквизитов);
	Если СоответствиеРаспознанныхРеквизитов = Неопределено Тогда
		СоответствиеРаспознанныхРеквизитов = Новый Соответствие;
		РаспознаваниеДокументовКлиентПереопределяемый.УстановитьСоответствиеРаспознанныхРеквизитов(Форма, СоответствиеРаспознанныхРеквизитов);
	КонецЕсли;
		
	Форма.Элементы.ГруппаСтраницаРаспознанныйРеквизит.Видимость = Истина;
	
	ПараметрыЗаполнения = ПараметрыЗаполненияДляДокументаБыстро(Форма, Документ);
	
	ЗаполнитьРеквизитыШапкиДокумента(Форма, ПараметрыЗаполнения, СоответствиеРаспознанныхРеквизитов, Документ);
	
	ИменаТаблиц = Новый Массив;
	
	ТипДокумента = ТипДокументаИзФормы(Форма);
	Если ТипДокумента = "СчетНаОплатуПоставщика" Или ТипДокумента = "СчетНаОплатуПокупателю" Тогда
		ИменаТаблиц.Добавить("Товары");
	Иначе
		ПодготовитьТаблицыКЗаполнению(ПараметрыЗаполнения, ИменаТаблиц, Форма.Объект.ВидОперации);
	КонецЕсли;
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
		
		ЗаполнитьТабличнуюЧастьДокументаПакетно(Форма,
			ПараметрыЗаполнения,
			СоответствиеРаспознанныхРеквизитов,
			Документ,
			ИмяТаблицы,
			ТипДокумента);
			
	КонецЦикла;
	
	ЗаполнитьСтавкуНДСПоОбщейСтавке(Форма, ПараметрыЗаполнения, ИменаТаблиц);
	
КонецПроцедуры

Процедура ДобавитьРаспознанныеДокументыНаФорму(Результат, Форма)
	
	Для Каждого Задание Из Форма.ЗаданияРаспознаванияДокументов Цикл
		
		ОжидаемыйНомерСтраницы = 0;
		Для Каждого Строка Из Задание.ДокументыПоЗаданию Цикл
			
			Если Строка.ДобавленНаФорму Тогда
				ОжидаемыйНомерСтраницы = ОжидаемыйНомерСтраницы + 1;
				Продолжить;
			КонецЕсли;
			
			// Пропускаем страницу с ошибкой
			Если Не ЗначениеЗаполнено(Строка.РаспознанныйДокумент) Тогда
				ОжидаемыйНомерСтраницы = ОжидаемыйНомерСтраницы + 1;
				Продолжить;
			КонецЕсли;
			
			Если ОжидаемыйНомерСтраницы <> Строка.НомерСтраницы Тогда
				Возврат;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Форма.ТекущийРаспознанныйДокумент) Тогда
				Форма.ТекущийРаспознанныйДокумент = Строка.РаспознанныйДокумент;
			КонецЕсли;
			
			ОчиститьОрганизациюПоУмолчанию(Форма);
			
			ДобавитьРаспознанныйДокументНаФорму(Форма, Строка.РаспознанныйДокумент, Задание.ИдентификаторЗадания);
			
			Строка.ДобавленНаФорму = Истина;
			ОжидаемыйНомерСтраницы = ОжидаемыйНомерСтраницы + 1;
			
		КонецЦикла;
		
		Если Не Задание.ЗагруженоПолностью Тогда
			Возврат;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТаблицуФормыЗаданияРаспознавания(Результат, Форма)
	
	Для Каждого ЗаданиеДокументы Из Результат.ДокументыПоЗаданиям Цикл
		
		СтрокиЗадания = Форма.ЗаданияРаспознаванияДокументов.НайтиСтроки(Новый Структура("ИдентификаторЗадания", ЗаданиеДокументы.Ключ));
		Если СтрокиЗадания.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаЗадания = СтрокиЗадания[0];
		
		Для Каждого Документ Из ЗаданиеДокументы.Значение Цикл
			
			СтрокиДокумента = СтрокаЗадания.ДокументыПоЗаданию.НайтиСтроки(Новый Структура("НомерСтраницы", Документ.НомерСтраницы));
			Если СтрокиДокумента.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = СтрокаЗадания.ДокументыПоЗаданию.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Документ);
			
		КонецЦикла;
		
		СтрокаЗадания.ДокументыПоЗаданию.Сортировать("НомерСтраницы");
		
	КонецЦикла;

КонецПроцедуры

Функция ВсеДокументыЗаданияДобавленыНаФорму(Задание)

	Если Не Задание.ЗагруженоПолностью Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Каждого Строка Из Задание.ДокументыПоЗаданию Цикл
		Если Не Строка.ДобавленНаФорму И ЗначениеЗаполнено(Строка.РаспознанныйДокумент) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

Процедура ОтметитьФайлыОбработанными(Форма)

	КоличествоРаспознанных = 0;

	Для Каждого Задание Из Форма.ЗаданияРаспознаванияДокументов Цикл

		Если ВсеДокументыЗаданияДобавленыНаФорму(Задание) Тогда
			ИндексСтроки = Форма.ЗаданияРаспознаванияДокументов.Индекс(Задание);
			Форма.Элементы["ДекорацияФайлКартинка_" + ИндексСтроки].Картинка = БиблиотекаКартинок.СтатусРаспознаванияДокументаОбработан;
			КоличествоРаспознанных = КоличествоРаспознанных + 1;
		КонецЕсли;

	КонецЦикла;

	КоличествоФайлов = Форма.ЗаданияРаспознаванияДокументов.Количество();

	Форма.Элементы.КнопкаВсплывающаяРаспознанныеФайлы.Заголовок = СтрШаблон(
		НСтр("ru = 'Распознано: %1 / %2'"),
		КоличествоРаспознанных,
		КоличествоФайлов);

КонецПроцедуры

Функция ПараметрыЗаполненияДляДокументаБыстро(Форма, Документ)
	
	ТипДокумента = ТипДокументаИзФормы(Форма);
	
	Если ТипДокумента = "СчетНаОплатуПоставщика" Или ТипДокумента = "СчетНаОплатуПокупателю" Тогда
		
		ПараметрыЗаполнения = РаспознаваниеДокументовСлужебныйВызовСервера.ПараметрыЗаполненияТиповойНаОсновеСчетНаОплату(
			Документ, ТипДокумента);
	Иначе
		
		ВидОперации = Форма.Объект.ВидОперации;
		ПараметрыЗаполнения = РаспознаваниеДокументовСлужебныйВызовСервера.ПараметрыЗаполненияТиповойНаОсновеФормыТОРГ12Быстро(
			Документ,
			ВидОперации,
			ТипДокумента);
	КонецЕсли;
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция ТипДокументаИзФормы(Форма)
	
	ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы, ".");
	
	Если ЧастиИмени.Количество() >= 2 И ЧастиИмени[0] = "Документ" Тогда
		Возврат ЧастиИмени[1];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПодготовитьТаблицыКЗаполнению(ПараметрыЗаполнения, ИменаТаблицДокумента, ВидОперации)
	
	ЗаполнитьИменаТаблицПоВидуОперации(ВидОперации, ИменаТаблицДокумента);
	
	ИменаРаспознанныхТаблиц = Новый Массив;
	ИменаРаспознанныхТаблиц.Добавить("Товары");
	ИменаРаспознанныхТаблиц.Добавить("Услуги");
	
	ЕстьПеремещенныеСтроки = Ложь;
	
	Для Каждого ИмяРаспознаннойТаблицы Из ИменаРаспознанныхТаблиц Цикл
		Если ПараметрыЗаполнения[ИмяРаспознаннойТаблицы].Количество()
			И ИменаТаблицДокумента.Найти(ИмяРаспознаннойТаблицы) = Неопределено Тогда
			
			Для Каждого Строка Из ПараметрыЗаполнения[ИмяРаспознаннойТаблицы] Цикл
				Строка.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
				ПараметрыЗаполнения[ИменаТаблицДокумента[0]].Добавить(Строка);
			КонецЦикла;
			
			ЕстьПеремещенныеСтроки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьПеремещенныеСтроки Тогда
		ВосстановитьПорядокСтрокПоНомеру(ПараметрыЗаполнения[ИменаТаблицДокумента[0]]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВосстановитьПорядокСтрокПоНомеру(Строки)
	
	Если Строки.Количество() <= 1 Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеСтрок = Новый Соответствие;
	МассивНомеров = Новый Массив;
	
	Для Каждого Строка Из Строки Цикл
		НомерСтроки = Строка.НомерСтроки;
		Если СоответствиеСтрок.Получить(НомерСтроки) = Неопределено Тогда
			МассивНомеров.Добавить(НомерСтроки);
		КонецЕсли;
		СоответствиеСтрок.Вставить(НомерСтроки, Строка);
	КонецЦикла;
	
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(МассивНомеров);
	Список.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	ОтсортированныеНомера = Список.ВыгрузитьЗначения();
	
	Строки.Очистить();
	Для Каждого НомерСтроки Из ОтсортированныеНомера Цикл
		Строки.Добавить(СоответствиеСтрок.Получить(НомерСтроки));
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИменаТаблицПоВидуОперации(ВидОперации, ИменаТаблиц)
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Товары")
		Или ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Товары") Тогда
		ИменаТаблиц.Добавить("Товары");
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Услуги")
		Или ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.Услуги") Тогда
		ИменаТаблиц.Добавить("Услуги");
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия")
		Или ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРеализацияТоваров.ПродажаКомиссия") Тогда
		ИменаТаблиц.Добавить("Товары");
		ИменаТаблиц.Добавить("Услуги");
	Иначе
		ВызватьИсключение НСтр("ru = 'Не определены таблицы к заполнению для вида операции'");
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыШапкиДокумента(Форма, ПараметрыЗаполнения, СоответствиеРаспознанныхРеквизитов, Документ)
	
	ЗаполняемыеРеквизиты = Новый Структура;
	ЗаполняемыеРеквизиты.Вставить("НомерВходящегоДокумента");
	ЗаполняемыеРеквизиты.Вставить("ДатаВходящегоДокумента");
	ЗаполняемыеРеквизиты.Вставить("Контрагент");
	ЗаполняемыеРеквизиты.Вставить("Организация");
	ЗаполняемыеРеквизиты.Вставить("Склад");
	ЗаполняемыеРеквизиты.Вставить("ДоговорКонтрагента");
	
	ЗаполнитьЗначенияСвойств(ЗаполняемыеРеквизиты, ПараметрыЗаполнения);
	
	ИменаРеквизитовРаспознанногоДокумента = ИменаРеквизитовШапкиРаспознанногоДокумента(Форма);
	
	УверенностиРеквизитов = Неопределено;
	ПараметрыЗаполнения.Свойство("УверенностиРеквизитовШапки", УверенностиРеквизитов);
	
	Для Каждого ЗаполняемыйРеквизит Из ЗаполняемыеРеквизиты Цикл
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, ЗаполняемыйРеквизит.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеРеквизитаФормы = Форма.Объект[ЗаполняемыйРеквизит.Ключ];
		СуществующаяСвязь = СоответствиеРаспознанныхРеквизитов.Получить(ЗаполняемыйРеквизит.Ключ);
		РеквизитРаспознанНаТекущейСтранице = Ложь;
		ИмяРеквизитаРаспознанногоДокумента = "";
		
		Если ИменаРеквизитовРаспознанногоДокумента.Свойство(ЗаполняемыйРеквизит.Ключ) Тогда
			ИмяРеквизитаРаспознанногоДокумента = ИменаРеквизитовРаспознанногоДокумента[ЗаполняемыйРеквизит.Ключ];
			РеквизитРаспознанНаТекущейСтранице = ПараметрыЗаполнения.Свойство(ИмяРеквизитаРаспознанногоДокумента)
			И ЗначениеЗаполнено(ПараметрыЗаполнения[ИмяРеквизитаРаспознанногоДокумента]);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЗначениеРеквизитаФормы) Тогда
			
			ПересвязатьДоговор = ЗаполняемыйРеквизит.Ключ = "ДоговорКонтрагента"
				И ПараметрыЗаполнения.Свойство("ДоговорКонтрагентаРаспознанныйТекст");
			
			Если СуществующаяСвязь = Неопределено Или РеквизитРаспознанНаТекущейСтранице 
				Или ПересвязатьДоговор Тогда
				
				ЗаполнятьЗначение = Истина;
				Если УверенностиРеквизитов <> Неопределено И ИмяРеквизитаРаспознанногоДокумента <> "" Тогда
					Уверенность = УверенностиРеквизитов.Получить(ИмяРеквизитаРаспознанногоДокумента);
					Если Уверенность <> Неопределено
						И Уверенность < РаспознаваниеДокументовСлужебныйКлиентСервер.ГраницаУверенныхЗначений() Тогда
						ЗаполнятьЗначение = Ложь;
					КонецЕсли;
				КонецЕсли;
				
				Если ЗаполнятьЗначение Тогда
					Форма.Объект[ЗаполняемыйРеквизит.Ключ] = ЗаполняемыйРеквизит.Значение;
				КонецЕсли;
				
				СоответствиеРаспознанныхРеквизитов.Вставить(
					ЗаполняемыйРеквизит.Ключ,
					Новый Структура("Документ, НомерСтроки", Документ, 0));
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	СуммаВключаетНДСРаспознана = Ложь;
	Если ПараметрыЗаполнения.Свойство("СуммаВключаетНДСРаспознана", СуммаВключаетНДСРаспознана)
		И СуммаВключаетНДСРаспознана
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "СуммаВключаетНДС")
		И СоответствиеРаспознанныхРеквизитов.Получить("СуммаВключаетНДС") = Неопределено Тогда
		
		Форма.Объект.СуммаВключаетНДС = ПараметрыЗаполнения.СуммаВключаетНДС;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "НДСНеВыделять") Тогда
			Форма.Объект.НДСНеВыделять = Ложь;
		КонецЕсли;
		
		СоответствиеРаспознанныхРеквизитов.Вставить("СуммаВключаетНДС",
			Новый Структура("Документ, НомерСтроки", Документ, 0));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьДокументаПакетно(Форма, ПараметрыЗаполнения, СоответствиеРаспознанныхРеквизитов, Документ, ИмяТаблицы, ТипДокумента)
	
	СтрокиТаблицы = ПараметрыЗаполнения[ИмяТаблицы];
	Если СтрокиТаблицы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипДокумента = "СчетНаОплатуПокупателю" Или ТипДокумента = "СчетНаОплатуПоставщика" Тогда
		Для Каждого Строка Из СтрокиТаблицы Цикл
			
			НоваяСтрока = Форма.Объект[ИмяТаблицы].Добавить();
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "НоменклатураИнтерактивная") Тогда
				НоваяСтрока.НоменклатураИнтерактивная = Строка.Номенклатура;
			КонецЕсли;
			
			РаспознаваниеДокументовКлиентПереопределяемый.НоменклатураПриИзмененииНаКлиентеПослеБыстрогоРаспознавания(Форма, НоваяСтрока);
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			СоответствиеРаспознанныхРеквизитов.Вставить(НоваяСтрока, Новый Структура("Документ, НомерСтроки", Документ, Строка.НомерСтроки));
			
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	МассивНовыхСтрок = Новый Массив;
	МассивПараметровОбработки = Новый Массив;
	
	Для Каждого Строка Из СтрокиТаблицы Цикл
		
		НоваяСтрока = Форма.Объект[ИмяТаблицы].Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		
		Если ТипДокумента = "ПоступлениеТоваровУслуг" Тогда
			Если ИмяТаблицы = "Товары" Тогда
				ПараметрыОбработки = ПоступлениеТоваровУслугФормыКлиент.ПодготовитьПараметрыОбработкиТоварыНоменклатураПриИзменении(Форма, НоваяСтрока);
			Иначе
				ПараметрыОбработки = ПоступлениеТоваровУслугФормыКлиент.ПодготовитьПараметрыОбработкиУслугиНоменклатураПриИзменении(Форма, НоваяСтрока);
			КонецЕсли;
		ИначеЕсли ТипДокумента = "РеализацияТоваровУслуг" Тогда
			Если ИмяТаблицы = "Товары" Тогда
				ПараметрыОбработки = РеализацияТоваровУслугФормыКлиент.ПодготовитьПараметрыОбработкиТоварыНоменклатураПриИзменении(Форма, НоваяСтрока);
			Иначе
				ПараметрыОбработки = РеализацияТоваровУслугФормыКлиент.ПодготовитьПараметрыОбработкиУслугиНоменклатураПриИзменении(Форма, НоваяСтрока);
			КонецЕсли;
		КонецЕсли;
		
		Если ИмяТаблицы = "Товары" Тогда
			ЗаполнитьПараметрыСтрокиТаблицыТовары(НоваяСтрока, ПараметрыОбработки.ДанныеСтрокиТаблицы);
		Иначе
			ЗаполнитьПараметрыСтрокиТаблицыУслуг(НоваяСтрока, ПараметрыОбработки.ДанныеСтрокиТаблицы);
		КонецЕсли;
		ЗаполнитьПараметрыОбъектаДляЗаполненияДобавленныхКолонок(Форма, ПараметрыОбработки.ДанныеОбъекта);
		
		МассивНовыхСтрок.Добавить(НоваяСтрока);
		МассивПараметровОбработки.Добавить(ПараметрыОбработки);
		
	КонецЦикла;
	
	МассивДанныхСтрок = Новый Массив;
	МассивДанныхОбъекта = Новый Массив;
	МассивСчетовУчета = Новый Массив;
	
	Для Каждого ПараметрыОбработки Из МассивПараметровОбработки Цикл
		МассивДанныхСтрок.Добавить(ПараметрыОбработки.ДанныеСтрокиТаблицы);
		МассивДанныхОбъекта.Добавить(ПараметрыОбработки.ДанныеОбъекта);
		МассивСчетовУчета.Добавить(ПараметрыОбработки.СчетаУчетаКЗаполнению);
	КонецЦикла;
	
	Если ИмяТаблицы = "Товары" Тогда
		РаспознаваниеДокументовБыстроеРаспознаваниеВызовСервера.ТоварыНоменклатураПриИзмененииНаСервереПакетно(
			МассивДанныхСтрок, МассивДанныхОбъекта, МассивСчетовУчета, ТипДокумента);
	Иначе
		РаспознаваниеДокументовБыстроеРаспознаваниеВызовСервера.УслугиНоменклатураПриИзмененииНаСервереПакетно(
			МассивДанныхСтрок, МассивДанныхОбъекта, МассивСчетовУчета, ТипДокумента);
	КонецЕсли;
	
	Для Индекс = 0 По МассивНовыхСтрок.Количество() - 1 Цикл
		ЗаполнитьЗначенияСвойств(МассивНовыхСтрок[Индекс], МассивДанныхСтрок[Индекс]);
		ЗаполнитьЗначенияСвойств(МассивНовыхСтрок[Индекс], СтрокиТаблицы[Индекс]);
		СоответствиеРаспознанныхРеквизитов.Вставить(МассивНовыхСтрок[Индекс],
			Новый Структура("Документ, НомерСтроки", Документ, СтрокиТаблицы[Индекс].НомерСтроки));
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтавкуНДСПоОбщейСтавке(Форма, ПараметрыЗаполнения, ИменаТаблиц)
	
	Объект = Форма.Объект;
	
	СтавкаНДС = Неопределено;
	ПараметрыЗаполнения.Свойство("СтавкаНДС", СтавкаНДС);
	
	Если СтавкаНДС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
		
		Для Каждого Строка Из Объект[ИмяТаблицы] Цикл
			
			Если Не ЗначениеЗаполнено(Строка.СтавкаНДС) Тогда
				Строка.СтавкаНДС = СтавкаНДС;
				ОбщегоНазначенияБПКлиент.ПересчитатьСуммуНДС(Строка, Объект.СуммаВключаетНДС);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры


Функция ИменаРеквизитовШапкиРаспознанногоДокумента(Форма)
	
	ТипДокумента = ТипДокументаИзФормы(Форма);
	
	Результат = Новый Структура;
	
	Если ТипДокумента = "ПоступлениеТоваровУслуг"
		Или ТипДокумента = "СчетНаОплатуПоставщика"
		Или ТипДокумента = "ПлатежноеПоручение" Тогда
		Результат.Вставить("Контрагент", "Продавец");
		Результат.Вставить("Организация", "ПокупательОрганизация");
	Иначе
		Результат.Вставить("Контрагент", "Покупатель");
		Результат.Вставить("Организация", "ПродавецОрганизация");
	КонецЕсли;
	
	Результат.Вставить("НомерВходящегоДокумента", "НомерДокумента");
	Результат.Вставить("ДатаВходящегоДокумента", "ДатаДокумента");
	Результат.Вставить("Склад", "Склад");
	Результат.Вставить("ДоговорКонтрагента", "Договор");
	Результат.Вставить("ИтогиВсего", "ИтогоВсего");
	Результат.Вставить("ИтогиВсегоНДС", "ИтогоСуммаНДС");
	
	Возврат Результат;
	
КонецФункции

Функция ВидыДоговоровПоТипуДокумента(Форма)

	ТипДокумента = ТипДокументаИзФормы(Форма);
	
	ВидыДоговоров = Новый Массив;
	
	Если ТипДокумента = "ПоступлениеТоваровУслуг"
		Или ТипДокумента = "СчетНаОплатуПоставщика"
		Или ТипДокумента = "ПлатежноеПоручение" Тогда
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку"));
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом"));
	Иначе
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером"));
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом"));
		ВидыДоговоров.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку"));
	КонецЕсли;
	
	Возврат ВидыДоговоров;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиТаблиц

Процедура ЗаполнитьПараметрыСтрокиТаблицыТовары(СтрокаТаблицы, ПараметрыДляЗаполнения)

	СвойстваСтроки = Новый Массив;
	
	// Общие свойства
	СвойстваСтроки.Добавить("Всего");
	СвойстваСтроки.Добавить("ИдентификаторСтроки");
	СвойстваСтроки.Добавить("АналитикаУчетаЗаполнена");
	СвойстваСтроки.Добавить("АналитикаУчета");
	
	// Поля Поступления
	СвойстваСтроки.Добавить("НадписьПоДокументу");
	СвойстваСтроки.Добавить("НадписьПоФакту");
	СвойстваСтроки.Добавить("НадписьОтклонение");
	СвойстваСтроки.Добавить("КоличествоПоДокументу");
	СвойстваСтроки.Добавить("ЦенаПоДокументу");
	СвойстваСтроки.Добавить("СуммаПоДокументу");
	СвойстваСтроки.Добавить("СуммаНДСПоДокументу");
	СвойстваСтроки.Добавить("ВсегоПоДокументу");
	СвойстваСтроки.Добавить("РНПТ");
	СвойстваСтроки.Добавить("ПодсказкаРНПТ");
	
	// Поля Реализации
	СвойстваСтроки.Добавить("АналитикаНДС");
	СвойстваСтроки.Добавить("СчетУчетаЗабалансовый");
	СвойстваСтроки.Добавить("СчетУчетаПартионный");
	СвойстваСтроки.Добавить("ПродукцияМаркируемаяДляГИСМ");
	СвойстваСтроки.Добавить("Малоценка");
	
	Для Каждого ИмяСвойства Из СвойстваСтроки Цикл
	
		Если СтрокаТаблицы.Свойство(ИмяСвойства) Тогда
			ПараметрыДляЗаполнения.Вставить(ИмяСвойства, СтрокаТаблицы[ИмяСвойства]);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыСтрокиТаблицыУслуг(СтрокаТаблицы, ПараметрыДляЗаполнения)

	СвойстваСтроки = Новый Массив;
	
	СвойстваСтроки.Добавить("Всего");
	СвойстваСтроки.Добавить("АналитикаУчетаЗаполнена");
	СвойстваСтроки.Добавить("АналитикаУчета");
	СвойстваСтроки.Добавить("ПодразделениеЗатратДоступность");
	СвойстваСтроки.Добавить("Субконто1Доступность");
	СвойстваСтроки.Добавить("Субконто2Доступность");
	СвойстваСтроки.Добавить("Субконто3Доступность");
	СвойстваСтроки.Добавить("СубконтоНУ1Доступность");
	СвойстваСтроки.Добавить("СубконтоНУ2Доступность");
	СвойстваСтроки.Добавить("СубконтоНУ3Доступность");
	СвойстваСтроки.Добавить("СчетДоходовВедетсяУчетПоНоменклатурнымГруппам");
	
	Для Каждого ИмяСвойства Из СвойстваСтроки Цикл
		
		Если СтрокаТаблицы.Свойство(ИмяСвойства) Тогда
			ПараметрыДляЗаполнения.Вставить(ИмяСвойства, СтрокаТаблицы[ИмяСвойства]);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПараметрыОбъектаДляЗаполненияДобавленныхКолонок(Знач Форма, ПараметрыОбъекта)

	Объект = Форма.Объект;
	
	Если ТипЗнч(ПараметрыОбъекта) <> Тип("Структура") Тогда
		ПараметрыОбъекта = Новый Структура;
	КонецЕсли;
	
	ОписаниеПараметров = Новый Массив;
	
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"СуммаВключаетНДС", Объект, "СуммаВключаетНДС"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"НДСВключенВСтоимость", Объект, "НДСВключенВСтоимость"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"ПлательщикНалогаНаПрибыль", Форма, "ПлательщикНалогаНаПрибыль"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"ПрименениеУСН", Форма, "ПрименениеУСН"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"ПрименениеУСНДоходы", Форма, "ПрименениеУСНДоходы"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"ПрименяетсяАУСН", Форма, "ПрименяетсяАУСН"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"СчетУчетаРасчетовСКонтрагентом", Объект, "СчетУчетаРасчетовСКонтрагентом"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"УчетАгентскогоНДС", Форма, "УчетАгентскогоНДС"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"ЕстьРасхождения", Объект, "ЕстьРасхождения"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"РаздельныйУчетНДСНаСчете19", Форма, "РаздельныйУчетНДСНаСчете19"));
	
	// Параметры для РеализацииТоваровУслуг
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"ДокументБезНДС", Объект, "ДокументБезНДС"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"ПлательщикНДФЛ", Форма, "ПлательщикНДФЛ"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"ВалютаДокумента", Объект, "ВалютаДокумента"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"ВестиУчетПоПодразделениям", Форма, "ВестиУчетПоПодразделениям"));
	ОписаниеПараметров.Добавить(Новый Структура("ИмяПараметра, Источник, ИмяСвойства", 
		"ТребуетсяСчетРасходовПоОказаниюУслуг", Форма, "ТребуетсяСчетРасходовПоОказаниюУслуг"));
	
	Для Каждого ОписаниеПараметра Из ОписаниеПараметров Цикл
		
		Источник = ОписаниеПараметра.Источник;
		ИмяСвойства = ОписаниеПараметра.ИмяСвойства;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, ИмяСвойства) Тогда
			ПараметрыОбъекта.Вставить(
				ОписаниеПараметра.ИмяПараметра, 
				Источник[ИмяСвойства]);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область УправлениеПанелью

Процедура ПоказатьПанельРаспознаваниеДокументов(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Элементы.Найти("ПанельРаспознаваниеДокументов") = Неопределено Тогда
		Форма.Подключаемый_РаспознаваниеДокументовВызовСервера("ПодключитьРаспознаваниеДокументов");
		РаспознаваниеДокументовКлиент.ПриОткрытииФормыСБалансом(Форма, Форма.СостоянияПоБалансу);
	КонецЕсли;
	
	Элементы.ПанельРаспознаваниеДокументов.Видимость = Истина;
	
	Если Элементы.ИзменитьВидимостьПодсказок.Пометка Тогда
		Форма.Подключаемый_РаспознаваниеДокументовВызовСервера("ИзменитьВидимостьПодсказок");
	КонецЕсли;
	
	Форма.ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСостояниеБаланса", 0.1, Истина);
	
КонецПроцедуры

Процедура ЗакрытьПанельРаспознаваниеДокументов(Форма)
	
	Форма.Элементы.ПанельРаспознаваниеДокументов.Видимость = Ложь;
	
КонецПроцедуры

Процедура СвернутьРазвернутьРаспознанныеФайлы(Форма)
	
	ГруппаРаспознанныеФайлыСписок = Форма.Элементы.ГруппаРаспознанныеФайлыСписок;
	
	ГруппаРаспознанныеФайлыСписок.Видимость = Не ГруппаРаспознанныеФайлыСписок.Видимость;
	
	Если ГруппаРаспознанныеФайлыСписок.Видимость Тогда
		Форма.Элементы.КнопкаВсплывающаяРаспознанныеФайлы.Картинка = БиблиотекаКартинок.СтрелкаВниз;
	Иначе
		Форма.Элементы.КнопкаВсплывающаяРаспознанныеФайлы.Картинка = БиблиотекаКартинок.СтрелкаВправо;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФайлыКОтправкеРаспознаваниеДокументов

Процедура ВыполнитьЗагрузкуФайлов(Форма, СсылкиНаФайлыИлиПараметрыДиалога)
	
	НачатьПомещениеФайловНаСервер(
		Новый ОписаниеОповещения("ПриЗавершенииПомещенияФайлов", ЭтотОбъект, Новый Структура("Форма", Форма)),
		,
		,
		СсылкиНаФайлыИлиПараметрыДиалога,
		Форма.УникальныйИдентификатор
	);
	
КонецПроцедуры

Процедура ФайлыКОтправкеРаспознаваниеДокументовУдалить(Форма)
	
	ЭлементТаблицы = Форма.Элементы.Найти("ФайлыКОтправкеРаспознаваниеДокументов");
	
	Если ЭлементТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ЭлементТаблицы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ФайлыКОтправкеРаспознаваниеДокументов.Удалить(ТекущиеДанные);
	
КонецПроцедуры

Процедура ФайлыКОтправкеРаспознаваниеДокументовПереместитьВниз(Форма)
	
	Таблица = Форма.ФайлыКОтправкеРаспознаваниеДокументов;
	
	Если Таблица.Количество() <= 1 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементТаблицы = Форма.Элементы.Найти("ФайлыКОтправкеРаспознаваниеДокументов");
	Если ЭлементТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ЭлементТаблицы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийИндекс = Таблица.Индекс(ТекущиеДанные);
	НовыйИндекс = ТекущийИндекс + 1;
	
	Если НовыйИндекс >= Таблица.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Таблица.Сдвинуть(ТекущийИндекс, 1);
	
КонецПроцедуры

Процедура ФайлыКОтправкеРаспознаваниеДокументовПереместитьВверх(Форма)
	
	Таблица = Форма.ФайлыКОтправкеРаспознаваниеДокументов;
	
	Если Таблица.Количество() <= 1 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементТаблицы = Форма.Элементы.Найти("ФайлыКОтправкеРаспознаваниеДокументов");
	Если ЭлементТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ЭлементТаблицы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийИндекс = Таблица.Индекс(ТекущиеДанные);
	НовыйИндекс = ТекущийИндекс - 1;
	
	Если НовыйИндекс < 0 Тогда
		Возврат;
	КонецЕсли;
	
	Таблица.Сдвинуть(ТекущийИндекс, -1);
	
КонецПроцедуры

Процедура ФайлыКОтправкеРаспознаваниеДокументовДобавить(Форма)
	
	ИмяТаблицы = "ФайлыКОтправкеРаспознаваниеДокументов";
	ЭлементТаблицы = Форма.Элементы.Найти(ИмяТаблицы);
	Если ЭлементТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементТаблицы.ДобавитьСтроку();

КонецПроцедуры

#КонецОбласти

#КонецОбласти
