#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализируем реквизиты формы, которые будут передаваться
	// в качестве параметров команд, расположенных в данной панели
	Организация = Параметры.Организация;
	Период = Параметры.Период;
	
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"ДокументУведомлениеОбИсчисленныхСуммахНалоговОткрытьСписок,"
		+ "ОбщаяКомандаРасчетыПоЕНС,"
		+ "ОбщаяКомандаРасчетыПоНалогамНаЕНС");
	
КонецПроцедуры

#КонецОбласти
#КонецОбласти