#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
		
	Если НаДату > '20110101' Тогда
		Возврат Перечисления.ВерсииФорматовВыгрузки.ВерсияФСГС;
	КонецЕсли;
		
КонецФункции

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",      ОписаниеТиповСтрока, "Редакция формы", 20);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2024Кв1";
	НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом Минприроды России от 15.03.2024 № 173.";
	НоваяФорма.РедакцияФормы	  = "от 15.03.2024 № 173.";
	НоваяФорма.ДатаНачалоДействия = '20240101';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

Функция ДанныеРеглОтчета(ЭкземплярРеглОтчета) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ДеревоФормИФорматов() Экспорт
	ФормыИФорматы = Новый ДеревоЗначений;
	ФормыИФорматы.Колонки.Добавить("Код");
	ФормыИФорматы.Колонки.Добавить("ДатаПриказа");
	ФормыИФорматы.Колонки.Добавить("НомерПриказа");
	ФормыИФорматы.Колонки.Добавить("ДатаНачалаДействия");
	ФормыИФорматы.Колонки.Добавить("ДатаОкончанияДействия");
	ФормыИФорматы.Колонки.Добавить("ИмяОбъекта");
	ФормыИФорматы.Колонки.Добавить("Описание");
	
	ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "607073", '20240315', "173", "ФормаОтчета2024Кв1");
	
	Возврат ФормыИФорматы;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

#Область ПечатьУстаревших

Функция СформироватьСписокЛистов(Ссылка) Экспорт 
	РеквизитыКлюча = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ВыбраннаяФорма,ИсточникОтчета,Ссылка,ДанныеОтчета");
	Если РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2012Кв1"
		Или РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2020Кв1" Тогда 
		
		Возврат СформироватьСписокЛистов_ФормаОтчета2012Кв1(РеквизитыКлюча);
	КонецЕсли;
КонецФункции

Функция СформироватьСписокЛистов_ФормаОтчета2012Кв1(РеквизитыКлюча)
	КонтекстПечати = РегламентированнаяОтчетность.КонтекстПечати(РеквизитыКлюча);
	ПечатнаяФормаМакет = РегламентированнаяОтчетность.ПустойМакетИзСписка(
		КонтекстПечати.ИмяФормы, КонтекстПечати.СписокИспользуемыхМакетов, РеквизитыКлюча.ВыбраннаяФорма + "_ФормаОтчета");
		
	ДанныеОтчета = РеквизитыКлюча.ДанныеОтчета.Получить();
	СтруктураДанныхТитульный = ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаФормаОтчета;
	
	ПечатнаяФорма = РегламентированнаяОтчетность.НоваяСтраница();
	ПечатнаяФормаОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ПечатнаяФорма.Вывести(ПечатнаяФормаМакет.ПолучитьОбласть("Титульная1"));
	ПечатнаяФорма.Вывести(ПечатнаяФормаМакет.ПолучитьОбласть("Титульная2"));
	ПечатнаяФорма.Вывести(ПечатнаяФормаМакет.ПолучитьОбласть("Титульная2"));
	РегламентированнаяОтчетность.ПоказателиВОбласти(СтруктураДанныхТитульный, ПечатнаяФорма);
	КонтекстПечати.СтруктураРеквизитовФормы.мПечатныеФормы.Добавить(ПечатнаяФорма, "Экологический отчет");
	
	ПечатнаяФорма = РегламентированнаяОтчетность.НоваяСтраница();
	МДП = Новый Массив;
	Для Инд = 1 По 16 Цикл 
		МДП.Очистить();
		Если ПечатнаяФормаМакет.Области.Найти("ОсновнаяЧасть" + Инд + "_0") = Неопределено Тогда 
			Прервать;
		КонецЕсли;
		
		ПечатнаяФорма.Вывести(ПечатнаяФормаМакет.ПолучитьОбласть("ОсновнаяЧасть" + Инд + "_0"));
		ПечатнаяФорма.Вывести(ПечатнаяФормаМакет.ПолучитьОбласть("ОсновнаяЧасть" + Инд + "_1"));
		МнгИтер = 0;
		Пока Истина Цикл 
			МнгИтер = МнгИтер + 1;
			МнгСтр = ПечатнаяФормаМакет.ПолучитьОбласть("МногострочнаяЧасть" + Инд);
			ОблУдалитьСтроку = Неопределено;
			Для Каждого Обл Из МнгСтр.Области Цикл 
				Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник
					И СтрНачинаетсяС(Обл.Имя, "УдалитьСтроку") Тогда 
					
					Обл.Текст = "";
					Обл.Гиперссылка = Ложь;
					ОблУдалитьСтроку = Обл;
				КонецЕсли;
			КонецЦикла;
			
			Если Не СтруктураДанныхТитульный.Свойство(СтрЗаменить(СтрЗаменить(ОблУдалитьСтроку.Имя, "УдалитьСтроку", ""), "_1", "_" + МнгИтер)) Тогда 
				Прервать;
			КонецЕсли;
			
			Для Каждого Обл Из МнгСтр.Области Цикл 
				Если Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник
					И Обл.СодержитЗначение = Истина Тогда 
					
					СтруктураДанныхТитульный.Свойство(СтрЗаменить(Обл.Имя, "_1", "_" + МнгИтер), Обл.Значение);
					Обл.Имя = "";
				КонецЕсли;
			КонецЦикла;
			ПечатнаяФорма.Вывести(МнгСтр);
		КонецЦикла;
		Если ПечатнаяФормаМакет.Области.Найти("ОсновнаяЧасть" + Инд + "_2") <> Неопределено Тогда 
			ПечатнаяФорма.Вывести(ПечатнаяФормаМакет.ПолучитьОбласть("ОсновнаяЧасть" + Инд + "_2"));
		КонецЕсли;
	КонецЦикла;
	РегламентированнаяОтчетность.ПоказателиВОбласти(СтруктураДанныхТитульный, ПечатнаяФорма);
	КонтекстПечати.СтруктураРеквизитовФормы.мПечатныеФормы.Добавить(ПечатнаяФорма, "Экологический отчет");
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(КонтекстПечати, , КонтекстПечати.СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	Возврат КонтекстПечати.СтруктураРеквизитовФормы.СписокПечатаемыхЛистов;
КонецФункции 

#КонецОбласти

#КонецОбласти

#КонецЕсли