#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает массив заблокированных месяцев для получения расхождений по указанной организации за заданный период.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - организация, для которой выполняется проверка.
//   ДатаНачала - Дата - начальная дата периода проверки (используется начало месяца).
//   ДатаОкончания - Дата - конечная дата периода проверки (используется конец месяца).
///
// Возвращаемое значение:
//   Массив - список периодов сверки (месяцев), которые заблокированы для получения расхождений.
//   Каждый элемент массива имеет тип Дата и соответствует началу заблокированного месяца.
//
Функция ЗаблокированныеМесяцаДляПолученияРасхождений(Организация, ДатаНачала, ДатаОкончания) Экспорт
	
	ЗаблокированныеМесяца = Новый массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",       Организация);
	Запрос.УстановитьПараметр("ДатаНачала",        НачалоМесяца(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",     КонецМесяца(ДатаОкончания));
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТаймаутБлокировки", 60); // если блокировка установлена более 60 минут, то не учитываем
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СервисСверкиРасчетовОчередьЗапросов.Организация КАК Организация,
	|	СервисСверкиРасчетовОчередьЗапросов.ПериодСверки КАК ПериодСверки
	|
	|ИЗ
	|	РегистрСведений.СервисСверкиРасчетовОчередьЗапросов КАК СервисСверкиРасчетовОчередьЗапросов
	|ГДЕ
	|	СервисСверкиРасчетовОчередьЗапросов.Организация = &Организация
	|	И СервисСверкиРасчетовОчередьЗапросов.ПериодСверки >= &ДатаНачала
	|	И СервисСверкиРасчетовОчередьЗапросов.ПериодСверки <= &ДатаОкончания
	|	И СервисСверкиРасчетовОчередьЗапросов.ЗапросОбрабатывается = ИСТИНА
	|	И РАЗНОСТЬДАТ(СервисСверкиРасчетовОчередьЗапросов.ВремяБлокировки, &ТекущаяДатаСеанса,  МИНУТА) < &ТаймаутБлокировки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодСверки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ЗаблокированныеМесяца = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПериодСверки");
	КонецЕсли;
	
	Возврат ЗаблокированныеМесяца;
	
КонецФункции
// Обновляет очередь запросов на сверку расчетов по организации за указанные периоды.
// Для каждого месяца в переданных отрезках устанавливается признак обработки запроса,
// время блокировки и, при необходимости, дата получения сведений.
//
// Параметры:
//   Организация             - СправочникСсылка.Организации - организация, для которой обновляется очередь.
//   Отрезки                 - Массив - коллекция периодов (отрезков), для которых требуется обновить очередь.
//                             Каждый элемент должен содержать поля "ДатаНачала" и "ДатаОкончания".
//   ЗапросОбрабатывается    - Булево - признак, что запрос по периоду находится в обработке.
//   ТекущаяДатаСеанса       - Дата - текущая дата сеанса, используется для установки времени блокировки и даты получения сведений.
//   ОшибкаПолученияДанных   - Булево - признак, что при получении данных произошла ошибка.
//                             Если Истина, дата получения сведений не устанавливается. По умолчанию Ложь.
//
Процедура ОбновитьОчередь(Организация, Отрезки, ЗапросОбрабатывается, ТекущаяДатаСеанса, ОшибкаПолученияДанных = Ложь) Экспорт
	
	Для Каждого Отрезок Из Отрезки Цикл
		ТекущийМесяцОтрезка  = НачалоМесяца(Отрезок.ДатаНачала);
		КонечныйМесяцОтрезка = НачалоМесяца(Отрезок.ДатаОкончания);
		
		Пока ТекущийМесяцОтрезка <= КонечныйМесяцОтрезка Цикл
			НаборЗаписей = РегистрыСведений.СервисСверкиРасчетовОчередьЗапросов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(Организация);
			НаборЗаписей.Отбор.ПериодСверки.Установить(НачалоМесяца(ТекущийМесяцОтрезка));
			
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				Запись = НаборЗаписей[0];
			Иначе
				Запись = НаборЗаписей.Добавить();
			КонецЕсли;
			Запись.Организация          = Организация;
			Запись.ПериодСверки         = НачалоМесяца(ТекущийМесяцОтрезка);
			Запись.ЗапросОбрабатывается = ЗапросОбрабатывается;
			Если Запись.ЗапросОбрабатывается Тогда
				Запись.ВремяБлокировки = ТекущаяДатаСеанса;
			Иначе
				Если Не ОшибкаПолученияДанных Тогда
					Запись.ДатаПолученияСведений = ТекущаяДатаСеанса;
				КонецЕсли;
				Запись.ВремяБлокировки       = '00010101';
			КонецЕсли;
			ТекущийМесяцОтрезка = ДобавитьМесяц(ТекущийМесяцОтрезка, 1);
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает дату актуальности расхождений по данным очереди запросов сверки расчетов.
// Функция определяет самую раннюю дату получения сведений из регистра
// "СервисСверкиРасчетовОчередьЗапросов" с учетом переданных фильтров.
//
// Параметры:
//   Организация   - СправочникСсылка.Организации 
//   ДатаНачала    - Дата - начало периода, за который анализируется очередь.
//   ДатаОкончания - Дата - окончание периода, за который анализируется очередь.
//
// Возвращаемое значение:
//   Дата - дата актуальности расхождений (минимальная "ДатаПолученияСведений" по найденным записям).
//          Если записи не найдены, возвращается пустая дата ('00010101').
//
Функция ДатаАктуальностиРасхождений(Организация, ДатаНачала, ДатаОкончания) Экспорт
	
	ДатаАктуальностиРасхождений = '00010101';
	
	ДатаОкончанияПриведенная = КонецМесяца(ДатаОкончания);
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если ДатаОкончанияПриведенная > КонецМесяца(ТекущаяДата) Тогда
		// Дата получения актуальности не позже конца текущего месяца.
		ДатаОкончанияПриведенная = КонецМесяца(ТекущаяДата);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",        Организация);
	Запрос.УстановитьПараметр("ОтборОрганизация",   ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("ДатаНачала",         НачалоМесяца(ДатаНачала));
	Запрос.УстановитьПараметр("ОтборДатаНачала",    ЗначениеЗаполнено(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",      ДатаОкончанияПриведенная);
	Запрос.УстановитьПараметр("ОтборДатаОкончания", ЗначениеЗаполнено(ДатаОкончания));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СервисСверкиРасчетовОчередьЗапросов.Организация КАК Организация,
	|	СервисСверкиРасчетовОчередьЗапросов.ДатаПолученияСведений КАК ДатаПолученияСведений
	|ИЗ
	|	РегистрСведений.СервисСверкиРасчетовОчередьЗапросов КАК СервисСверкиРасчетовОчередьЗапросов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборОрганизация
	|				ТОГДА СервисСверкиРасчетовОчередьЗапросов.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборДатаНачала
	|				ТОГДА СервисСверкиРасчетовОчередьЗапросов.ПериодСверки >= &ДатаНачала
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборДатаОкончания
	|				ТОГДА СервисСверкиРасчетовОчередьЗапросов.ПериодСверки <= &ДатаОкончания
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПолученияСведений";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаАктуальностиРасхождений = Выборка.ДатаПолученияСведений;
	КонецЕсли;
	
	Возврат ДатаАктуальностиРасхождений;
	
КонецФункции

// Проверяет наличие успешного получения результатов за доступный период сверки до конца текущего месяца.
//
// Параметры:
//  Организация - СправочникСсылка.Организации, Неопределено - организация для проверки.
//   Если не заполнена, проверка выполняется по всем организациям.
//
// Возвращаемое значение:
//  Булево - Истина, если хотя бы за один месяц периода заполнена дата получения сведений.
//
Функция ПолученыРезультатыСверки(Организация = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтборОрганизация", ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("ДатаНачала", СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов());
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ТекущаяДатаСеанса()));

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СервисСверкиРасчетовОчередьЗапросов.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.СервисСверкиРасчетовОчередьЗапросов КАК СервисСверкиРасчетовОчередьЗапросов
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &ОтборОрганизация
	|			ТОГДА СервисСверкиРасчетовОчередьЗапросов.Организация = &Организация
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И СервисСверкиРасчетовОчередьЗапросов.ПериодСверки >= &ДатаНачала
	|	И СервисСверкиРасчетовОчередьЗапросов.ПериодСверки <= &ДатаОкончания
	|	И СервисСверкиРасчетовОчередьЗапросов.ДатаПолученияСведений <> ДАТАВРЕМЯ(1, 1, 1)";

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("УстановитьДатуПолученияРасхожденийПоОрганизациям");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

// Устанавливает дату получения расхождений по организациям в регистре сведений «СервисСверкиРасчетовОчередьЗапросов»
//
// Процедура автоматически заполняет регистр сведений записями для всех организаций и периодов,
// начиная с месяца первого документа в регистре «СервисСверкиРасчетовРеестрДокументов» до текущего месяца.
// Для каждой записи устанавливается дата получения расхождений из константы «ДатаПолученияДанныхСервисаСверкиРасчетов».
// После завершения обработки константа очищается.
//
Процедура УстановитьДатуПолученияРасхожденийПоОрганизациям() Экспорт
	
	Если Не СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов() Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПолученияСведений = Константы.ДатаПолученияДанныхСервисаСверкиРасчетов.Получить();
	Если Не ЗначениеЗаполнено(ДатаПолученияСведений) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СервисСверкиРасчетовРеестрДокументов.Организация КАК Организация,
	|	МИНИМУМ(СервисСверкиРасчетовРеестрДокументов.ДатаДокумента) КАК ДатаДокумента
	|ИЗ
	|	РегистрСведений.СервисСверкиРасчетовРеестрДокументов КАК СервисСверкиРасчетовРеестрДокументов
	|ГДЕ
	|	СервисСверкиРасчетовРеестрДокументов.ДатаДокумента >= &МинимальнаяДата
	|
	|СГРУППИРОВАТЬ ПО
	|	СервисСверкиРасчетовРеестрДокументов.Организация";
	
	// Установим минимально возможную дату для заполнения, чтобы застраховаться от наличия в регистре "старых" документов.
	Запрос.УстановитьПараметр("МинимальнаяДата", '20240101');
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИмяПроцедуры = "РегистрыСведений.СервисСверкиРасчетовОчередьЗапросов.УстановитьДатуПолученияРасхожденийПоОрганизациям()";
	КонечныйМесяц = НачалоМесяца(ТекущаяДатаСеанса());
	Пока Выборка.Следующий() Цикл
		// Заполним дату получения сведений по организации, начиная с месяца первого документа в регистре расхождений.
		ТекущийМесяц = НачалоМесяца(Выборка.ДатаДокумента);
		Пока ТекущийМесяц <= КонечныйМесяц Цикл
			Попытка
				
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
				НаборЗаписей.Отбор.ПериодСверки.Установить(ТекущийМесяц);
				
				НоваяСтрока = НаборЗаписей.Добавить();
				НоваяСтрока.Организация           = Выборка.Организация;
				НоваяСтрока.ПериодСверки          = ТекущийМесяц;
				НоваяСтрока.ДатаПолученияСведений = ДатаПолученияСведений;
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
				
			Исключение
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Процедуре %1 не удалось установить идентификатор расхождения по причине:
					|%2'"), ИмяПроцедуры, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Предупреждение,
					Метаданные.РегистрыСведений.СервисСверкиРасчетовОчередьЗапросов,
					,
					ТекстСообщения);
				
			КонецПопытки;
			ТекущийМесяц = ДобавитьМесяц(ТекущийМесяц, 1);
		КонецЦикла;
	КонецЦикла;
	
	// Очистим константу
	МенеджерКонстанты = Константы.ДатаПолученияДанныхСервисаСверкиРасчетов.СоздатьМенеджерЗначения();
	МенеджерКонстанты.Значение = '00010101';
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
