
#Область ПрограммныйИнтерфейс

Процедура УстановитьПрефикс(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	//abc++ 68934 перенос из базы примера с доработками
	Использоватьabc_Автозаполнение = ПолучитьФункциональнуюОпцию("abc_ИспользоватьАвтозаполнениеДатыДокументов");
	Если НЕ Использоватьabc_Автозаполнение Тогда
		Возврат;
	КонецЕсли;
	
	abc_ДатаНачала = Константы.abc_ДатаНачалаАвтозаполненияНомера.Получить();
	Если НЕ ЗначениеЗаполнено(abc_ДатаНачала) Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник); 
	
	ПрефиксДня = "";  
	Если ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		abc_РассчитатьПрефиксРеализацияТоваровУслуг(Источник, Префикс, abc_ДатаНачала);
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.СчетФактураВыданный") И НЕ Источник.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс Тогда  //ВЛК Принцев 11.07.2025 добавил условие на отсутствие аванса
		abc_РассчитатьПрефиксСчетФактураВыданный(Источник, Префикс, abc_ДатаНачала);	
    КонецЕсли;
	//abc--
	
КонецПроцедуры

Процедура ПриЗаписиПлатежногоДокументаПеречисленияЗарплаты(Источник, Отказ, Замещение) Экспорт
	
	//abc++ 68934 перенос из базы примера с доработками
	Использоватьabc_Автозаполнение = ПолучитьФункциональнуюОпцию("abc_ИспользоватьАвтозаполнениеДатыДокументов");
	Если НЕ Использоватьabc_Автозаполнение Тогда
		Возврат;
	КонецЕсли;
	
	abc_ДатаНачала = Константы.abc_ДатаНачалаАвтозаполненияНомера.Получить();
	Если НЕ ЗначениеЗаполнено(abc_ДатаНачала) Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоИзменений = 0;
	
	Для Каждого Запись Из Источник Цикл 
		
		Если Не Отказ И Запись.Период >= abc_ДатаНачала И ЗначениеЗаполнено(Запись.СчетФактура) И ТипЗнч(Запись.СчетФактура) = Тип("ДокументСсылка.СчетФактураВыданный") И Запись.НомерСчетаФактуры <> Запись.СчетФактура.Номер
			И НЕ Запись.СчетФактура.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаАванс  //ВЛК Принцев 22.07.2025
			Тогда
			Запись.НомерСчетаФактуры = Запись.СчетФактура.Номер;
			КоличествоИзменений = КоличествоИзменений + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоИзменений > 0 Тогда
		Источник.Записать();
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура abc_РассчитатьПрефиксРеализацияТоваровУслуг(Источник, Префикс, ДатаНачала)
	
	Если Источник.Дата >= ДатаНачала Тогда
		День = СокрЛП(День(Источник.Дата));
		Если СтрДлина(День) = 1 Тогда
			День = "" + День;
		КонецЕсли;	
		Месяц = СокрЛП(Месяц(Источник.Дата));
		Если СтрДлина(Месяц) = 1 Тогда
			Месяц = "0" + Месяц;
		КонецЕсли;
		ПрефиксДня = День + "" + Месяц + "";
		Префикс = ПрефиксДня;  
	КонецЕсли;	
	
КонецПроцедуры

Процедура abc_РассчитатьПрефиксСчетФактураВыданный(Источник, Префикс, ДатаНачала)
	
	ПрефиксДня = "";		
	
	Если Источник.Дата >= ДатаНачала Тогда
		День = СокрЛП(День(Источник.Дата));
		Если СтрДлина(День) = 1 Тогда
			День = "" + День;
		КонецЕсли;	
		Месяц = СокрЛП(Месяц(Источник.Дата));
		Если СтрДлина(Месяц) = 1 Тогда
			Месяц = "0" + Месяц;
			//ИначеЕсли СтрДлина(Месяц) = 2 Тогда
			//	Месяц = "00" + Месяц;
		КонецЕсли;
		ПрефиксДня = День + "" + Месяц + "";
		Префикс = ПрефиксДня; 
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти