
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЛогинИТС = ПолучитьЛогинИТС();
	
	ВыборОрганизацийДляПодключения = Параметры.ВыборОрганизацийДляПодключения;

	ОбновитьСписокОрганизаций(Параметры.ВыбранныеОрганизации);
		
	Если ВыборОрганизацийДляПодключения Тогда
		Заголовок = НСтр("ru = 'Организации для подключения'");
		Элементы.ДекорацияПодсказка.Видимость = Истина;
		Элементы.Флажки.Видимость = Истина;
		Элементы.ФормаПодключить.Видимость = Ложь; 
		Элементы.ФормаОтключить.Видимость = Ложь;
		Элементы.ПодключенныеОрганизации.Шапка = Ложь;
		Элементы.ПодключенныеОрганизации.ТолькоПросмотр = Ложь;
		Элементы.СостояниеПодключения.Видимость = Ложь; 
		Элементы.КомандыВыбораОрганизаций.Видимость = Истина;
		Элементы.ПодключенныеОрганизацииПометка.Видимость = Истина;
	Иначе
		Элементы.Флажки.Видимость = Ложь;
		Элементы.КомандыВыбораОрганизаций.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ОповещатьФормуПодключения И ВыборОрганизацийДляПодключения Тогда
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Пометка", Истина);
		ВыбранныеОрганизации = Новый Массив;
		СписокОрганизации = ПодключенныеОрганизации.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаСписка Из СписокОрганизации Цикл
			ВыбранныеОрганизации.Добавить(СтрокаСписка.Организация);
		КонецЦикла;
		Оповестить("ВыбраныОрганизацииДляПодключенияСверки", ВыбранныеОрганизации, ВладелецФормы);
	ИначеЕсли ОповещатьФормуПодключения Тогда
		Оповестить("БизнесСеть_РегистрацияОрганизаций",, ВладелецФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "БизнесСеть_РегистрацияОрганизаций" Тогда
		ОбновитьСписокОрганизаций();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодключенныеОрганизации

&НаКлиенте
Процедура ПодключенныеОрганизацииПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПодключенныеОрганизации.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаПодключить.Доступность = ТекущиеДанные.СтатусПодключения <> 0;
	Элементы.ФормаОтключить.Доступность  = ТекущиеДанные.СтатусПодключения = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключенныеОрганизацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ПодключенныеОрганизацииДействие Тогда
		СтандартнаяОбработка = Ложь;
		ТекстВопроса = ТекстВопросаПереходаВБизнесСеть();
		
		Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияПереходаВБизнесСеть", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключить(Команда)
	
	ТекущиеДанные = Элементы.ПодключенныеОрганизации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ТекущиеДанные.Организация;
	ТребуетсяПовторноеПодключение = ТекущиеДанные.ТребуетсяПовторноеПодключение;
	ПодключитьОрганизациюНаСервере(Организация, ТребуетсяПовторноеПодключение, ТекущиеДанные.СтатусПодключения = 1 ИЛИ ТекущиеДанные.СтатусПодключения = 3);
	
КонецПроцедуры

&НаКлиенте
Процедура Отключить(Команда)
	
	ТекущиеДанные = Элементы.ПодключенныеОрганизации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ТекущиеДанные.Организация;
	СписокОрганизаций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
	
	Отказ = Ложь;
	БизнесСетьВызовСервера.ОтключитьОрганизации(СписокОрганизаций, Отказ);
	ОбновитьСписокОрганизаций();
	ОповещатьФормуПодключения = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	
	ОповещатьФормуПодключения = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	ОповещатьФормуПодключения = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьПометкуВСтрокахТабличнойЧасти(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьПометкуВСтрокахТабличнойЧасти(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьЛогинИТС()
	
	УстановитьПривилегированныйРежим(Истина);
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Логин = СервисСверкиРасчетовПереключениеЛогинаИТС.ПолучитьИдентификаторИТС();
	Иначе
		ДанныеАутентификации = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
		Если ДанныеАутентификации <> Неопределено Тогда
			Логин = ДанныеАутентификации.Логин;
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Логин;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписокОрганизаций(ВыбранныеОрганизации = Неопределено)
	
	ПодключенныеОрганизации.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодключенныеОрганизации", БизнесСеть.ПодключенныеОрганизации());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Организация КАК Организация,
	|	Организации.ТребуетсяПовторноеПодключение КАК ТребуетсяПовторноеПодключение
	|ПОМЕСТИТЬ ПодключенныеОрганизации
	|ИЗ
	|	&ПодключенныеОрганизации КАК Организации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ПодключенныеОрганизации.Организация ЕСТЬ NULL
	|				ТОГДА ""Не подключена""
	|			КОГДА ПодключенныеОрганизации.ТребуетсяПовторноеПодключение
	|				ТОГДА ""Требуется повторное подключение""
	|			ИНАЧЕ ""Подключена""
	|		КОНЕЦ КАК СТРОКА(50)) КАК Пояснение,
	|	ВЫБОР
	|		КОГДА ПодключенныеОрганизации.Организация ЕСТЬ NULL
	|				ИЛИ ПодключенныеОрганизации.ТребуетсяПовторноеПодключение
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусПодключения,
	|	Ложь КАК Пометка,
	|	""Действие по строке организации"" КАК Действие,
	|	ЕСТЬNULL(ПодключенныеОрганизации.ТребуетсяПовторноеПодключение, ЛОЖЬ) КАК ТребуетсяПовторноеПодключение
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодключенныеОрганизации КАК ПодключенныеОрганизации
	|		ПО Организации.Ссылка = ПодключенныеОрганизации.Организация
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления";
	
	Организации = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаОрганизации Из Организации Цикл
		Если СтрокаОрганизации.СтатусПодключения = 2
			И Не СтрокаОрганизации.ТребуетсяПовторноеПодключение
			И СервисСверкиРасчетов.ОрганизацияЗарегистрированаПодИнымЛогиномИТС(СтрокаОрганизации.Организация) Тогда
			
			СведенияОжидания = СервисСверкиРасчетов.СведенияОжиданияЗаявления(СтрокаОрганизации.Организация);
			
			Если СведенияОжидания = Неопределено Тогда
				
				СтрокаОрганизации.СтатусПодключения = 1; // требуется отправка заявления
				СтрокаОрганизации.Пояснение = НСтр("ru = 'Требуется отправка заявления'");
				СтрокаОрганизации.Действие  = НСтр("ru = 'Отправить заявление'");
				
			Иначе
				
				СтрокаОрганизации.СтатусПодключения = 3 ;// ожидаем обработку заявления
				СтрокаОрганизации.Пояснение = НСтр("ru = 'Ожидаем обработку заявления'");
				СтрокаОрганизации.Действие  = НСтр("ru = 'Открыть сайт повторно'");
				
			КонецЕсли;
			
		Иначе
			СтрокаОрганизации.Действие = "";
			Если СтрокаОрганизации.СтатусПодключения = 0 Тогда // организация подключена
				СервисСверкиРасчетов.УдалитьОжиданиеОбработкиЗаявления(СтрокаОрганизации.Организация);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыбранныеОрганизации) 
			И ВыбранныеОрганизации.НайтиПоЗначению(СтрокаОрганизации.Организация) <> Неопределено Тогда 
			СтрокаОрганизации.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Организации, ПодключенныеОрганизации);
	
КонецПроцедуры

&НаСервере
Процедура ПодключитьОрганизациюНаСервере(Организация, ТребуетсяПовторноеПодключение, ТребуетсяЗаявление)
	
	Если ТребуетсяПовторноеПодключение Тогда
		СписокОрганизаций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
		Отказ = Ложь;
		БизнесСетьВызовСервера.ОтключитьОрганизации(СписокОрганизаций, Отказ);
	КонецЕсли;
	
	РезультатПодключенияОрганизациюКСервису = СервисСверкиРасчетовМенеджерОбмена.РезультатПодключенияОрганизациюКСервису(Организация);
	Если Не ЗначениеЗаполнено(РезультатПодключенияОрганизациюКСервису.ТекстОшибки) Тогда
		ОбновитьСписокОрганизаций();
		ОповещатьФормуПодключения = Истина;
	ИначеЕсли ТребуетсяЗаявление Тогда 
		ТекстОшибкиДляПользователя = НСтр("ru = 'Отправьте заявление и дождитесь его обработки'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибкиДляПользователя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуВСтрокахТабличнойЧасти(НоваяПометка)

	Для Каждого СтрокаТабличнойЧасти Из ПодключенныеОрганизации Цикл
		СтрокаТабличнойЧасти.Пометка = НоваяПометка;
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Функция ТекстВопросаПереходаВБизнесСеть()

	ПолужирныйШрифт = Новый Шрифт(, , Истина);
	
	Возврат Новый ФорматированнаяСтрока(
		Новый ФорматированнаяСтрока(
		НСтр("ru = 'Заявление отправляется через 1С:Бизнес-сеть. Открыть сайт?'"), ПолужирныйШрифт),
		Символы.ПС + Символы.ПС,
		НСтр("ru = '1. Войдите под логином интернет-поддержки: '"),
		Новый ФорматированнаяСтрока(ЛогинИТС, ПолужирныйШрифт),
		Символы.ПС,
		НСтр("ru = '2. Подайте заявление по инструкции на сайте'"),
		Символы.ПС,
		НСтр("ru = '3. Дождитесь обработки заявления - до '"),
		Новый ФорматированнаяСтрока(НСтр("ru = '2 рабочих дней'"), ПолужирныйШрифт),
		Символы.ПС + Символы.ПС,
		НСтр("ru = 'После обработки заявления сверка заработает автоматически'"));
	
КонецФункции

&НаКлиенте
Процедура ПослеПодтвержденияПереходаВБизнесСеть(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПоместитьДанныеОрганизацииВХранилище(Элементы.ПодключенныеОрганизации.ТекущиеДанные.Организация);
	ДанныеОрганизации = ПолучитьИзВременногоХранилища(ДанныеОрганизацииВBase64);
	БизнесСетьСлужебныйКлиент.ОткрытьСтраницуРегистрацииОрганизации(ДанныеОрганизации);
	ОповещатьФормуПодключения = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьДанныеОрганизацииВХранилище(ТекущаяОрганизация)
	
	ДанныеОрганизацииВBase64 = 
		ПоместитьВоВременноеХранилище(
			БизнесСеть.ДанныеОрганизацииВBase64(ТекущаяОрганизация), УникальныйИдентификатор);
			
	СервисСверкиРасчетов.ЗафиксироватьПереходКОтправкеЗаявления(ТекущаяОрганизация);
	
	ОбновитьСписокОрганизаций();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ПодключенныеОрганизацииДействие");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ПодключенныеОрганизации.Действие", ВидСравненияКомпоновкиДанных.Равно, "");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

#КонецОбласти