Функция ВозвратОплатыСчет(ДокументВозврата, ПараметрыОперации, АдресРезультата) Экспорт
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументВозврата, "Организация, ВидОплаты, ДокументОснование");
	ДокументОплаты = Документы.ОплатаПлатежнойКартой.СчетНаОплату(РеквизитыОснования.ДокументОснование);
	
	Если ПараметрыОперации.СпособОплатыОнлайнЗаказы = "Эквайринг" Тогда
		Настройка = РегистрыСведений.СоответствиеНастроекИнтеграцииИнтернетЭквайринг.НастройкаИнтеграции(РеквизитыОснования.Организация, РеквизитыОснования.ВидОплаты);
	Иначе
		Настройка = РегистрыСведений.СоответствиеНастроекИнтеграцииПлатежныеСистемы.НастройкаИнтеграции(РеквизитыОснования.Организация, РеквизитыОснования.ВидОплаты);
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДокументВозврата", ДокументВозврата);
	ПараметрыПроцедуры.Вставить("ДокументОплаты",   ДокументОплаты);
	ПараметрыПроцедуры.Вставить("СпособОплатыОнлайнЗаказы", ПараметрыОперации.СпособОплатыОнлайнЗаказы);
	ПараметрыПроцедуры.Вставить("НастройкаИнтеграции", Настройка);
	
	ИнтеграцияСПлатежнымиСистемамиБП.ВозвратОплаты(ПараметрыПроцедуры, АдресРезультата);
	
	РезультатВозвратОплаты = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Возврат РезультатВозвратОплаты;
	
КонецФункции

Функция СтатусВозвратаВФоне(УникальныйИдентификатор, ДокументВозврата, СпособОплаты) Экспорт
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		УникальныйИдентификатор,
		"ИнтеграцияСПлатежнымиСистемамиБП.СтатусВозврата",
		ДокументВозврата,
		СпособОплаты);
	
КонецФункции
