#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗагрузитьЧекиНПД(Форма) Экспорт
	
	Если Не ЗначениеЗаполнено(Форма.Объект.Ссылка) Или Форма.Модифицированность Тогда
		ПараметрыВызова = Новый Структура;
		ПараметрыВызова.Вставить("ФормаВладелец", Форма);
		ОповещениеОтвет = Новый ОписаниеОповещения("ОбработкаОтветаЗаписатьДокумент", ЭтотОбъект, ПараметрыВызова);
		ПоказатьВопрос(
			ОповещениеОтвет, НСтр("ru = 'Документ должен быть записан. Записать?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ЗагрузитьЧекиНПДЗавершение(Форма);
	
КонецПроцедуры

Процедура ПриИзмененииПризнакаПолученЧекНПД(Форма) Экспорт
	
	Если Не Форма.ПолученЧекНПД И ЗначениеЗаполнено(Форма.Объект.ЧекиНПД) Тогда
		ПараметрыВызова = Новый Структура("ФормаВладелец", Форма);
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПредупреждениеОчисткаЧековНПДЗавершение", ЭтотОбъект, ПараметрыВызова);
		ПоказатьВопрос(
			ОписаниеОповещения, НСтр( "ru = 'Записать документ, очистив прикреплённые чеки НПД?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПредупреждениеОчисткаЧековНПДЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.ФормаВладелец;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Форма.ПолученЧекНПД = Истина;
	Иначе
		Чеки = Форма.Объект.ЧекиНПД;
		ФайлыКУдалению = Новый Массив;
		Для Каждого Строка Из Чеки Цикл
			Если ЗначениеЗаполнено(Строка.Файл) Тогда
				ФайлыКУдалению.Добавить(Строка.Файл);
			КонецЕсли;
		КонецЦикла;
		ИнтеграцияСПлатформойСамозанятыеБПВызовСервера.ПометитьНаУдалениеПрисоединенныеФайлыЧековНПД(ФайлыКУдалению);
		Чеки.Очистить();
		Форма.Записать();
	КонецЕсли;
	
	ИнтеграцияСПлатформойСамозанятыеФормыБПКлиентСервер.НастроитьЭлементыЧекаНПД(Форма);
	
КонецПроцедуры

Процедура ОбработкаОтветаЗаписатьДокумент(Ответ, ДополнительныеПараметры) Экспорт
	
	Форма = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ФормаВладелец");
	Если Форма <> Неопределено И Ответ = КодВозвратаДиалога.Да И Форма.Записать() Тогда
		ЗагрузитьЧекиНПДЗавершение(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьЧекиНПДЗавершение(Форма)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытиеФормыЧековСамозанятыхЗавершение", Форма);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументВладелец", Форма.Объект.Ссылка);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	ОткрытьФорму("ОбщаяФорма.ФормаЗагрузкиЧековНПД",
		ПараметрыФормы,
		Форма,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти