#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// Обработчики выгрузки конвертации БухгалтерияПредприятия 3.0.208 --> Розница 2.3.26 {62065f6f-bbe4-11f1-8424-0050569f5bf2}                                                                         
// 
// Данный модуль содержит экспортные процедуры обработчиков событий конвертации 
// и предназначен для отладки правил обмена. После отладки рекомендуется
// скопировать текст модуля в буфер обмена и импортировать его в базу
// "Конвертация данных".
//
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛЬЗУЕМЫЕ СОКРАЩЕНИЯ ИМЕН ПЕРЕМЕННЫХ (АББРЕВИАТУРЫ)
//
//  ПКО  - правило конвертации объектов
//  ПКС  - правило конвертации свойств объектов
//  ПКГС - правило конвертации группы свойств объектов
//  ПВД  - правило выгрузки данных
//  ПОД  - правило очистки данных

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБРАБОТКИ
// Данный раздел изменять запрещено.

Перем Параметры;
Перем Алгоритмы;
Перем Запросы;
Перем УзелДляОбмена;
Перем ОбщиеПроцедурыФункции;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ (ГЛОБАЛЬНЫЕ)
// В данном разделе разрешено изменять реализацию процедур.

Процедура Конвертация_ПередВыгрузкойДанных(ФайлОбмена, Отказ) Экспорт

	Запросы.ПараметрыВыгрузкиДанных.УстановитьПараметр("Ссылка", УзелДляОбмена);
	РезультатыЗапроса = Запросы.ПараметрыВыгрузкиДанных.ВыполнитьПакет();
	Параметры.Вставить("РеквизитыУзла", РезультатыЗапроса[0].Выгрузить()[0]);
	Параметры.Вставить("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());

КонецПроцедуры

Процедура Конвертация_ПередОтправкойИнформацииОбУдалении(Ссылка, Отказ) Экспорт

	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда	
		Отказ = Истина;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.БанковскиеСчета") Тогда	
		ЗаписатьВФайлУдалениеОбъекта(Ссылка, "СправочникСсылка.БанковскиеСчета", "СправочникСсылка.БанковскиеСчета");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКО_БанковскиеСчета_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	Если Источник.ВалютаДенежныхСредств <> Параметры.ВалютаРегламентированногоУчета ИЛИ СтрДлина(Источник.НомерСчета) > 20 Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПКО_ВедомостьНаВыплатуЗарплаты_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	ВыгрузитьПоПравилу(Источник.Ответственный,,,,"Пользователи");
	ВыгрузитьПоПравилу(Источник.Организация,,,,"Организации");

КонецПроцедуры

Процедура ПКО_ВедомостьНаВыплатуЗарплатыВКассу_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	ВыгрузитьПоПравилу(Источник.Ответственный,,,,"Пользователи");
	ВыгрузитьПоПравилу(Источник.Организация,,,,"Организации");

КонецПроцедуры

Процедура ПКО_Контрагенты_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	Если Источник.ЭтоГруппа Тогда
		ТолькоПолучитьУзелСсылки = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ПКО_СписаниеСРасчетногоСчета_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	ВыгрузитьПоПравилу(Источник.Ответственный,,,,"Пользователи");

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ СВОЙСТВ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКС_БанковскиеСчета_Владелец_ПередВыгрузкойСвойства_3_15(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если ТипЗнч(Источник.Владелец) = Тип("СправочникСсылка.Организации") Тогда
		ИмяПКО = "Организации";
	ИначеЕсли ТипЗнч(Источник.Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
		ИмяПКО = "Контрагенты";
	ИначеЕсли ТипЗнч(Источник.Владелец) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ИмяПКО = "ФизическиеЛица";
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ВедомостьНаВыплатуЗарплаты_Организация_ПередВыгрузкойСвойства_10_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	НеЗамещать = Истина;

КонецПроцедуры

Процедура ПКС_ВедомостьНаВыплатуЗарплаты_КодПодразделенияОрганизации_ПередВыгрузкойСвойства_13_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = Источник.ПодразделениеОрганизации.Код;

КонецПроцедуры

Процедура ПКС_ВедомостьНаВыплатуЗарплаты_Проведен_ПередВыгрузкойСвойства_14_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = НЕ Источник.ПометкаУдаления;

КонецПроцедуры

Процедура ПКС_ВедомостьНаВыплатуЗарплаты_Зарплата_ВыплаченностьЗарплаты_ПередВыгрузкойСвойства_3_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если НЕ ЗначениеЗаполнено(ОбъектКоллекции.ВыплаченностьЗарплаты) Тогда
		Значение = Перечисления.ВыплаченностьЗарплаты.НеВыплачено;
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ВедомостьНаВыплатуЗарплаты_Зарплата_СуммаВыплаты_ПередВыгрузкойСвойства_8_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = ОбъектКоллекции.СуммаВыплаты;

КонецПроцедуры

Процедура ПКС_ВедомостьНаВыплатуЗарплатыВКассу_Организация_ПередВыгрузкойСвойства_4_32(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	НеЗамещать = Истина;

КонецПроцедуры

Процедура ПКС_ВедомостьНаВыплатуЗарплатыВКассу_Проведен_ПередВыгрузкойСвойства_8_32(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = НЕ Источник.ПометкаУдаления;

КонецПроцедуры

Процедура ПКС_ВедомостьНаВыплатуЗарплатыВКассу_КодПодразделенияОрганизации_ПередВыгрузкойСвойства_9_32(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = Источник.Подразделение.Код;

КонецПроцедуры

Процедура ПКС_ВедомостьНаВыплатуЗарплатыВКассу_Зарплата_СуммаВыплаты_ПередВыгрузкойСвойства_11_32(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = ОбъектКоллекции.СуммаВыплаты;

КонецПроцедуры

Процедура ПКС_ВедомостьНаВыплатуЗарплатыВКассу_Зарплата_Сумма_ПередВыгрузкойСвойства_15_32(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = ОбъектКоллекции.Сумма;

КонецПроцедуры

Процедура ПКС_ВедомостьНаВыплатуЗарплатыВКассу_Зарплата_ОтметкаОВыплатеЗарплаты_ПередВыгрузкойСвойства_16_32(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = ОбъектКоллекции.ВыплаченностьЗарплаты;

КонецПроцедуры

Процедура ПКС_Контрагенты_КонтактнаяИнформация_ЗначенияПолей_ПередВыгрузкойСвойства_30_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = РаботаСАдресами.ПредыдущийФорматКонтактнойИнформацииXML(ОбъектКоллекции.ЗначенияПолей, Истина);

КонецПроцедуры

Процедура ПКС_Организации_ЮрФизЛицо_ПередВыгрузкойСвойства_11_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Значение = "ИндивидуальныйПредприниматель";
	Иначе
		Значение = "ЮрЛицо";
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_Организации_СпособОценкиТоваровВРознице_ПередВыгрузкойСвойства_27_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	СпособОценкиТоваровВРознице = УчетнаяПолитика.СпособОценкиТоваровВРознице(Источник.Ссылка, ТекущаяДата());
	Если СпособОценкиТоваровВРознице = Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости Тогда
		Значение = "ПоПродажнойСтоимости";
	Иначе
		Значение = "ПоСтоимостиПриобретения";
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_ЗначенияПолей_ПередВыгрузкойСвойства_33_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = РаботаСАдресами.ПредыдущийФорматКонтактнойИнформацииXML(ОбъектКоллекции.ЗначенияПолей, Истина);

КонецПроцедуры

Процедура ПКС_Пользователи_КонтактнаяИнформация_ЗначенияПолей_ПередВыгрузкойСвойства_10_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = РаботаСАдресами.ПредыдущийФорматКонтактнойИнформацииXML(ОбъектКоллекции.ЗначенияПолей, Истина);

КонецПроцедуры

Процедура ПКС_ПоступлениеНаРасчетныйСчет_Организация_ПередВыгрузкойСвойства_8_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	НеЗамещать = Истина;

КонецПроцедуры

Процедура ПКС_ПоступлениеНаРасчетныйСчет_Магазин_ПередВыгрузкойСвойства_13_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	ДокументСписаниеСРС = Источник.РасшифровкаПлатежа[0].Сделка;
	Значение = ДокументСписаниеСРС.РасшифровкаПлатежа[0].Сделка.Склад;

КонецПроцедуры

Процедура ПКС_ПоступлениеНаРасчетныйСчет_ХозяйственнаяОперация_ПередВыгрузкойСвойства_14_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = "ВозвратДенежныхСредствОтПоставщика";

КонецПроцедуры

Процедура ПКС_ПоступлениеНаРасчетныйСчет_РасшифровкаПлатежа_Сделка_ПередВыгрузкойСвойства_15_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = ОбъектКоллекции.Сделка.РасшифровкаПлатежа[0].Сделка;

КонецПроцедуры

Процедура ПКС_СписаниеСРасчетногоСчета_Организация_ПередВыгрузкойСвойства_8_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	НеЗамещать = Истина;

КонецПроцедуры

Процедура ПКС_СписаниеСРасчетногоСчета_Магазин_ПередВыгрузкойСвойства_13_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = Источник.РасшифровкаПлатежа[0].Сделка.Склад;

КонецПроцедуры

Процедура ПКС_СписаниеСРасчетногоСчета_ХозяйственнаяОперация_ПередВыгрузкойСвойства_14_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = "ОплатаПоставщику";

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КодПодразделенияОрганизации_ПередВыгрузкойСвойства_9_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоМестРаботы,
	|	Сотрудники.ТекущееПодразделение КАК ТекущееПодразделение,
	|	Сотрудники.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Сотрудник,
	|	Сотрудники.ТекущееПодразделение
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) = 1.00
	|";
	Запрос.УстановитьПараметр("ФизическоеЛицо", Источник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1.00 И Выборка.Следующий() Тогда
		Значение = Выборка.ТекущееПодразделение.Код;
	Иначе
		Значение = "";
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_ЗначенияПолей_ПередВыгрузкойСвойства_27_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = РаботаСАдресами.ПредыдущийФорматКонтактнойИнформацииXML(ОбъектКоллекции.ЗначенияПолей, Истина);

КонецПроцедуры

Процедура ПКС_ФИОФизЛиц_ФизическоеЛицо_ПередВыгрузкойСвойства_1_9(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	ИсточникДанных = Источник.ФизическоеЛицо;
	Если ТипЗнч(ИсточникДанных) = Тип("СправочникСсылка.Организации")Тогда
		ИмяПКО = "Организации";
	Иначе
		ИмяПКО = "ФизическиеЛица";
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ ГРУПП СВОЙСТВ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКГС_ВедомостьНаВыплатуЗарплаты_Зарплата_ПередОбработкойВыгрузки_2_26(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, КоллекцияОбъектов, НеЗамещать, УзелКоллекцииСвойств, НеОчищать) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.ФизическоеЛицо 				  КАК ФизическоеЛицо,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма +
	|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты КАК Сумма,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Сумма                         КАК СуммаВыплаты,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты         КАК ВыплаченностьЗарплаты,
	|	ЗарплатаКВыплатеОрганизацийЗарплата.КомпенсацияЗаЗадержкуЗарплаты КАК КомпенсацияЗаЗадержкуЗарплаты,
	|	ТекДанныеСотудников.Сотрудник.Код								  КАК ТабельныйНомер
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплаты.Зарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
	|			ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|			ТекущиеКадровыеДанныеСотрудников.ОсновноеРабочееМестоВОрганизации КАК ОсновноеРабочееМестоВОрганизации,
	|			ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости КАК ТекущийВидЗанятости
	|		ИЗ
	|			РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ГДЕ
	|			ЕСТЬNULL(ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости, ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство)) КАК ТекДанныеСотудников
	|		ПО ЗарплатаКВыплатеОрганизацийЗарплата.ФизическоеЛицо = ТекДанныеСотудников.ФизическоеЛицо
	|ГДЕ
	|	ЗарплатаКВыплатеОрганизацийЗарплата.Ссылка = &ДокументСсылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка", Источник.Ссылка);
	
	КоллекцияОбъектов = Запрос.Выполнить().Выгрузить();

КонецПроцедуры

Процедура ПКГС_ВедомостьНаВыплатуЗарплатыВКассу_Зарплата_ПередОбработкойВыгрузки_10_32(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, КоллекцияОбъектов, НеЗамещать, УзелКоллекцииСвойств, НеОчищать) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВедомостьНаВыплатуЗарплатыВКассуЗарплата.Сотрудник.Код КАК ТабельныйНомер,
	|	ВедомостьНаВыплатуЗарплатыВКассуЗарплата.Сотрудник.ФизическоеЛицо КАК ФизЛицо,
	|	СУММА(ВедомостьНаВыплатуЗарплатыВКассуЗарплата.КВыплате) КАК Сумма,
	|	СУММА(ВедомостьНаВыплатуЗарплатыВКассуЗарплата.КВыплате) КАК СуммаВыплаты,
	|	ВЫБОР
	|		КОГДА ОплатаВедомостейНаВыплатуЗарплаты.ФизическоеЛицо ЕСТЬ NULL 
	|			ТОГДА ""НеВыплачено""
	|		ИНАЧЕ ""Выплачено""
	|	КОНЕЦ КАК ВыплаченностьЗарплаты
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплатыВКассу.Зарплата КАК ВедомостьНаВыплатуЗарплатыВКассуЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты КАК ОплатаВедомостейНаВыплатуЗарплаты
	|		ПО ВедомостьНаВыплатуЗарплатыВКассуЗарплата.Ссылка = ОплатаВедомостейНаВыплатуЗарплаты.Ведомость
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыВКассуЗарплата.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьНаВыплатуЗарплатыВКассуЗарплата.Сотрудник.ФизическоеЛицо,
	|	ВедомостьНаВыплатуЗарплатыВКассуЗарплата.Сотрудник.Код,
	|	ВЫБОР
	|		КОГДА ОплатаВедомостейНаВыплатуЗарплаты.ФизическоеЛицо ЕСТЬ NULL 
	|			ТОГДА ""НеВыплачено""
	|		ИНАЧЕ ""Выплачено""
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДокументСсылка", Источник.Ссылка);
	
	КоллекцияОбъектов = Запрос.Выполнить().Выгрузить();

КонецПроцедуры

Процедура ПКГС_Контрагенты_КонтактнаяИнформация_ПередОбработкойВыгрузки_25_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, КоллекцияОбъектов, НеЗамещать, УзелКоллекцииСвойств, НеОчищать) Экспорт

	Если Источник.ЭтоГруппа Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПКГС_Пользователи_КонтактнаяИнформация_ПередОбработкойВыгрузки_5_12(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, КоллекцияОбъектов, НеЗамещать, УзелКоллекцииСвойств, НеОчищать) Экспорт

	Если Источник.ЭтоГруппа Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПКГС_ФизическиеЛица_КонтактнаяИнформация_ПередОбработкойВыгрузки_22_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, КоллекцияОбъектов, НеЗамещать, УзелКоллекцииСвойств, НеОчищать) Экспорт

	Если Источник.ЭтоГруппа Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ВЫГРУЗКИ ДАННЫХ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПВД_ДоговорыКонтрагентов_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	ВыгрузитьПоПравилу(Объект.Владелец,,,,"Контрагенты");
	Отказ = Истина;

КонецПроцедуры

Процедура ПВД_ПоступлениеНаРасчетныйСчет_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПВД_СписаниеСРасчетногоСчета_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПВД_ФИОФизЛиц_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	Если Объект.Количество() = 1.00
		И (ТипЗнч(Объект[0].ФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") ИЛИ ТипЗнч(Объект[0].ФизическоеЛицо) = Тип("СправочникСсылка.Организации"))
	Тогда
		Отказ = Ложь;
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// АЛГОРИТМЫ
// Данный раздел разрешено изменять.
// Также допустимо размещать процедуры с алгоритмами в любом из разделов выше.

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// Данный раздел изменять запрещено.

// Производит выгрузку объекта в соответствии с указанным правилом конвертации
//
// Параметры:
//  Источник				 - произвольный источник данных
//  Приемник				 - xml-узел объекта приемника
//  ВходящиеДанные			 - произвольные вспомогательные данные, передаваемые правилу
//                             для выполнения конвертации
//  ИсходящиеДанные			 - произвольные вспомогательные данные, передаваемые правилам
//                             конвертации свойств
//  ИмяПКО					 - имя правила конвертации, согласно которому осуществляется выгрузка
//
// Возвращаемое значение:
//  xml-узел ссылки или значение приемника
//
Функция ВыгрузитьПоПравилу(Источник					= Неопределено,
						   Приемник					= Неопределено,
						   ВходящиеДанные			= Неопределено,
						   ИсходящиеДанные			= Неопределено,
						   ИмяПКО					= "")
						   
	Возврат ОбщиеПроцедурыФункции.ВыгрузитьПоПравилу(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО);

КонецФункции

// Признак того, что это загрузка в информационную базу.
// 
// Возвращаемое значение:
//	Булево - Признак режима загрузки данных
// 
Функция РежимЗагрузкиДанныхВИнформационнуюБазу()
	
	Возврат ОбщиеПроцедурыФункции.РежимЗагрузкиДанныхВИнформационнуюБазу();
	
КонецФункции

// Устанавливает значение параметра "Загрузка" для свойства объекта "ОбменДанными".
//
// Параметры:
//  Объект   - объект, для которого устанавливается свойство
//  Значение - значение устанавливаемого свойства "Загрузка"
// 
Процедура УстановитьОбменДаннымиЗагрузка(Объект, Значение = Истина, Знач ОтправкаНазад = Ложь)

	ОбщиеПроцедурыФункции.УстановитьОбменДаннымиЗагрузка(Объект, Значение, ОтправкаНазад);
	
КонецПроцедуры

// Записывает объект в информационную базу.
//
// Параметры:
//	Объект - Записываемый объект.
//	Тип - Строка - Тип объекта строкой.
// 
Процедура ЗаписатьОбъектВИБ(Объект, Тип, ЗаписатьОбъект = Ложь, Знач ОтправкаНазад = Ложь)

	ОбщиеПроцедурыФункции.ЗаписатьОбъектВИБ(Объект, Тип, ЗаписатьОбъект, ОтправкаНазад);
	
КонецПроцедуры

// Отменяет проведение объекта в информационной базе.
//
// Параметры:
//	Объект - Объект для отмены проведения.
//	Тип - Строка - Тип объекта строкой.
//
Процедура ОтменитьПроведениеОбъектаВИБ(Объект, Тип, ЗаписатьОбъект = Ложь)

	ОбщиеПроцедурыФункции.ОтменитьПроведениеОбъектаВИБ(Объект, Тип, ЗаписатьОбъект);
	
КонецПроцедуры

// Выгружает регистр по отбору.
// 
// Параметры:
//	НаборЗаписейДляВыгрузки - Структура или НаборЗаписей - Отбор
//
Процедура ВыгрузитьРегистр(НаборЗаписейДляВыгрузки, 
							Правило = Неопределено, 
							ВходящиеДанные = Неопределено, 
							НеВыгружатьОбъектыПоСсылкам = Ложь, 
							ИмяПКО = "",
							ПравилоВыгрузкиДанных = Неопределено)
							
	ОбщиеПроцедурыФункции.ВыгрузитьРегистр(НаборЗаписейДляВыгрузки, Правило, ВходящиеДанные, НеВыгружатьОбъектыПоСсылкам, ИмяПКО, ПравилоВыгрузкиДанных);

КонецПроцедуры

// Устанавливает пометку удаления.
//
// Параметры:
//	Объект - Объект для установки пометки.
//	ПометкаУдаления - Булево - Флаг пометки удаления.
//	ИмяТипаОбъекта - Строка - Тип объекта строкой.
//
Процедура УстановитьПометкуУдаленияУОбъекта(Объект, ПометкаУдаления, ИмяТипаОбъекта)
	
	ОбщиеПроцедурыФункции.УстановитьПометкуУдаленияУОбъекта(Объект, ПометкаУдаления, ИмяТипаОбъекта);
	
КонецПроцедуры

// Создает в файле обмена запись об удалении объекта.
//
// Параметры:
//	Ссылка - Ссылка на удаляемый объект.
//	ТипПриемника - Строка - Содережит строковое представление типа приемника.
//	ТипИсточника - Строка - Содережит строковое представление типа источника.
// 
Процедура ЗаписатьВФайлУдалениеОбъекта(Ссылка, Знач ТипПриемника, Знач ТипИсточника)
	
	ОбщиеПроцедурыФункции.ЗаписатьВФайлУдалениеОбъекта(Ссылка, ТипПриемника, ТипИсточника);
	
КонецПроцедуры

// Добавляет в xml файл информацию о типах значения
//
// Параметры:
//	Приемник - xml-узел объекта приемника
//	Тип - Строка - выгружаемый тип
//		- Массив - содержит список выгружаемых строковых типов
//	СписокАтрибутов - Структура - Ключ содержит имя атрибута
//
Процедура ВыгрузитьИнформациюОТипах(Приемник, Тип, СписокАтрибутов = Неопределено) Экспорт
	
	ОбщиеПроцедурыФункции.ВыгрузитьИнформациюОТипах(Приемник, Тип, СписокАтрибутов);
	
КонецПроцедуры

// Регистрирует объект, созданный при выгрузке.
//
// Параметры:
//	Ссылка - Ссылка на регистрируемый объект.
// 
Процедура ЗарегистрироватьОбъектСозданныйПриВыгрузке(Ссылка)
	
	ОбщиеПроцедурыФункции.ЗарегистрироватьОбъектСозданныйПриВыгрузке(Ссылка);
	
КонецПроцедуры

// Регистрирует предупреждение в журнале регистрации.
// Если в процессе обмена данными было обращение к этой процедуре, то обмен данными остановлен не будет.
// После завершения обмена статус выполнения обмена в мониторе для пользователя будет иметь значение "Предупреждение", если не было ошибок.
//
// Параметры:
//  Предупреждение - Строка. Текст предупреждения, который надо зарегистрировать.
// Информация, предупреждения и ошибки, возникающие в процессе обмена данными регистрируются в журнале регистрации.
// 
Процедура ЗарегистрироватьПредупреждение(Предупреждение)
	
	ОбщиеПроцедурыФункции.ЗарегистрироватьПредупреждение(Предупреждение);
	
КонецПроцедуры

// Служебная. Инициализирует переменные, необходимые для отладки
//
// Параметры:
//  Владелец - Обработка КонвертацияОбъектовИнформационныхБаз
//
Процедура ПодключитьОбработкуДляОтладки(Владелец) Экспорт

	Параметры            	 = Владелец.Параметры;
	ОбщиеПроцедурыФункции	 = Владелец;
	Запросы              	 = Владелец.Запросы;
	УзелДляОбмена		 	 = Владелец.УзелДляОбмена;

КонецПроцедуры

#КонецЕсли
