
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БанкПредставление = СтрШаблон(НСтр("ru = '%1 лимит %2 руб.'"), Объект.Банк, Объект.Лимит);
	СервисОбменаСБанками = Перечисления.СервисыОбменаСБанками.ЗаявкиНаКредитПоВыписке;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
		
	СведенияОСостоянииЗаявки = Документы.ЗаявкаНаКредитПоВыписке.СведенияОСостоянииЗаявки(Объект.Ссылка);
	
	Состояние = СведенияОСостоянииЗаявки.Состояние; 
	Новое = СведенияОСостоянииЗаявки.Новое;  
	СуммаЗаявки = СведенияОСостоянииЗаявки.СуммаЗаявки;

	ЗаполнитьПодробностиПоЗаявке(СведенияОСостоянииЗаявки.ПодробностиРешения);
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Новое Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПометитьКакПрочитанное", 1, Истина);	
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаНаЗаявкуНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(СсылкаНаЗаявку); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродолжитьОформлениеКредита(Команда)
	
	ПерейтиПоНавигационнойСсылке(СсылкаНаЗаявку);
	ОткрытьСписокЗаявокПослеПеренаправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаявку(Команда)
	
	ТекстВопроса = НСтр("ru = 'Вы уверены, что хотите отменить заявку?'");
	Оповещение = Новый ОписаниеОповещения("ВопросПередОтменойЗаявкиЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура ВопросПередОтменойЗаявкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОтменитьЗаявкуНаСервере();
		КлючЗаявки = Новый Структура;
		КлючЗаявки.Вставить("Организация", Объект.Организация);
		КлючЗаявки.Вставить("ЗаявкаНаКредит", Объект.Ссылка);
		КлючЗаявки.Вставить("Банк", Объект.Банк); 
		КлючЗаявки.Вставить("СервисОбменаСБанками", СервисОбменаСБанками);

		Оповестить("ОбновленоСостояниеЗаявкиНаКредит", КлючЗаявки);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаявкуНаСервере()
	
	Состояние = Перечисления.СостоянияЗаявокНаКредит.Отменено;
	УстановитьВидимость();

	РегистрыСведений.СостояниеЗаявокНаКредит.УстановитьСостояниеЗаявкиНаКредитПоВыписке(Объект.Ссылка, Состояние); 
	ЗаявкиНаКредитПоВыписке.ОпределитьНеобходимостьРегЗаданияПолученияСтатусов(Истина);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПометитьКакПрочитанное()
		
	КлючЗаписи = Неопределено;
	СоздатьОбновитьКлючЗаписи(КлючЗаписи);
	ОповеститьОбИзменении(КлючЗаписи); 
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОбновитьКлючЗаписи(КлючЗаписи)
	
	СведенияОЗаявке = Новый Структура;
	СведенияОЗаявке.Вставить("Организация", Объект.Организация);
	СведенияОЗаявке.Вставить("ЗаявкаНаКредит", Объект.Ссылка);
	СведенияОЗаявке.Вставить("Банк", Объект.Банк);

	КлючЗаписи = РегистрыСведений.СостояниеЗаявокНаКредит.СоздатьКлючЗаписи(СведенияОЗаявке);
	РегистрыСведений.СостояниеЗаявокНаКредит.ОбновитьПризнакНовоеЗаявкиКредитПоВыписке(СведенияОЗаявке, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодробностиПоЗаявке(ПодробностиРешенияХранилище)
	
	ПодробностиРешения = Неопределено;
		
	Если ЗначениеЗаполнено(ПодробностиРешенияХранилище) Тогда 
		ПодробностиРешения = ПодробностиРешенияХранилище.Получить(); 
	КонецЕсли;
	
	ЕстьПодробности = ЗначениеЗаполнено(ПодробностиРешения) И ТипЗнч(ПодробностиРешения) = Тип("ТаблицаЗначений");
	
	Элементы.ГруппаПодробностиПоЗаявке.Видимость = ЕстьПодробности;
	
	Если Не ЕстьПодробности Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаСведений Из ПодробностиРешения Цикл
		
		Если СтрокаСведений.ВидСведений = "Пояснение" Тогда
			Пояснение = СтрокаСведений.ЗначениеСведений;
		КонецЕсли;
		Если СтрокаСведений.ВидСведений = "СсылкаВСистемеБанка" Тогда
			СсылкаНаЗаявку = СтрокаСведений.ЗначениеСведений;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	
	Отправлено = Состояние = Перечисления.СостоянияЗаявокНаКредит.Отправлено;  
	Отменено = Состояние = Перечисления.СостоянияЗаявокНаКредит.Отменено;

	Элементы.ГруппаПродолжитьОформление.Видимость = Отправлено И ЗначениеЗаполнено(СсылкаНаЗаявку);
	Элементы.Пояснение.Видимость = ЗначениеЗаполнено(Пояснение) И Не Отменено;
	Элементы.СсылкаНаЗаявку.Видимость = ЗначениеЗаполнено(СсылкаНаЗаявку) И Не Отменено;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЗаявокПослеПеренаправления() Экспорт
	
	КлючЗаявки = Новый Структура;
	КлючЗаявки.Вставить("Организация", Объект.Организация);
	КлючЗаявки.Вставить("ЗаявкаНаКредит", Объект.Ссылка);
	КлючЗаявки.Вставить("Банк", Объект.Банк); 
	КлючЗаявки.Вставить("СервисОбменаСБанками", СервисОбменаСБанками);

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СервисОбменаСБанками", СервисОбменаСБанками);
	ПараметрыОткрытия.Вставить("ОтборСервисОбменаСБанкамиИспользование", Истина);
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура("Организация", Объект.Организация));
	ПараметрыОткрытия.Вставить("ТекущаяСтрока", КлючЗаписиСостоянияЗаявки(КлючЗаявки));
	
	ОткрытьФорму("РегистрСведений.СостояниеЗаявокНаКредит.Форма.СостояниеЗаявокНаКредит", ПараметрыОткрытия,,СервисОбменаСБанками);
	Закрыть();

КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючЗаписиСостоянияЗаявки(ЗначенияКлюча) Экспорт

	Возврат РегистрыСведений.СостояниеЗаявокНаКредит.СоздатьКлючЗаписи(ЗначенияКлюча);

КонецФункции

#КонецОбласти
