
&Вместо("ПодготовитьПараметрыПроведения")
Функция Расш1_ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ, ДоговорДляОтложенногоПроведения)

	ПараметрыПроведения = Новый Структура;

	ЭтоОтложенноеПроведение = ЗначениеЗаполнено(ДоговорДляОтложенногоПроведения);

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос = Новый Запрос;

	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ЭтоОтложенноеПроведение", ЭтоОтложенноеПроведение);
	Запрос.УстановитьПараметр("ДоговорДляОтложенногоПроведения", ДоговорДляОтложенногоПроведения);

	ТекстЗапроса =

	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ПОМЕСТИТЬ ВТ_СчетаУчетаРасчетовСПоставщиками
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет
	|ПОМЕСТИТЬ ВТ_СчетаУчетаРасчетовСПокупателями
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиВал))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЗадолженностьКратко.ЕстьДебиторскаяЗадолженностьВозвратАванса) КАК ЕстьДебиторскаяЗадолженностьВозвратАванса,
	|	МАКСИМУМ(ЗадолженностьКратко.ЕстьДебиторскаяЗадолженность) КАК ЕстьДебиторскаяЗадолженность,
	|	МАКСИМУМ(ЗадолженностьКратко.ЕстьКредиторскаяЗадолженностьВозвратАванса) КАК ЕстьКредиторскаяЗадолженностьВозвратАванса,
	|	МАКСИМУМ(ЗадолженностьКратко.ЕстьКредиторскаяЗадолженность) КАК ЕстьКредиторскаяЗадолженность
	|ПОМЕСТИТЬ ВТ_ЗадолженностьКратко
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА &УсловиеДебиторскаяЗадолженностьВозвратАванса
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьДебиторскаяЗадолженностьВозвратАванса,
	|		ВЫБОР
	|			КОГДА НЕ &УсловиеДебиторскаяЗадолженностьВозвратАванса
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ЕстьДебиторскаяЗадолженность,
	|		ЛОЖЬ КАК ЕстьКредиторскаяЗадолженностьВозвратАванса,
	|		ЛОЖЬ КАК ЕстьКредиторскаяЗадолженность
	|	ИЗ
	|		Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК ТаблицаДебиторскаяЗадолженность
	|	ГДЕ
	|		ТаблицаДебиторскаяЗадолженность.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ,
	|		ЛОЖЬ,
	|		ВЫБОР
	|			КОГДА &УсловиеКредиторскаяЗадолженностьВозвратАванса
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НЕ &УсловиеКредиторскаяЗадолженностьВозвратАванса
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	ИЗ
	|		Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК ТаблицаКредиторскаяЗадолженность
	|	ГДЕ
	|		ТаблицаКредиторскаяЗадолженность.Ссылка = &Ссылка) КАК ЗадолженностьКратко
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.ВидОперации КАК ВидОперации,
	|	Реквизиты.СчетДт КАК СчетДт,
	|	Реквизиты.СубконтоДт1 КАК СубконтоДт1,
	|	Реквизиты.СубконтоДт2 КАК СубконтоДт2,
	|	Реквизиты.СубконтоДт3 КАК СубконтоДт3,
	|	Реквизиты.СчетКт КАК СчетКт,
	|	Реквизиты.СубконтоКт1 КАК СубконтоКт1,
	|	Реквизиты.СубконтоКт2 КАК СубконтоКт2,
	|	Реквизиты.СубконтоКт3 КАК СубконтоКт3,
	|	Реквизиты.СуммаКтЗадолженности КАК СуммаКтЗадолженности,
	|	Реквизиты.СуммаДтЗадолженности КАК СуммаДтЗадолженности,
	|	&ЭтоОтложенноеПроведение КАК ЭтоОтложенноеПроведение,
	|	Реквизиты.ВидАвансаЗадолженности КАК ВидАвансаЗадолженности,
	|	ЕСТЬNULL(ВТ_ЗадолженностьКратко.ЕстьДебиторскаяЗадолженность, ЛОЖЬ) КАК ЕстьДебиторскаяЗадолженность,
	|	ЕСТЬNULL(ВТ_ЗадолженностьКратко.ЕстьДебиторскаяЗадолженностьВозвратАванса, ЛОЖЬ) КАК ЕстьДебиторскаяЗадолженностьВозвратАванса,
	|	ЕСТЬNULL(ВТ_ЗадолженностьКратко.ЕстьКредиторскаяЗадолженность, ЛОЖЬ) КАК ЕстьКредиторскаяЗадолженность,
	|	ЕСТЬNULL(ВТ_ЗадолженностьКратко.ЕстьКредиторскаяЗадолженностьВозвратАванса, ЛОЖЬ) КАК ЕстьКредиторскаяЗадолженностьВозвратАванса
	|ИЗ
	|	Документ.КорректировкаДолга КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗадолженностьКратко КАК ВТ_ЗадолженностьКратко
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеДебиторскаяЗадолженностьВозвратАванса", ТекстУсловияДебиторскаяЗадолженностьВозвратАванса());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеКредиторскаяЗадолженностьВозвратАванса", ТекстУсловияКредиторскаяЗадолженностьВозвратАванса());

	Запрос.Текст = ТекстЗапроса;

	РеквизитыДокумента = Запрос.Выполнить().Выбрать();
	РеквизитыДокумента.Следующий();

	Если НЕ УчетнаяПолитика.Существует(РеквизитыДокумента.Организация, РеквизитыДокумента.Период, Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;

	Запрос.УстановитьПараметр("ВалютаРеглУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСН",
	УчетнаяПолитика.ПрименяетсяУСН(РеквизитыДокумента.Организация, РеквизитыДокумента.Период));
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСНПатент",
	УчетнаяПолитика.ПрименяетсяУСНПатент(РеквизитыДокумента.Организация, РеквизитыДокумента.Период));
	Запрос.УстановитьПараметр("ДебиторскаяЗадолженностьСделкаПустыеЗначения", 
	ОбщегоНазначенияБПВызовСервера.ПолучитьМассивПустыхЗначенийПоОписаниюТипов(
	ДокументСсылка.Метаданные().ТабличныеЧасти.ДебиторскаяЗадолженность.Реквизиты.Сделка.Тип));
	Запрос.УстановитьПараметр("КредиторскаяЗадолженностьСделкаПустыеЗначения", 
	ОбщегоНазначенияБПВызовСервера.ПолучитьМассивПустыхЗначенийПоОписаниюТипов(
	ДокументСсылка.Метаданные().ТабличныеЧасти.КредиторскаяЗадолженность.Реквизиты.Сделка.Тип));
	Запрос.УстановитьПараметр("СодержаниеПроводкиПроведениеВзаимозачета", "Взаимозачет");
	Запрос.УстановитьПараметр("СодержаниеПроводкиПереносЗадолженности", "Переуступка долга");
	Запрос.УстановитьПараметр("СодержаниеПроводкиСписаниеЗадолженности", "Списание задолженности");
	Запрос.УстановитьПараметр("Дата", РеквизитыДокумента.Период);

	НомераТаблиц = Новый Структура;

	ТекстЗапроса = ТекстЗапросаВременныеТаблицы(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРеквизиты(НомераТаблиц)
	+ ТекстЗапросаРеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаТаблицаПроведениеВзаимозачетаКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРеквизитыПереносЗадолженностиДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРеквизитыПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРеквизитыПереносЗадолженностиКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРеквизитыПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаТаблицаПереносЗадолженностиДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаТаблицаПереносЗадолженностиДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаТаблицаПереносЗадолженностиКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаТаблицаПереносЗадолженностиКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРеквизитыСписаниеЗадолженностиДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРеквизитыСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРеквизитыСписаниеЗадолженностиКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРеквизитыСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаТаблицаСписаниеЗадолженностиДебиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаТаблицаСписаниеЗадолженностиДебиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаТаблицаСписаниеЗадолженностиКредиторскаяЗадолженность(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаТаблицаСписаниеЗадолженностиКредиторскаяЗадолженностьВозвратАванса(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента)
	+ ТекстЗапросаРегистрацияОтложенныхРасчетовСКонтрагентами(НомераТаблиц, ПараметрыПроведения, РеквизитыДокумента);


	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&УсловиеДебиторскаяЗадолженностьВозвратАванса",
	ТекстУсловияДебиторскаяЗадолженностьВозвратАванса());

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&УсловиеКредиторскаяЗадолженностьВозвратАванса",
	ТекстУсловияКредиторскаяЗадолженностьВозвратАванса());

	Запрос.Текст = ТекстЗапроса;

	Результат = Запрос.ВыполнитьПакет();

	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;

	Если НЕ УчетнаяПолитика.ПлательщикНДФЛ(РеквизитыДокумента.Организация, РеквизитыДокумента.Период) Тогда

		ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП", Неопределено);
		ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП", Неопределено);

	Иначе

		Если ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженность = Неопределено Тогда
			РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП = Неопределено;
		Иначе
			РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП = 
			ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженность.Скопировать();
		КонецЕсли;

		Если ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженность = Неопределено Тогда
			РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП = Неопределено;
		Иначе
			РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП = 
			ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженность.Скопировать();
		КонецЕсли;

		Если НЕ РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов
			И НЕ РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности Тогда

			Если НЕ (РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее
				И РеквизитыДокумента.СчетДт = РеквизитыДокумента.СчетКт
				И РеквизитыДокумента.СубконтоДт1 = РеквизитыДокумента.СубконтоКт1
				И РеквизитыДокумента.СубконтоДт2 = РеквизитыДокумента.СубконтоКт2
				И РеквизитыДокумента.СубконтоДт3 = РеквизитыДокумента.СубконтоКт3
				И РеквизитыДокумента.СуммаКтЗадолженности = РеквизитыДокумента.СуммаДтЗадолженности) Тогда

				ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП", Неопределено);
				ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП", Неопределено);

			Иначе

				ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП",
				РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП);

				ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП",
				РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП);

			КонецЕсли;

		Иначе	

			ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП",
			РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьИП);

			ПараметрыПроведения.Вставить("РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП",
			РеквизитыПроведениеВзаимозачетаКредиторскаяЗадолженностьИП);

		КонецЕсли;

	КонецЕсли;	
	
	//+++
	Если ПараметрыПроведения.Реквизиты[0].Регистратор.Комментарий = "Объект создан автоматически обработкой создания корректировок долга" тогда
		Попытка	
			Для каждого стр из ПараметрыПроведения.ТаблицаПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса цикл
				стр.Ссылка = Неопределено;	
			КонецЦикла;
		Исключение
		КонецПопытки;
		Попытка	
			Для каждого стр из ПараметрыПроведения.РеквизитыПроведениеВзаимозачетаДебиторскаяЗадолженностьВозвратАванса  цикл
				стр.Регистратор = Неопределено;	
			КонецЦикла; 
		Исключение
		КонецПопытки;
	КонецЕсли;  
	//---
	
	Возврат ПараметрыПроведения;

КонецФункции
