

#Область ПрограммныйИнтерфейс

&После("ПриСозданииНаСервере")
Процедура abc_ПриСозданииНаСервере(Форма, Знач ПараметрыРазмещения)
	
	Если СписокФормДляДополнительнойОбработки().Найти(Форма.ИмяФормы) <> Неопределено Тогда
		
		ИмяПроцедуры = "Вывести%1(Форма)";
		
		Выполнить(СтрШаблон(ИмяПроцедуры, СтрЗаменить(Форма.ИмяФормы, ".", "")));  
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СписокФормДляДополнительнойОбработки()
	
	Массив = Новый Массив;
	
	Массив.Добавить("Документ.ГТДИмпорт.Форма.ФормаДокумента");
	
	Возврат Массив;
	
КонецФункции

Процедура ВывестиДокументГТДИмпортФормаФормаДокумента(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	СтруктураИменРеквизитов = abc_ГТДИмпортКлиентСервер.СтруктураИменРеквизитов();
	
	МассивРеквизитов = Новый Массив;
	//МассивРеквизитов.Добавить(Новый РеквизитФормы(СтруктураИменРеквизитов.ИмяСписка.Имя, Новый ОписаниеТипов("СписокЗначений"),,СтруктураИменРеквизитов.ИмяСписка.Заголовок));
	МассивРеквизитов.Добавить(Новый РеквизитФормы(СтруктураИменРеквизитов.ИмяРеквизита.Имя, Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг"),,СтруктураИменРеквизитов.ИмяРеквизита.Заголовок));
	МассивРеквизитов.Добавить(Новый РеквизитФормы(СтруктураИменРеквизитов.ИмяКолонки.Имя, Новый ОписаниеТипов("СправочникСсылка.КлассификаторТНВЭД"), "Объект.Разделы", СтруктураИменРеквизитов.ИмяКолонки.Заголовок));
		
	Форма.ИзменитьРеквизиты(МассивРеквизитов);
	//ЭтотОбъект[СтруктураИменРеквизитов.ИмяРеквизита.Имя].ТипЗначения = Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг");
	
	//ЗаполнитьСписокПоступлений();
	Массив = Новый Массив;
	Массив.Добавить(СтруктураИменРеквизитов.ИмяРеквизита.Имя);
	Форма.ВыполнитьПроцедуруИзВнеФормы("ЗаполнитьСписокПоступлений", Массив);
	
	
	// Не знаю нужно ли это, но перенес как в том примере который нужен клиенту
	//ЗаполнитьНомерГТД(СтруктураИменРеквизитов.ИмяРеквизита.Имя); 
	Массив = Новый Массив;
	Массив.Добавить(СтруктураИменРеквизитов.ИмяРеквизита.Имя);
	Форма.ВыполнитьПроцедуруИзВнеФормы("ЗаполнитьНомерГТД", Массив);
	
	//ЭлементГруппаНДС = Элементы.Найти("ГруппаНДС"); 
	ЭлементРазделыПошлинаВВалюте = Элементы.Найти("РазделыПошлинаВВалюте");
	ЭлементРазделы = Элементы.Найти("Разделы"); 
	ЭлементГруппаГлавное = Элементы.Найти("ГруппаГлавное");
	Если ЭлементГруппаГлавное = Неопределено ИЛИ ЭлементРазделыПошлинаВВалюте = Неопределено ИЛИ ЭлементРазделы = Неопределено Тогда 
		Возврат;	
	КонецЕсли;

	НовыйЭлемент = Элементы.Добавить(СтруктураИменРеквизитов.ИмяРеквизита.Имя, Тип("ПолеФормы"), ЭлементГруппаГлавное);
	НовыйЭлемент.Вид   = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = СтруктураИменРеквизитов.ИмяРеквизита.Имя;
	//НовыйЭлемент.КнопкаВыбора = Истина;
	
	НовыйЭлемент = Элементы.Вставить(СтруктураИменРеквизитов.ИмяКолонки.Имя, Тип("ПолеФормы"), ЭлементРазделы, ЭлементРазделыПошлинаВВалюте);
	НовыйЭлемент.Вид   = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать; 
	НовыйЭлемент.РежимВыбораИзСписка = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.Разделы." + СтруктураИменРеквизитов.ИмяКолонки.Имя;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "РазделыКодТНВЭДПриИзменении");
	
	//СписокКодовТНВЭД = ПолучитьСписокВыбора(СтруктураИменРеквизитов);
	Массив = Новый Массив;
	Массив.Добавить(СтруктураИменРеквизитов);
    СписокКодовТНВЭД = Форма.ВыполнитьФункциюИзВнеФормы("ПолучитьСписокВыбора", Массив);
	
	НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(СписокКодовТНВЭД);
		
	//ЗаполнитьКолонкуКлассификаторыТНВЭД();
	Форма.ВыполнитьПроцедуруИзВнеФормы("ЗаполнитьКолонкуКлассификаторыТНВЭД");
	
	// Поля итогов
	ЭлементГруппаРазделыГТД = Элементы.Найти("ГруппаРазделыГТД"); 
	ЭлементГруппаТоварыПоРазделу = Элементы.Найти("ГруппаТоварыПоРазделу");
	Если ЭлементГруппаРазделыГТД = Неопределено ИЛИ ЭлементГруппаТоварыПоРазделу = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяГруппа = Элементы.Вставить("abc_ГруппаРазделыИтоги", Тип("ГруппаФормы"), ЭлементГруппаРазделыГТД, ЭлементГруппаТоварыПоРазделу);
	НоваяГруппа.Заголовок = "Итоги";
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
	НоваяГруппа.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	НоваяГруппа.ЦветФона = ЦветаСтиля.ИтогиФонГруппы;
	
	//+++ 
	
	НовыйЭлемент = Элементы.Добавить("abc_ИтогТаможеннаяСтоимость", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Заголовок = "Сумма таможенной стоймости";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.Разделы.ИтогТаможеннаяСтоимость";
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	
	//---
	
	НовыйЭлемент = Элементы.Добавить("abc_ИтогСуммаПошлины", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Заголовок = "Сумма пошлины";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.Разделы.ИтогСуммаПошлины";
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	
	НовыйЭлемент = Элементы.Добавить("abc_ИтогСуммаНДС", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Заголовок = "Сумма НДС";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.Разделы.ИтогСуммаНДС";
    НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;

КонецПроцедуры

#КонецОбласти