#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализируем реквизиты формы, которые будут передаваться
	// в качестве параметров команд, расположенных в данной панели
	Организация = Параметры.Организация;
	Период = Параметры.Период;
	
	ПараметрыОпции = Новый Структура;
	ПараметрыОпции.Вставить("Организация", Организация);
	ПараметрыОпции.Вставить("Период", Период);
	
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыОпции);
	
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"ОтчетКнигаУчетаДоходовИРасходовПредпринимателяОткрыть");
	
КонецПроцедуры

#КонецОбласти
#КонецОбласти