#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	Элементы.ГруппаПереключить.Видимость = ЭтоПолноправныйПользователь;
	Элементы.ГруппаОбратитесьКАдминистратору.Видимость = Не ЭтоПолноправныйПользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		НапомнитьПозжеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьПростойИнтерфейс(Команда)
	
	ВключитьПростойИнтерфейсНаСервере();
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура НапомнитьПозжеНаСервере()
	
	КлючОбъекта = "ПредложениеИспользоватьПростойИнтерфейс";
	КлючНастройки = "ДатаПредложения";
	Значение = ТекущаяДатаСеанса();
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючНастройки, Значение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВключитьПростойИнтерфейсНаСервере()
	
	ОбщегоНазначенияБП.УстановитьРежимКомандногоИнтерфейса("ИнтерфейсТаксиПростой");
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ВРег("ДатаСменыИнтерфейса"), , ТекущаяДатаСеанса());
	
КонецПроцедуры

#КонецОбласти
