#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// Обработчики загрузки конвертации ДО КОРП 2.1 --> БП КОРП 3 {1d1503ab-bbd0-11f1-8434-0050569f252f}                                                                                                 
// 
// Данный модуль содержит экспортные процедуры обработчиков событий конвертации 
// и предназначен для отладки правил обмена. После отладки рекомендуется
// скопировать текст модуля в буфер обмена и импортировать его в базу
// "Конвертация данных".
//
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛЬЗУЕМЫЕ СОКРАЩЕНИЯ ИМЕН ПЕРЕМЕННЫХ (АББРЕВИАТУРЫ)
//
//  ПКО  - правило конвертации объектов
//  ПКС  - правило конвертации свойств объектов
//  ПКГС - правило конвертации группы свойств объектов
//  ПВД  - правило выгрузки данных
//  ПОД  - правило очистки данных

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБРАБОТКИ
// Данный раздел изменять запрещено.

Перем Параметры;
Перем Алгоритмы;
Перем Запросы;
Перем УзелДляОбмена;
Перем ОбщиеПроцедурыФункции;
Перем ТаблицаПравилВыгрузки;
Перем ТаблицаНастройкиПараметров;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ (ГЛОБАЛЬНЫЕ)
// В данном разделе разрешено изменять реализацию процедур.

Процедура Конвертация_ПриПолученииИнформацииОбУдалении(Объект, Отказ) Экспорт

	МетаданныеОбъекта = Объект.Метаданные();
	Если Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		Отказ  = Истина;
		УстановитьПометкуУдаленияУОбъекта(Объект, Истина, "Справочник");
	КонецЕсли;

КонецПроцедуры

Процедура Конвертация_ПослеПолученияИнформацииОбУзлахОбмена(УзелОбменаЗагрузкаДанных) Экспорт

	// дополним табличные части узла новыми видами документов, если необходимо, и проверим,
	// не следует ли пока прервать обмен до заполнения обязательных реквизитов
	УзелОбъект = УзелОбменаЗагрузкаДанных.ПолучитьОбъект();
	НужноЗаписатьУзел = Ложь;
	
	// заявки на оплату
	ТаблицаВидовДокументов = Параметры.ЗаявкиНаОплату.Получить();
	ТабличнаяЧасть = УзелОбъект.ПлатежныеПоручения;
	Если ТипЗнч(ТаблицаВидовДокументов) = Тип("ТаблицаЗначений") Тогда
		// дополним новыми
		Для каждого СтрокаТаблицы из ТаблицаВидовДокументов Цикл
			СтрокаТабличнойЧасти = ТабличнаяЧасть.Найти(СтрокаТаблицы.ВидДокумента_Ключ);
			Если СтрокаТабличнойЧасти = Неопределено Тогда
				СтрокаТабличнойЧасти = ТабличнаяЧасть.Добавить();
				СтрокаТабличнойЧасти.ВидДокумента_Ключ = СтрокаТаблицы.ВидДокумента_Ключ;
				НужноЗаписатьУзел = Истина;
			ИначеЕсли СтрокаТабличнойЧасти.ВидДокумента <> СтрокаТаблицы.ВидДокумента Тогда
				НужноЗаписатьУзел = Истина;
			КонецЕсли;
			СтрокаТабличнойЧасти.ВидДокумента = СтрокаТаблицы.ВидДокумента;
		КонецЦикла;
		// удалим лишнее
		НомерСтроки = 0;
		Пока НомерСтроки <= ТабличнаяЧасть.Количество() - 1 Цикл
			СтрокаТаблицы = ТаблицаВидовДокументов.Найти(ТабличнаяЧасть[НомерСтроки].ВидДокумента_Ключ);
			Если СтрокаТаблицы = Неопределено Тогда
				ТабличнаяЧасть.Удалить(НомерСтроки);
				НужноЗаписатьУзел = Истина;
			Иначе
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Параметры.Вставить("ПлатежныеПоручения", ТабличнаяЧасть.Выгрузить());
	
	// договоры
	ТаблицаВидовДокументов = Параметры.Договоры.Получить();
	ТабличнаяЧасть = УзелОбъект.Договоры;
	Если ТипЗнч(ТаблицаВидовДокументов) = Тип("ТаблицаЗначений") Тогда
		// дополним новыми
		Для каждого СтрокаТаблицы из ТаблицаВидовДокументов Цикл
			СтрокаТабличнойЧасти = ТабличнаяЧасть.Найти(СтрокаТаблицы.ВидДокумента_Ключ);
			Если СтрокаТабличнойЧасти = Неопределено Тогда
				СтрокаТабличнойЧасти = ТабличнаяЧасть.Добавить();
				СтрокаТабличнойЧасти.ВидДокумента_Ключ = СтрокаТаблицы.ВидДокумента_Ключ;
				СтрокаТабличнойЧасти.НеВыбраныЗначенияОбязательныхРеквизитов = Истина;
				НужноЗаписатьУзел = Истина;
			ИначеЕсли СтрокаТабличнойЧасти.ВидДокумента <> СтрокаТаблицы.ВидДокумента Тогда
				НужноЗаписатьУзел = Истина;
			КонецЕсли;
			СтрокаТабличнойЧасти.ВидДокумента = СтрокаТаблицы.ВидДокумента;
		КонецЦикла;
		// удалим лишнее
		НомерСтроки = 0;
		Пока НомерСтроки <= ТабличнаяЧасть.Количество() - 1 Цикл
			СтрокаТаблицы = ТаблицаВидовДокументов.Найти(ТабличнаяЧасть[НомерСтроки].ВидДокумента_Ключ);
			Если СтрокаТаблицы = Неопределено Тогда
				ТабличнаяЧасть.Удалить(НомерСтроки);
				НужноЗаписатьУзел = Истина;
			Иначе
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Параметры.Вставить("Договоры", ТабличнаяЧасть.Выгрузить());
	
	Если НужноЗаписатьУзел Тогда
		УзелОбъект.Записать();
	КонецЕсли;
	
	// возможно, на этом сеанс обмена следует прервать
	СтруктураПоиска = Новый Структура("НеВыбраныЗначенияОбязательныхРеквизитов", Истина);
	НайденныеСтроки =  УзелОбъект.Договоры.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() <> 0 Тогда
		ТекстИсключения = "Не выбраны обязательные реквизиты в правилах загрузки договоров: ";
		Разделитель = "";
		Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
			ТекстИсключения = ТекстИсключения + Разделитель + НайденнаяСтрока.ВидДокумента;
			Разделитель = "; ";
		КонецЦикла;
		ТекстИсключения = ТекстИсключения + ". Загрузка отменена";
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКО_ДоговорыПоСторонам_ПослеЗагрузкиОбъекта(ФайлОбмена, Отказ, Ссылка, Объект, ПараметрыОбъекта, ОбъектМодифицирован,
	ИмяТипаОбъекта, ОбъектНайден) Экспорт

	// стандартный обработчик - основной счет, договор и т.п.
	Объект.Заполнить(Неопределено);
	// найдем структуру со значениями реквизитов и заполним наш объект
	СтрокаВидаДокумента = Параметры.Договоры.Найти(ПараметрыОбъекта["ВидДокумента_Ключ"]);
	
	Если СтрокаВидаДокумента <> Неопределено И ЗначениеЗаполнено(СтрокаВидаДокумента.ЗначенияРеквизитов) Тогда
		ЗначенияРеквизитов = ЗначениеИзСтрокиВнутр(СтрокаВидаДокумента.ЗначенияРеквизитов);
		Если ТипЗнч(ЗначенияРеквизитов) = Тип("Структура") Тогда
			РеквизитыОбъекта = Объект.Метаданные().Реквизиты;
			Для Каждого КлючИЗначение Из ЗначенияРеквизитов Цикл
				Если РеквизитыОбъекта.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
					Объект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
				КонецЕсли;
			КонецЦИкла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПКО_ЗаявкиНаОплату_ПослеЗагрузкиОбъекта(ФайлОбмена, Отказ, Ссылка, Объект, ПараметрыОбъекта, ОбъектМодифицирован,
	ИмяТипаОбъекта, ОбъектНайден) Экспорт

	// сохраним назначение платежа, которое будет испорчено
	НазначениеПлатежа = Объект.НазначениеПлатежа;
	// стандартный обработчик - основной счет, договор и т.п.
	Объект.Заполнить(Неопределено);
	Объект.ОчередностьПлатежа = 5;
	// дадим БП установить основной договор
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(
		Объект.ДоговорКонтрагента, Объект.Контрагент, Объект.Организация);
	// найдем структуру со значениями реквизитов и дозаполним наш объект
	ПеречислениеВБюджет = Ложь;
	СтрокаВидаДокумента = Параметры.ПлатежныеПоручения.Найти(ПараметрыОбъекта["ВидДокумента_Ключ"]);
	Если СтрокаВидаДокумента <> Неопределено и ЗначениеЗаполнено(СтрокаВидаДокумента.ЗначенияРеквизитов) Тогда
		ЗначенияРеквизитов = ЗначениеИзСтрокиВнутр(СтрокаВидаДокумента.ЗначенияРеквизитов);
		Если ТипЗнч(ЗначенияРеквизитов) = Тип("Структура") Тогда
			ЗначенияРеквизитов.Свойство("ПеречислениеВБюджет", ПеречислениеВБюджет);
			РеквизитыОбъекта = Объект.Метаданные().Реквизиты;
			Для каждого КлючИЗначение из ЗначенияРеквизитов Цикл
				Если РеквизитыОбъекта.Найти(КлючИЗначение.Ключ) <> Неопределено Тогда
					Объект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
				КонецЕсли;
			КонецЦИкла;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Номер) Тогда
		Объект.УстановитьНовыйНомер();
	КонецЕсли;
	// Дополним назначение платежа, если необходимо.
	Если ПеречислениеВБюджет = Истина Тогда // так
		Объект.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		Объект.НазначениеПлатежа = НазначениеПлатежа;
	Иначе
		Если ПараметрыОбъекта["ВестиУчетПоСтатьямДДС"] Тогда // определим ставку по сумме
			Если Объект.СуммаНДС = 0 Тогда
				Объект.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
			Иначе
				СуммаНДС22 = Объект.СуммаДокумента * 22 / 122;
				Разница22 = ?(Объект.СуммаНДС - СуммаНДС22 > 0, Объект.СуммаНДС - СуммаНДС22, СуммаНДС22 - Объект.СуммаНДС);
				СуммаНДС20 = Объект.СуммаДокумента * 20 / 120;
				Разница20 = ?(Объект.СуммаНДС - СуммаНДС20 > 0, Объект.СуммаНДС - СуммаНДС20, СуммаНДС20 - Объект.СуммаНДС);
				СуммаНДС18 = Объект.СуммаДокумента * 18 / 118;
				Разница18 = ?(Объект.СуммаНДС - СуммаНДС18 > 0, Объект.СуммаНДС - СуммаНДС18, СуммаНДС18 - Объект.СуммаНДС);
				СуммаНДС10 = Объект.СуммаДокумента * 10 / 110;
				Разница10 = ?(Объект.СуммаНДС - СуммаНДС10 > 0, Объект.СуммаНДС - СуммаНДС10, СуммаНДС10 - Объект.СуммаНДС);
				СуммаНДС7 = Объект.СуммаДокумента * 7 / 107;
				Разница7 = ?(Объект.СуммаНДС - СуммаНДС7 > 0, Объект.СуммаНДС - СуммаНДС7, СуммаНДС7 - Объект.СуммаНДС);
				СуммаНДС5 = Объект.СуммаДокумента * 5 / 105;
				Разница5 = ?(Объект.СуммаНДС - СуммаНДС5 > 0, Объект.СуммаНДС - СуммаНДС5, СуммаНДС5 - Объект.СуммаНДС);
				Если Разница5 < Разница7 Тогда
					Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС5;
				ИначеЕсли Разница7 < Разница10 Тогда
					Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС7;
				ИначеЕсли Разница10 < Разница18 Тогда
					Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС10;
				ИначеЕсли Разница18 < Разница20 Тогда
					Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
				ИначеЕсли Разница20 < Разница22 Тогда
					Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
				Иначе
					Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;
				КонецЕсли;
			КонецЕсли;
		Иначе // ставка по умолчанию, сумма НДС - расчетным путем
			Объект.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;
			Объект.СуммаНДС = Окр(Объект.СуммаДокумента * 22 / 122, 2);
		КонецЕсли;
		ТекстСумма = "Сумма " + Формат(Объект.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=");
		ТекстНДС = "В т.ч. НДС "
			+ ?(ЗначениеЗаполнено(Объект.СтавкаНДС), " (" + Объект.СтавкаНДС + ") ", "")
			+ Формат(Объект.СуммаНДС, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=");
		ТекстСуммаНазначения = ТекстСумма + Символы.ПС + ТекстНДС;
		Объект.НазначениеПлатежа = НазначениеПлатежа + Символы.ПС + ТекстСуммаНазначения;
	КонецЕсли;

КонецПроцедуры

Процедура ПКО_Контрагенты_ПослеЗагрузкиОбъекта(ФайлОбмена, Отказ, Ссылка, Объект, ПараметрыОбъекта, ОбъектМодифицирован,
	ИмяТипаОбъекта, ОбъектНайден) Экспорт

	Если ПараметрыОбъекта <> Неопределено И ЗначениеЗаполнено(ПараметрыОбъекта["СтранаРегистрации"]) Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Ссылка
			|ИЗ
			|	Справочник.СтраныМира
			|ГДЕ
			|	НЕ ПометкаУдаления
			|	И Наименование ПОДОБНО &СтранаРегистрации");
		Запрос.УстановитьПараметр("СтранаРегистрации", СокрЛП(ПараметрыОбъекта["СтранаРегистрации"]));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Объект.СтранаРегистрации = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПКО_Контрагенты_ПоследовательностьПолейПоиска(НомерВариантаПоиска, СвойстваПоиска, ПараметрыОбъекта, ПрекратитьПоиск,
	СсылкаНаОбъект, УстанавливатьУОбъектаВсеСвойстваПоиска, СтрокаИменСвойствПоиска) Экспорт

	Если ЗначениеЗаполнено(СвойстваПоиска["ИНН"]) Тогда
		Если НомерВариантаПоиска = 1 Тогда
			СтрокаИменСвойствПоиска = "ИНН, КПП, Наименование, ЭтоГруппа";
			
		ИначеЕсли НомерВариантаПоиска = 2 Тогда
			СтрокаИменСвойствПоиска = "ИНН, КПП, ЭтоГруппа";
			
		Иначе
			СтрокаИменСвойствПоиска = "ИНН, Наименование, ЭтоГруппа";
			
		КонецЕсли;
	Иначе
		СтрокаИменСвойствПоиска = "Наименование, ЭтоГруппа";
	КонецЕсли;

КонецПроцедуры

Процедура ПКО_Организации_ПослеЗагрузкиОбъекта(ФайлОбмена, Отказ, Ссылка, Объект, ПараметрыОбъекта, ОбъектМодифицирован,
	ИмяТипаОбъекта, ОбъектНайден) Экспорт

	Если ЗначениеЗаполнено(Объект.Наименование)
			И Не ЗначениеЗаполнено(Объект.НаименованиеСокращенное) Тогда
		Объект.НаименованиеСокращенное = Объект.Наименование;
	КонецЕсли;

КонецПроцедуры

Процедура ПКО_Организации_ПоследовательностьПолейПоиска(НомерВариантаПоиска, СвойстваПоиска, ПараметрыОбъекта, ПрекратитьПоиск,
	СсылкаНаОбъект, УстанавливатьУОбъектаВсеСвойстваПоиска, СтрокаИменСвойствПоиска) Экспорт

	Если ЗначениеЗаполнено(СвойстваПоиска["ИНН"]) Тогда
		Если НомерВариантаПоиска = 1 Тогда
			СтрокаИменСвойствПоиска = "ИНН, КПП";
		ИначеЕсли НомерВариантаПоиска = 2 Тогда
			СтрокаИменСвойствПоиска = "ИНН, Наименование";
		Иначе
			СтрокаИменСвойствПоиска = "Наименование";
		КонецЕсли;
	Иначе
		СтрокаИменСвойствПоиска = "Наименование";
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ СВОЙСТВ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ ГРУПП СВОЙСТВ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ВЫГРУЗКИ ДАННЫХ
// В данном разделе разрешено изменять реализацию процедур.

////////////////////////////////////////////////////////////////////////////////
// АЛГОРИТМЫ
// Данный раздел разрешено изменять.
// Также допустимо размещать процедуры с алгоритмами в любом из разделов выше.

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// Данный раздел изменять запрещено.

// Производит выгрузку объекта в соответствии с указанным правилом конвертации
//
// Параметры:
//  Источник				 - произвольный источник данных
//  Приемник				 - xml-узел объекта приемника
//  ВходящиеДанные			 - произвольные вспомогательные данные, передаваемые правилу
//                             для выполнения конвертации
//  ИсходящиеДанные			 - произвольные вспомогательные данные, передаваемые правилам
//                             конвертации свойств
//  ИмяПКО					 - имя правила конвертации, согласно которому осуществляется выгрузка
//
// Возвращаемое значение:
//  xml-узел ссылки или значение приемника
//
Функция ВыгрузитьПоПравилу(Источник					= Неопределено,
						   Приемник					= Неопределено,
						   ВходящиеДанные			= Неопределено,
						   ИсходящиеДанные			= Неопределено,
						   ИмяПКО					= "")
						   
	Возврат ОбщиеПроцедурыФункции.ВыгрузитьПоПравилу(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО);

КонецФункции

// Признак того, что это загрузка в информационную базу.
// 
// Возвращаемое значение:
//	Булево - Признак режима загрузки данных
// 
Функция РежимЗагрузкиДанныхВИнформационнуюБазу()
	
	Возврат ОбщиеПроцедурыФункции.РежимЗагрузкиДанныхВИнформационнуюБазу();
	
КонецФункции

// Устанавливает значение параметра "Загрузка" для свойства объекта "ОбменДанными".
//
// Параметры:
//  Объект   - объект, для которого устанавливается свойство
//  Значение - значение устанавливаемого свойства "Загрузка"
// 
Процедура УстановитьОбменДаннымиЗагрузка(Объект, Значение = Истина, Знач ОтправкаНазад = Ложь)

	ОбщиеПроцедурыФункции.УстановитьОбменДаннымиЗагрузка(Объект, Значение, ОтправкаНазад);
	
КонецПроцедуры

// Записывает объект в информационную базу.
//
// Параметры:
//	Объект - Записываемый объект.
//	Тип - Строка - Тип объекта строкой.
// 
Процедура ЗаписатьОбъектВИБ(Объект, Тип, ЗаписатьОбъект = Ложь, Знач ОтправкаНазад = Ложь)

	ОбщиеПроцедурыФункции.ЗаписатьОбъектВИБ(Объект, Тип, ЗаписатьОбъект, ОтправкаНазад);
	
КонецПроцедуры

// Отменяет проведение объекта в информационной базе.
//
// Параметры:
//	Объект - Объект для отмены проведения.
//	Тип - Строка - Тип объекта строкой.
//
Процедура ОтменитьПроведениеОбъектаВИБ(Объект, Тип, ЗаписатьОбъект = Ложь)

	ОбщиеПроцедурыФункции.ОтменитьПроведениеОбъектаВИБ(Объект, Тип, ЗаписатьОбъект);
	
КонецПроцедуры

// Выгружает регистр по отбору.
// 
// Параметры:
//	НаборЗаписейДляВыгрузки - Структура или НаборЗаписей - Отбор
//
Процедура ВыгрузитьРегистр(НаборЗаписейДляВыгрузки, 
							Правило = Неопределено, 
							ВходящиеДанные = Неопределено, 
							НеВыгружатьОбъектыПоСсылкам = Ложь, 
							ИмяПКО = "",
							ПравилоВыгрузкиДанных = Неопределено)
							
	ОбщиеПроцедурыФункции.ВыгрузитьРегистр(НаборЗаписейДляВыгрузки, Правило, ВходящиеДанные, НеВыгружатьОбъектыПоСсылкам, ИмяПКО, ПравилоВыгрузкиДанных);

КонецПроцедуры

// Устанавливает пометку удаления.
//
// Параметры:
//	Объект - Объект для установки пометки.
//	ПометкаУдаления - Булево - Флаг пометки удаления.
//	ИмяТипаОбъекта - Строка - Тип объекта строкой.
//
Процедура УстановитьПометкуУдаленияУОбъекта(Объект, ПометкаУдаления, ИмяТипаОбъекта)
	
	ОбщиеПроцедурыФункции.УстановитьПометкуУдаленияУОбъекта(Объект, ПометкаУдаления, ИмяТипаОбъекта);
	
КонецПроцедуры

// Создает в файле обмена запись об удалении объекта.
//
// Параметры:
//	Ссылка - Ссылка на удаляемый объект.
//	ТипПриемника - Строка - Содережит строковое представление типа приемника.
//	ТипИсточника - Строка - Содережит строковое представление типа источника.
// 
Процедура ЗаписатьВФайлУдалениеОбъекта(Ссылка, Знач ТипПриемника, Знач ТипИсточника)
	
	ОбщиеПроцедурыФункции.ЗаписатьВФайлУдалениеОбъекта(Ссылка, ТипПриемника, ТипИсточника);
	
КонецПроцедуры

// Добавляет в xml файл информацию о типах значения
//
// Параметры:
//	Приемник - xml-узел объекта приемника
//	Тип - Строка - выгружаемый тип
//		- Массив - содержит список выгружаемых строковых типов
//	СписокАтрибутов - Структура - Ключ содержит имя атрибута
//
Процедура ВыгрузитьИнформациюОТипах(Приемник, Тип, СписокАтрибутов = Неопределено) Экспорт
	
	ОбщиеПроцедурыФункции.ВыгрузитьИнформациюОТипах(Приемник, Тип, СписокАтрибутов);
	
КонецПроцедуры

// Регистрирует объект, созданный при выгрузке.
//
// Параметры:
//	Ссылка - Ссылка на регистрируемый объект.
// 
Процедура ЗарегистрироватьОбъектСозданныйПриВыгрузке(Ссылка)
	
	ОбщиеПроцедурыФункции.ЗарегистрироватьОбъектСозданныйПриВыгрузке(Ссылка);
	
КонецПроцедуры

// Регистрирует предупреждение в журнале регистрации.
// Если в процессе обмена данными было обращение к этой процедуре, то обмен данными остановлен не будет.
// После завершения обмена статус выполнения обмена в мониторе для пользователя будет иметь значение "Предупреждение", если не было ошибок.
//
// Параметры:
//  Предупреждение - Строка. Текст предупреждения, который надо зарегистрировать.
// Информация, предупреждения и ошибки, возникающие в процессе обмена данными регистрируются в журнале регистрации.
// 
Процедура ЗарегистрироватьПредупреждение(Предупреждение)
	
	ОбщиеПроцедурыФункции.ЗарегистрироватьПредупреждение(Предупреждение);
	
КонецПроцедуры

// Служебная. Инициализирует переменные, необходимые для отладки
//
// Параметры:
//  Владелец - Обработка КонвертацияОбъектовИнформационныхБаз
//
Процедура ПодключитьОбработкуДляОтладки(Владелец) Экспорт

	Параметры            	 = Владелец.Параметры;
	ОбщиеПроцедурыФункции	 = Владелец;
	Запросы              	 = Владелец.Запросы;
	УзелДляОбмена		 	 = Владелец.УзелДляОбмена;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОНСТРУКТОР И ДЕСТРУКТОР ОБРАБОТКИ

Процедура Конструктор(Владелец) Экспорт

	ОбщиеПроцедурыФункции      = Владелец;
	Параметры                  = Владелец.Параметры;
	Запросы                    = Владелец.Запросы;
	Алгоритмы                  = Владелец.Алгоритмы;
	Правила                    = Владелец.Правила;
	ТаблицаПравилВыгрузки      = Владелец.ТаблицаПравилВыгрузки;
	ТаблицаНастройкиПараметров = Владелец.ТаблицаНастройкиПараметров;
	
	КомментарийПриВыгрузкеДанных = Владелец.КомментарийПриВыгрузкеДанных;
	КомментарийПриЗагрузкеДанных = Владелец.КомментарийПриЗагрузкеДанных;
	
	// переменная для универсального обмена
	Попытка
		ДатаНачала = Владелец.ДатаНачала;
	Исключение
	КонецПопытки;
	
	// переменная для универсального обмена
	Попытка
		ДатаОкончания = Владелец.ДатаОкончания;
	Исключение
	КонецПопытки;
	
	// переменная для on-line обмена
	Попытка
		ДатаВыгрузкиДанных = Владелец.ДатаВыгрузкиДанных;
	Исключение
	КонецПопытки;
	
	// переменная для on-line обмена
	Попытка
		УзелДляОбмена = Владелец.УзелДляОбмена;
	Исключение
	КонецПопытки;
	
	// Типы
	одТипСтрока                = Тип("Строка");
	одТипБулево                = Тип("Булево");
	одТипЧисло                 = Тип("Число");
	одТипДата                  = Тип("Дата");
	одТипХранилищеЗначения     = Тип("ХранилищеЗначения");
	одТипДвоичныеДанные        = Тип("ДвоичныеДанные");
	одТипВидДвиженияНакопления = Тип("ВидДвиженияНакопления");
	одТипУдалениеОбъекта       = Тип("УдалениеОбъекта");
	одТипВидСчета			   = Тип("ВидСчета");
	одТипТип                   = Тип("Тип");
	одТипСоответствие          = Тип("Соответствие");
	
	ЗначениеПустаяДата		   = Дата('00010101');
	
	// Типы узлов xml
	одТипУзлаXML_КонецЭлемента  = ТипУзлаXML.КонецЭлемента;
	одТипУзлаXML_НачалоЭлемента = ТипУзлаXML.НачалоЭлемента;
	одТипУзлаXML_Текст          = ТипУзлаXML.Текст;
	
КонецПроцедуры

Процедура Деструктор() Экспорт
	
	ОбщиеПроцедурыФункции = Неопределено;
	
КонецПроцедуры

#КонецЕсли
