//присвоить документу основания номер этого документа, с уменьшением длины
//(реализация 11 символов, счет-фактура - 12)
&После("ПриЗаписи")
Процедура бит_ПриЗаписи(Отказ)
	Если ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование.Ссылка) И ТипЗнч(ЭтотОбъект.ДокументОснование.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		ДокОсн = ЭтотОбъект.ДокументОснование.Ссылка.ПолучитьОбъект();
		Если СтрДлина(ЭтотОбъект.Номер) > 11 Тогда
			ДокОсн.Номер = Лев(ЭтотОбъект.Номер,4) + Прав(ЭтотОбъект.Номер,7);	
		Иначе 
			ДокОсн.Номер = ЭтотОбъект.Номер;
		КонецЕсли;
		ДокОсн.Записать();
	КонецЕсли;
КонецПроцедуры

//если документ основания - это РеализацияТоваровУслуг
	//если этот документ не новый (уже есть номер) И в документе основания поменяли дату
		//получаем, присваиваем номер
&Перед("ПередЗаписью")
Процедура бит_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование.Ссылка) И ТипЗнч(ЭтотОбъект.ДокументОснование.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		Если ЗначениеЗаполнено(ЭтотОбъект.Номер) И
		Формат(ЭтотОбъект.Дата,"ДФ=dd.MM.yyyy") <> Формат(ЭтотОбъект.ДокументОснование.Дата,"ДФ=dd.MM.yyyy") Тогда
			ЭтотОбъект.Номер = ПолучитьПоследнийНомер(ЭтотОбъект.ДокументОснование.Дата);					
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

//получаем запрос с последним номером на дату
	//если последний номер за дату пустой
		//присвоить пустой номер, чтоб платформа присвоила документу новый, как новому документу
	//иначе
		//присвоить последний номер за дату + 1
Функция ПолучитьПоследнийНомер(ДатаДокументОснования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СчетФактураВыданный.Номер КАК Номер
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Дата >= &Дата1
		|	И СчетФактураВыданный.Дата <= &Дата2
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаДокументОснования));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаДокументОснования));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СтрокаНомер = "";				
	Иначе					
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЧислоНомер = Число(Выборка.Номер) + 1;
		СтрокаНомер = СтрЗаменить(Строка(ЧислоНомер),Символы.НПП,"");	
	КонецЕсли;	
	
	Возврат СтрокаНомер;

КонецФункции // ()















