#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОбновитьСтатусыЗаявокНаКредитПоВыпискеВФоне", Истина);
	Методы.Вставить("ОбновитьСтатусыЗаявокНаКредитПоВыписке");
	
КонецПроцедуры

// Выполняет фоновое получение статусов заявок на кредит по выписке
//
// Параметры:
//  Параметры - Структура - параметры фонового задания
//  АдресХранилища - Строка - адрес временного хранилища, в которое будет помещен результат выполнения фонового задания
//
Процедура ОбновитьСтатусыЗаявокНаКредитПоВыпискеВФоне(Параметры, АдресХранилища) Экспорт
	
	ОбновитьСтатусыЗаявокНаКредитПоВыписке();
	
КонецПроцедуры

// Обработчик регламентного задания ОбновлениеСтатусовЗаявокНаКредитПоВыписке.
// Выполняет обновление статусов заявок на кредит по выписке.
//
Процедура ОбновитьСтатусыЗаявокНаКредитПоВыписке() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОбновлениеСтатусовЗаявокНаКредитПоВыписке);
		
	// Проверяем наличие заявок не в финальном статусе. 
	МассивЗаявокДляЗапроса = АктуальныеЗаявки();
	ПолучитьИнформациюПоЗаявкам(МассивЗаявокДляЗапроса);
	
	ОпределитьНеобходимостьРегЗаданияПолученияСтатусов(Ложь);
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Определяет настройки регламентных заданий этого подсистема.
//
// Параметры:
//  Настройки - Коллекция - Используется для описания настроек регламентных заданий
//                          этого модуля.
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбновлениеСтатусовЗаявокНаКредитПоВыписке;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;
	
КонецПроцедуры

// Заполняет соответствие имен методов их псевдонимам для вызова из очереди заданий.
// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
//
// Параметры:
//  СоответствиеИменПсевдонимам - Соответствие - 
//    * Ключ - псевдоним метода, например ОчиститьОбластьДанных.
//    * Значение - имя метода для вызова, например РаботаВМоделиСервиса.ОчиститьОбластьДанных.
//        В качестве значения можно указать Неопределено, в этом случае считается что имя 
//        совпадает с псевдонимом.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбновлениеСтатусовЗаявокНаКредитПоВыписке.ИмяМетода);
	
КонецПроцедуры

// Получает актуальную информацию по заявкам на кредит по выписке через внешний сервис и обновляет данные в регистре сведений.
//
// Параметры:
//  МассивЗаявокДляЗапроса - Массив из Структура - заявки для запроса информации. Свойства элементов:
//                           * ИдентификаторЗаявки - Строка - идентификатор заявки во внешнем сервисе
//                           * Организация - СправочникСсылка - организация
//                           * Банк - СправочникСсылка - банк
//                           * ЗаявкаНаКредитПоВыписке - ДокументСсылка.ЗаявкаНаКредитПоВыписке - ссылка на заявку
//
Процедура ПолучитьИнформациюПоЗаявкам(МассивЗаявокДляЗапроса) Экспорт
	
	СоответствиеСтатусовСостояний = Документы.ЗаявкаНаКредитПоВыписке.СоответствиеСтатусовЗаявок();

	Для Каждого Заявка Из МассивЗаявокДляЗапроса Цикл
		
		ИдентификаторЗаявки  = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Заявка.ИдентификаторЗаявки);
		РезультатВыполненияЗапроса = 
			Документы.ЗаявкаНаКредитПоВыписке.РезультатВыполненияЗапроса("applications", "GET", , ИдентификаторЗаявки);
		Если Не РезультатВыполненияЗапроса.Выполнено Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеЗаявки = Документы.ЗаявкаНаКредитПоВыписке.НовыйСтруктураЗаявки();
		Документы.ЗаявкаНаКредитПоВыписке.ЗаполнитьДанныеЗаявки(ДанныеЗаявки, РезультатВыполненияЗапроса.ТелоОтвета);
		ЗаполнитьЗначенияСвойств(ДанныеЗаявки, Заявка, "Организация, Банк, ЗаявкаНаКредитПоВыписке");
				
		Состояние = СоответствиеСтатусовСостояний[ДанныеЗаявки.Статус];
		Отказано = ?(Состояние = Перечисления.СостоянияЗаявокНаКредит.Отказано, 1, 0);
		Одобрено = ?(Состояние = Перечисления.СостоянияЗаявокНаКредит.Одобрено, 1, 0);
		
		Если ЗначениеЗаполнено(Отказано) Или ЗначениеЗаполнено(Одобрено) Тогда
			
			Параметры = Новый Структура;
			Параметры.Вставить("Организация", ДанныеЗаявки.Организация);
			Параметры.Вставить("Банк", ДанныеЗаявки.Банк);
			Параметры.Вставить("ФормаИсточник", "ПолучениеСтатусов");

			Документы.ЗаявкаНаКредитПоВыписке.ОтправитьСтатистикуПоЗаявке(Параметры,, Отказано, Одобрено);
			
		КонецЕсли;

		РегистрыСведений.СостояниеЗаявокНаКредит.ОбновитьИнформациюЗаявкиНаКредитПоВыписке(ДанныеЗаявки);
		
	КонецЦикла;
	
КонецПроцедуры

// Определяет, нужно ли ожидать сообщений от банков, и исходя из этого отключает или планирует регламентное задание.
//
//  УстановитьМинимальныйПериодПовтора - Булево - если Ложь, то период повтора увеличивается с учетом периода ранее
//                                                запущенного регламентного задания, если оно было активно.
//
Процедура ОпределитьНеобходимостьРегЗаданияПолученияСтатусов(УстановитьМинимальныйПериодПовтора) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивЗаявокДляЗапроса = АктуальныеЗаявки();
	ИспользованиеРегЗадания = МассивЗаявокДляЗапроса.Количество() > 0;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОбновлениеСтатусовЗаявокНаКредитПоВыписке);
	СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыЗадания);
	
	Для каждого РегЗадание Из СписокЗаданий Цикл
		
		ПараметрыЗадания = Новый Структура("Использование", ИспользованиеРегЗадания);
		Если ИспользованиеРегЗадания Тогда
			ТекущееРасписание = Неопределено;
			Если Не УстановитьМинимальныйПериодПовтора И РегЗадание.Использование Тогда
				ТекущееРасписание = РегЗадание.Расписание;
			КонецЕсли;
			ПараметрыЗадания.Вставить("Расписание", РасписаниеОбменаСБанком(ТекущееРасписание));
			
			РегламентныеЗаданияСервер.ИзменитьЗадание(РегЗадание, ПараметрыЗадания);
			ИспользованиеРегЗадания = Ложь;
		Иначе
			РегламентныеЗаданияСервер.УдалитьЗадание(РегЗадание);
		КонецЕсли;
	
	КонецЦикла;
	
	// Не было найдено регламентных заданий.
	Если ИспользованиеРегЗадания Тогда // добавим новое рег.задание
		
		ПараметрыЗадания.Вставить("Расписание", РасписаниеОбменаСБанком());
		НаименованиеЗадания = НСтр("ru = 'Обновление статусов заявок на кредит по выписке'");
		ПараметрыЗадания.Вставить("Наименование", НаименованиеЗадания);
		
		ПараметрыЗадания.Вставить("ИнтервалПовтораПриАварийномЗавершении",    60);
		ПараметрыЗадания.Вставить("КоличествоПовторовПриАварийномЗавершении", 3);
		ПараметрыЗадания.Вставить("Использование",                            Истина);

		РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Расписание для регламентного задания, получающего сообщения от банков.
//
// Параметры:
//  СуществующееРасписание - РасписаниеРегламентногоЗадания - нужно взять период повторения и увеличить его.
//
Функция РасписаниеОбменаСБанком(СуществующееРасписание = Неопределено)
	
	// Например, по заявке, отправленной в 08:00, будут проверяться ответы от банков в 08:15, 08:45, 09:45, 11:15, 13:15,
	// 16:15, 20:15 и далее каждые 12 часов.
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.ПериодПовтораДней = 1;
		
	Если СуществующееРасписание = Неопределено Тогда
		Расписание.ПериодПовтораВТечениеДня = 900;   // 15 минут
	ИначеЕсли СуществующееРасписание.ПериодПовтораВТечениеДня >= 14400 Тогда
		Расписание.ПериодПовтораВТечениеДня = 43200; // 12 часов
	ИначеЕсли СуществующееРасписание.ПериодПовтораВТечениеДня >= 10800 Тогда
		Расписание.ПериодПовтораВТечениеДня = 14400; // четыре часа
	ИначеЕсли СуществующееРасписание.ПериодПовтораВТечениеДня >= 7200 Тогда
		Расписание.ПериодПовтораВТечениеДня = 10800; // три часа
	ИначеЕсли СуществующееРасписание.ПериодПовтораВТечениеДня >= 5400 Тогда
		Расписание.ПериодПовтораВТечениеДня = 7200;  // два часа
	ИначеЕсли СуществующееРасписание.ПериодПовтораВТечениеДня >= 3600 Тогда
		Расписание.ПериодПовтораВТечениеДня = 5400;  // полтора часа
	ИначеЕсли СуществующееРасписание.ПериодПовтораВТечениеДня >= 1800 Тогда
		Расписание.ПериодПовтораВТечениеДня = 3600;  // час
	Иначе
		Расписание.ПериодПовтораВТечениеДня = 1800;  // полчаса
	КонецЕсли;
	
	ШаблонДат = Новый Массив(12);
	Для инд = 0 По 11 Цикл
		ШаблонДат[инд] = инд + 1;
	КонецЦикла;
	Расписание.Месяцы = ШаблонДат;
	ШаблонДат = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ШаблонДат);
	Для инд = 7 По 11 Цикл
		ШаблонДат.Удалить(7);
	КонецЦикла;
	Расписание.ДниНедели = ШаблонДат;
	
	// Для избежания запуска рег.задания сразу после записи с новым расписанием.
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
        // Пользуемся особенностью расписания, что [ВремяНачала=14:00 + ВремяКонца=13:00] означает переход через сутки.
		Если ОбщегоНазначения.ИнформационнаяБазаФайловая(СтрокаСоединенияИнформационнойБазы()) Тогда // файловая база
			// Если запуск не произошел сразу после записи нового расписания, то он будет уже по расписанию.
			// Поэтому достаточно отсрочить его на минуту.
			ГраницаВремени = ТекущаяДата() + 60; // граница определяется на основании времени сервера
			Расписание.ВремяНачала = ГраницаВремени - (НачалоДня(ГраницаВремени) - '00010101');
			ГраницаВремени = ГраницаВремени - 61;
			Расписание.ВремяКонца = ГраницаВремени - (НачалоДня(ГраницаВремени) - '00010101');

		Иначе // серверная база
			// Нужно предотвратить запуск до момента, определяемого периодичностью расписания.
			// Поэтому четко отсрочиваем запуск (указываем время начала) не ранее истечения очередного периода.
			ГраницаВремени = ТекущаяДата() + Расписание.ПериодПовтораВТечениеДня; // граница определяется на основании времени сервера
			Расписание.ВремяНачала = ГраницаВремени - (НачалоДня(ГраницаВремени) - '00010101');
			ГраницаВремени = ГраницаВремени - (Расписание.ПериодПовтораВТечениеДня + 1);
			Расписание.ВремяКонца = ГраницаВремени - (НачалоДня(ГраницаВремени) - '00010101');

		КонецЕсли;
		
	Иначе // в режиме сервиса действует механизм очереди заданий

		Расписание.ВремяНачала = Неопределено;
		Расписание.ВремяКонца = Неопределено;
		
	КонецЕсли;

	Возврат Расписание;
	
КонецФункции

// Определяет доступность сервиса.
//
// Возвращаемое значение:
//  Булево - Истина, если сервис доступен, иначе Ложь.
//
Функция СервисДоступен() Экспорт
	Возврат ОбщегоНазначения.РазделениеВключено();
КонецФункции

// Возвращает актуальные заявки на кредит.
//
// Возвращаемое значение:
//  Массив - массив ссылок на заявки на кредит.
//
Функция АктуальныеЗаявки()
	
	МассивЗаявок = Новый Массив;
	
	МассивСостояний = Новый Массив;
	МассивСостояний.Добавить(Перечисления.СостоянияЗаявокНаКредит.Одобрено);
	МассивСостояний.Добавить(Перечисления.СостоянияЗаявокНаКредит.Отказано);
	МассивСостояний.Добавить(Перечисления.СостоянияЗаявокНаКредит.Черновик);
	МассивСостояний.Добавить(Перечисления.СостоянияЗаявокНаКредит.Отменено);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостояниеЗаявокНаКредит.ЗаявкаНаКредит КАК ЗаявкаНаКредитПоВыписке,
		|	СостояниеЗаявокНаКредит.Организация КАК Организация,
		|	СостояниеЗаявокНаКредит.Банк КАК Банк,
		|	СостояниеЗаявокНаКредит.ИдентификаторЗаявки КАК ИдентификаторЗаявки
		|ИЗ
		|	РегистрСведений.СостояниеЗаявокНаКредит КАК СостояниеЗаявокНаКредит
		|ГДЕ
		|	СостояниеЗаявокНаКредит.СервисОбменаСБанками = ЗНАЧЕНИЕ(Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредитПоВыписке)
		|	И СостояниеЗаявокНаКредит.СрокАктуальности >= &Дата
		|	И НЕ СостояниеЗаявокНаКредит.Состояние В (&МассивСостояний)";
	
	Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний); 
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДатаСеанса()));

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураЗаявки = НовыйСтруктураДанныхЗаявки();
		ЗаполнитьЗначенияСвойств(СтруктураЗаявки, Выборка);
		МассивЗаявок.Добавить(СтруктураЗаявки);
	КонецЦикла;
	
	Возврат МассивЗаявок;
	
КонецФункции

// Возвращает структуру данных заявки на кредит.
//
// Возвращаемое значение:
//  Структура - структура данных заявки на кредит.
//
Функция НовыйСтруктураДанныхЗаявки()
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторЗаявки", "");
	Результат.Вставить("Банк", Справочники.Банки.ПустаяСсылка());
	Результат.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Результат.Вставить("ЗаявкаНаКредитПоВыписке", Документы.ЗаявкаНаКредитПоВыписке.ПустаяСсылка());
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли