
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОткрытиеЧерновика = Объект.СуммаДокумента <> 0;
	ЗаполнитьПараметрыПоОрганизации(ОткрытиеЧерновика);
	ПериодСтрокой = СтрШаблон(НСтр("ru = 'последние %1 месяца'"), 
		Документы.ЗаявкаНаКредитПоВыписке.КоличествоМесяцевВыборкиДокументов());
	СервисОбменаСБанками = Перечисления.СервисыОбменаСБанками.ЗаявкиНаКредитПоВыписке;
	ФормаИсточник = ИмяФормы;
	Если ЗначениеЗаполнено(Параметры.ИмяФормы) Тогда
		ФормаИсточник = Параметры.ИмяФормы;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьСтраницы(Элементы.Заявка);
	ПодключитьОбработчикОжидания("Подключаемый_ПолучитьПредложенияБанков", 0.5, Истина);
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОтправитьСтатистику", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновленоСостояниеЗаявкиНаКредит");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Отбор = Новый Структура("Пометка", Истина);
	ТаблицаВыбранныхДокументов = ТаблицаБанковскихДокументов.Выгрузить(Отбор);
	ТекущийОбъект.БанковскиеДокументы.Загрузить(ТаблицаВыбранныхДокументов);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьПараметрыПоОрганизации(Ложь);
	Если ЗначениеЗаполнено(ДанныеПредложений) Тогда
		ЗаполнитьДанныеВыбораБанк();
	КонецЕсли;
	УстановитьЗначенияБанкЛимит();

КонецПроцедуры

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
	
	ВыбранноеПредложение = ВыбранноеПредложение();
	Если ВыбранноеПредложение <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, ВыбранноеПредложение, "Банк, Лимит");
		ИзменитьПараметрыВыбораБанковскогоСчета(ВыбранноеПредложение.ДоступнаВыдачаНаСчетВДругомБанке);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБанковскиеДокументы

&НаКлиенте
Процедура БанковскиеДокументыПометкаПриИзменении(Элемент)
	
	Объект.СуммаДокумента = 0;
	Отбор = Новый Структура("Пометка", Истина);
	МассивОтмеченных = ТаблицаБанковскихДокументов.НайтиСтроки(Отбор);
	Для Каждого ЭлементМассива Из МассивОтмеченных Цикл
		Объект.СуммаДокумента = Объект.СуммаДокумента + ЭлементМассива.Сумма;
	КонецЦикла;
	
	Модифицированность = МассивОтмеченных.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	ТекущиеДанные = Элементы.ТаблицаБанковскихДокументов.ТекущиеДанные;
	ПоказатьЗначение(, ТекущиеДанные.Документ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьВыписки(Команда)
	ЗаполнитьДоступныеБанковскиеДокументы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для Каждого СтрокаСписаний Из ТаблицаБанковскихДокументов Цикл
		СтрокаСписаний.Пометка = Ложь;
	КонецЦикла;
	Объект.СуммаДокумента = 0;
	Модифицированность = Ложь;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодатьЗаявку(Команда)
	
	Если Не ПроверитьЗаполнениеЗаявки() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	ПроверитьЗавершениеДлительнойОперацииПередОтправкой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредложения(Команда)
	ПолучитьПредложенияБанков();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура УстановитьВидимостьСтраницыОжидания()

	УстановитьВидимостьСтраницы(Элементы.СтраницаОжидание);
	Элементы.НадписьОжиданиеПояснение.Заголовок = ТекстПоясненияОжидания;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтраницы(ОтображаемаяСтраница)

	// Чтобы не отрастали лишние скролл-бары по высоте из-за разного числа элементов
	// на разных страницах, оставляем видимость только у одной - отображаемой страницы.
	
	Для Каждого СтраницаЗаявки Из Элементы.СтраницыПомощника.ПодчиненныеЭлементы Цикл
		СтраницаЗаявки.Видимость = (СтраницаЗаявки = ОтображаемаяСтраница);
	КонецЦикла;

	Элементы.СтраницыПомощника.ТекущаяСтраница  = ОтображаемаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗавершениеДлительнойОперацииПередОтправкой() Экспорт
	
	Если СведенияОДлительнойОперации.ДлительнаяОперация = Неопределено Тогда
		НачатьОтправку();
	Иначе
		ТекстПоясненияОжидания = НСтр("ru = 'Проверка информации'");
		УстановитьВидимостьСтраницыОжидания();
		ПодключитьОбработчикОжидания("ПроверитьЗавершениеДлительнойОперацииПередОтправкой", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтправку()
	
	ПараметрыОтправки = НовыйПараметрыОтправки();
	ЗаполнитьЗначенияСвойств(ПараметрыОтправки, Объект);
	ПараметрыОтправки.СуммаЗаявки = Мин(Объект.СуммаДокумента, Объект.Лимит);
	ПараметрыОтправки.ИННБанка = ИННБанка;
	ПараметрыОтправки.ЗаявкаНаКредитПоВыписке = Объект.Ссылка;
	ПараметрыОтправки.ФормаИсточник = ФормаИсточник;
	
	// Параметры, которые доступны только в клиентском контексте.
	ПараметрыОтправки.ПараметрыНаКлиенте.ВладелецФормы = ЭтотОбъект;
	ПараметрыОтправки.ПараметрыНаКлиенте.ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ОтправитьЗавершение", ЭтотОбъект);
	
	ОткрытьФормуОтправки(ПараметрыОтправки);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтправки(ПараметрыОтправки) Экспорт

	ПараметрыФормы = Новый Структура();

	// Передаем в форму все исходные параметры, кроме доступных только на клиенте.
	Для каждого КлючИЗначение Из ПараметрыОтправки Цикл
		Если КлючИЗначение.Ключ <> "ПараметрыНаКлиенте" Тогда
			ПараметрыФормы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОтправкаЗавершение", ЭтотОбъект, ПараметрыОтправки);
	
	ОткрытьФорму("Документ.ЗаявкаНаКредитПоВыписке.Форма.Отправка",
		ПараметрыФормы,
		ПараметрыОтправки.ПараметрыНаКлиенте.ВладелецФормы,
		, , ,
		ОповещениеОЗавершении);

КонецПроцедуры

&НаКлиенте
Процедура ОтправкаЗавершение(Результат, ПараметрыОтправки) Экспорт
		
	Если НЕ ПроверитьРезультатВыполнения(Результат, ПараметрыОтправки) Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОЗавершенииОтправки(Истина, ПараметрыОтправки, Результат.СсылкаНаЗаявку);

КонецПроцедуры

&НаКлиенте
Функция ПроверитьРезультатВыполнения(Результат, ПараметрыОтправки)

	Выполнено      = Ложь;
	ОписаниеОшибки = "";

	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Свойство("Выполнено") Тогда
			Выполнено      = Результат.Выполнено;
		КонецЕсли;
		Если Результат.Свойство("ОписаниеОшибки") Тогда
			ОписаниеОшибки = Результат.ОписаниеОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		// Покажем текст ошибки пользователю.
		ПоказатьПредупреждение(, ОписаниеОшибки);
	КонецЕсли;
	
	Если НЕ Выполнено Тогда
		ОповеститьОЗавершенииОтправки(Ложь, ПараметрыОтправки, Неопределено);
	КонецЕсли;
	
	Возврат Выполнено;

КонецФункции

&НаКлиенте
Процедура ОповеститьОЗавершенииОтправки(Выполнено, ПараметрыОтправки, СсылкаНаЗаявку)
	
	Перем ОповещениеОЗавершении;
	
	Если Не (ЗначениеЗаполнено(ПараметрыОтправки)
		И ПараметрыОтправки.Свойство("ПараметрыНаКлиенте")
		И ПараметрыОтправки.ПараметрыНаКлиенте.Свойство("ОповещениеОЗавершении", ОповещениеОЗавершении)
		И ОповещениеОЗавершении <> Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("Выполнено",  Выполнено);
	Результат.Вставить("СсылкаНаЗаявку", СсылкаНаЗаявку);
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Результат);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Выполнено = Ложь;
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Выполнено = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Выполнено", Ложь);
	КонецЕсли;
	
	Если НЕ Выполнено Тогда
		Возврат;
	КонецЕсли;

	// При успешной отправке оповестим форму списка.
	КлючЗаявки = Новый Структура;
	КлючЗаявки.Вставить("Организация", Объект.Организация);
	КлючЗаявки.Вставить("ЗаявкаНаКредит", Объект.Ссылка);
	КлючЗаявки.Вставить("Банк", Объект.Банк); 
	КлючЗаявки.Вставить("СервисОбменаСБанками", СервисОбменаСБанками);

	Оповестить("ОбновленоСостояниеЗаявкиНаКредит", КлючЗаявки);
	
	// Запустим автоматическую проверку статусов заявок.
	ЗаявкиНаКредитКлиент.ПерезапуститьПроверкуСообщенийОтБанков();
	Если ЗначениеЗаполнено(Результат.СсылкаНаЗаявку) Тогда
		ПерейтиПоНавигационнойСсылке(Результат.СсылкаНаЗаявку);
	КонецЕсли;
	ОткрытьСписокЗаявокПослеУспешнойОтправки(КлючЗаявки);
		
КонецПроцедуры

&НаКлиенте
Функция НовыйПараметрыОтправки()
	
	ПараметрыОтправки = Новый Структура;
	ПараметрыОтправки.Вставить("Организация");
	ПараметрыОтправки.Вставить("СчетОрганизации");
	ПараметрыОтправки.Вставить("Банк");
	ПараметрыОтправки.Вставить("СуммаЗаявки");
	ПараметрыОтправки.Вставить("ИННБанка");
	ПараметрыОтправки.Вставить("Лимит");
	ПараметрыОтправки.Вставить("ЗаявкаНаКредитПоВыписке");
	ПараметрыОтправки.Вставить("ФормаИсточник");

	// Значения, которые доступны только на клиенте (не могут передаваться на сервер).
	ПараметрыОтправки.Вставить("ПараметрыНаКлиенте", Новый Структура());
	ПараметрыОтправки.ПараметрыНаКлиенте.Вставить("ВладелецФормы");         // Форма-владелец
	ПараметрыОтправки.ПараметрыНаКлиенте.Вставить("ОповещениеОЗавершении"); // Оповещение, которое необходимо вызвать после завершения всего процесса.

	Возврат ПараметрыОтправки;
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеЗаявки()
	
	Возврат Документы.ЗаявкаНаКредитПоВыписке.ПроверитьЗаполнение(ЭтотОбъект);

КонецФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаОрганизация.Видимость = Справочники.Организации.ИспользуетсяНесколькоОрганизаций();
	Элементы.Банк.Доступность = ЗначениеЗаполнено(Объект.Организация);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЭлементыБанковскогоСчета()
	
	Если УОрганизацииТолькоОдинБанковскийСчет Тогда
		Элементы.НадписьПункт4.Заголовок = Новый ФорматированнаяСтрока(
			НСтр("ru = 'Счет для зачисления кредита:'"), Новый Шрифт(,,Истина));
		Элементы.СчетОрганизации.Вид = ВидПоляФормы.ПолеНадписи;
	Иначе
		Элементы.НадписьПункт4.Заголовок = Новый ФорматированнаяСтрока(
			НСтр("ru = 'Заполните счет для зачисления кредита:'"), Новый Шрифт(,,Истина));
		Элементы.СчетОрганизации.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеБанковскиеДокументы(ОткрытиеЧерновика) 
	
	Если Не ОткрытиеЧерновика Тогда
		Объект.СуммаДокумента = 0;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТаблицаБанковскихДокументов.Очистить();
	Иначе
		ДоступныеБанковскиеДокументы = ЗаявкиНаКредитПоВыпискеПереопределяемый.ДоступныеБанковскиеДокументы(Объект.Организация); 
		ТаблицаБанковскихДокументов.Загрузить(ДоступныеБанковскиеДокументы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеВыбораБанк() 
	
	ДанныеВыбора = Элементы.Банк.СписокВыбора;
	ДанныеВыбора.Очистить();
	
	Для Каждого ПредложениеБанка Из ДанныеПредложений.МассивБанков Цикл 
		
		Если Не ДоступностьПредложенияПоРегиону(ПредложениеБанка) Тогда
			Продолжить;
		КонецЕсли;
		
		Представление =  СтрШаблон(НСтр("ru = '%1 лимит %2 руб.'"), ПредложениеБанка.НаименованиеБанка, ПредложениеБанка.Лимит);
		ДанныеВыбора.Добавить(ПредложениеБанка.Банк, Представление);

	КонецЦикла;
				
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначенияБанкЛимит()
		
	ИндексПодходящегоПредложения = Неопределено;
	Если Не ЗначениеЗаполнено(ДанныеПредложений) Тогда
		Объект.Банк = Неопределено;
		Объект.Лимит = 0;
		ИННБанка = "";
		Возврат;
	КонецЕсли;
	
	МассивБанков = ДанныеПредложений.МассивБанков;
	Для Индекс = 0 По МассивБанков.Количество() - 1 Цикл 
		
		ПредложениеБанка = МассивБанков[Индекс];
		ИННБанка = ПредложениеБанка.ИННБанка;
		Если Не ДоступностьПредложенияПоРегиону(ПредложениеБанка) Тогда
			Продолжить;
		КонецЕсли;	
		ИндексПодходящегоПредложения = Индекс;
		
		// В случае если банк не заполнен, заполняем первым предложением из списка
		// в противном случаем пытаемся найти прежнее предложение и актуализировать его
		Если Не ЗначениеЗаполнено(Объект.Банк) Тогда
			ЗаполнитьЗначенияСвойств(Объект, ПредложениеБанка, "Лимит, Банк"); 
			ИзменитьПараметрыВыбораБанковскогоСчета(ПредложениеБанка.ДоступнаВыдачаНаСчетВДругомБанке);
			Возврат;
		ИначеЕсли ПредложениеБанка.Банк = Объект.Банк Тогда
			ЗаполнитьЗначенияСвойств(Объект, ПредложениеБанка, "Лимит");
			ИзменитьПараметрыВыбораБанковскогоСчета(ПредложениеБанка.ДоступнаВыдачаНаСчетВДругомБанке);
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИндексПодходящегоПредложения = Неопределено Тогда
		// Если нет предложений, очищаем прежние значения
		Объект.Банк = Неопределено;
		Объект.Лимит = 0;
		ИННБанка = "";
	Иначе
		ПредложениеБанка = ДанныеПредложений.МассивБанков[ИндексПодходящегоПредложения];
		ЗаполнитьЗначенияСвойств(Объект, ПредложениеБанка, "Лимит, Банк");
		ИзменитьПараметрыВыбораБанковскогоСчета(ПредложениеБанка.ДоступнаВыдачаНаСчетВДругомБанке);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ДоступностьПредложенияПоРегиону(ПредложениеБанка)
	
	Если ПредложениеБанка.ЧерныйСписок.Количество() > 0 Тогда
		
		Возврат ПредложениеБанка.ЧерныйСписок.Найти(КодРегионаОрганизации) = Неопределено;
		
	ИначеЕсли ПредложениеБанка.БелыйСписок.Количество() > 0 Тогда
		
		Возврат ПредложениеБанка.БелыйСписок.Найти(КодРегионаОрганизации) <> Неопределено;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДоступныеБанкиДляВыбора(МассивДоступныхБанков)
	
	МассивДоступныхБанков = Документы.ЗаявкаНаКредитПоВыписке.БанкиПоИНН(ИННБанка);
	
	ПроверитьРасчетныйСчет(МассивДоступныхБанков);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРасчетныйСчет(МассивДоступныхБанков)
	
	Если Не ЗначениеЗаполнено(Объект.СчетОрганизации) Тогда
		Объект.СчетОрганизации = РасчетныйСчетПоУмолчанию(Объект.Организация, МассивДоступныхБанков);
		Возврат;
	КонецЕсли;
	
	БанкРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетОрганизации, "Банк");
	
	Если МассивДоступныхБанков.Найти(БанкРасчетногоСчета) = Неопределено Тогда
		Объект.СчетОрганизации = Неопределено; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодРегиона()
	
	ЮрАдресОрганизации = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияНаДату(
		Объект.Организация,
		Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);

	КодРегиона = "";
	Если ЗначениеЗаполнено(ЮрАдресОрганизации.Значение) Тогда
		СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(ЮрАдресОрганизации.Значение);
		КодРегиона = СведенияОбАдресе.КодРегиона;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КодРегиона) Тогда
		// Если из адреса определить код региона не получилось, то ищем через регистрацию в налоговом органе.
		ОсновнаяРегистрацияВНалоговомОргане = Справочники.Организации.РегистрацияВНалоговомОрганеНаДату(
			Объект.Организация, Объект.Дата);
		Если ЗначениеЗаполнено(ОсновнаяРегистрацияВНалоговомОргане) Тогда
			РеквизитыРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОсновнаяРегистрацияВНалоговомОргане, "КодРегиона");
			Если ЗначениеЗаполнено(РеквизитыРегистрации.КодРегиона) Тогда
				// В настройках сервиса код региона задан в виде строки с лидирующем нулем.
				КодРегиона = Формат(РеквизитыРегистрации.КодРегиона, "ЧЦ=2;ЧВН=");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	КодРегионаОрганизации = СокрЛП(КодРегиона);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПредложенияБанков()
	
	УстановитьВидимостьПредложенийБанков(Ложь); 

	СведенияОДлительнойОперации = Новый Структура();
	СведенияОДлительнойОперации.Вставить("Имя", "");
	СведенияОДлительнойОперации.Вставить("ДлительнаяОперация");
		
	НачатьПолучениеПредложенияБанковНаСервере(); 
	ОжидатьЗавершениеПолученияПредложений();
	
КонецПроцедуры

&НаСервере
Процедура НачатьПолучениеПредложенияБанковНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение           = 0; // Не ждем завершения.
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение предложений банков по кредиту по выписке'");
	ПараметрыВыполнения.КлючФоновогоЗадания = ПараметрыВыполнения.КлючФоновогоЗадания;
	
	ПараметрыПроцедуры = Новый Структура();
		
	СведенияОДлительнойОперации.Имя = "ПолучитьПредложенияВСервисе";
	СведенияОДлительнойОперации.ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Документы.ЗаявкаНаКредитПоВыписке.ПолучитьПредложенияВСервисе", ПараметрыПроцедуры);
		
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершениеПолученияПредложений() 
	
	Если СведенияОДлительнойОперации.ДлительнаяОперация = Неопределено Тогда
		// Фоновое задание не запущено.
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ДополнительныеПараметры = Новый Структура;
	   
	ОповещенияОЗавершении = Новый ОписаниеОповещения("ПолучениеПредложенийЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		СведенияОДлительнойОперации.ДлительнаяОперация,
		ОповещенияОЗавершении,
		ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ПолучениеПредложенийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		УстановитьВидимостьПредложенийБанков(Истина);  
		Возврат; 
	КонецЕсли;
	СведенияОДлительнойОперации.ДлительнаяОперация = Неопределено; // Сбросим признак выполнения.
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Статус", "") <> "Ошибка" Тогда
		
		Если Не ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
			УстановитьВидимостьПредложенийБанков(Истина); 
			Возврат;
		КонецЕсли;
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
		Если ТипЗнч(РезультатВыполнения) <> Тип("Структура") Тогда
			УстановитьВидимостьПредложенийБанков(Истина); 
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатВыполнения.ОписаниеОшибки) Тогда
			УстановитьВидимостьПредложенийБанков(Истина); 
			Возврат;
		КонецЕсли;

		ДанныеПредложений = РезультатВыполнения;  
		ЗаполнитьДанныеВыбораБанк(); 
		УстановитьЗначенияБанкЛимит();
			
	КонецЕсли;
	
	УстановитьВидимостьПредложенийБанков(Ложь); 

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметрыВыбораБанковскогоСчета(ДоступнаВыдачаНаСчетВДругомБанке)
	
	ИзменитьЭлементыБанковскогоСчета();
	
	ПараметрыВыбораСчета = Новый Массив;
	ПараметрыВыбораСчета.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Объект.Организация));
	ПараметрыВыбораСчета.Добавить(Новый ПараметрВыбора("Отбор.Валютный", Ложь));

	Если ДоступнаВыдачаНаСчетВДругомБанке Тогда
		Объект.СчетОрганизации = РасчетныйСчетПоУмолчанию(Объект.Организация, Неопределено);
	Иначе
		МассивДоступныхБанков = Новый Массив;	
		ЗаполнитьДоступныеБанкиДляВыбора(МассивДоступныхБанков);
		ПараметрыВыбораСчета.Добавить(Новый ПараметрВыбора("Отбор.Банк", Новый ФиксированныйМассив(МассивДоступныхБанков)));
	КонецЕсли;

	Если Не УОрганизацииТолькоОдинБанковскийСчет Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СчетОрганизации", "ПараметрыВыбора", Новый ФиксированныйМассив(ПараметрыВыбораСчета));

	КонецЕсли;
	
	ЕстьДоступныеСчета = ЗначениеЗаполнено(Объект.СчетОрганизации);
	Элементы.СчетОрганизации.Видимость = ЕстьДоступныеСчета;
	Элементы.НадписьСчетОрганизации.Видимость = Не ЕстьДоступныеСчета;
		
	Если Не ЕстьДоступныеСчета Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Банковское предложение доступно только для клиентов, имеющих расчетный счет в банке'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПредложенийБанков(ЕстьОшибки)
	
	ПредложенияПолученыССервиса = ЗначениеЗаполнено(ДанныеПредложений);
	ЕстьПредложения = ПредложенияПолученыССервиса И ЗначениеЗаполнено(Объект.Банк) И Не ЕстьОшибки; 
	Элементы.ГруппаДлительнаяОперация.Видимость = Не ПредложенияПолученыССервиса И Не ЕстьОшибки; 
	Элементы.Банк.Видимость = ЕстьПредложения; 
	Элементы.ТекстНетПредложений.Видимость = Не ЕстьПредложения И ПредложенияПолученыССервиса; 
	Элементы.ГруппаОшибка.Видимость = ЕстьОшибки; 
	Элементы.ПодатьЗаявку.Доступность = ЕстьПредложения;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЗаявокПослеУспешнойОтправки(КлючЗаявки) Экспорт

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СервисОбменаСБанками", СервисОбменаСБанками);
	ПараметрыОткрытия.Вставить("ОтборСервисОбменаСБанкамиИспользование", Истина);
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура("Организация", Объект.Организация));
	ПараметрыОткрытия.Вставить("ТекущаяСтрока", КлючЗаписиСостоянияЗаявки(КлючЗаявки));
	
	ОткрытьФорму("РегистрСведений.СостояниеЗаявокНаКредит.Форма.СостояниеЗаявокНаКредит", ПараметрыОткрытия,,СервисОбменаСБанками);
	Закрыть();

КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючЗаписиСостоянияЗаявки(ЗначенияКлюча) Экспорт

	Возврат РегистрыСведений.СостояниеЗаявокНаКредит.СоздатьКлючЗаписи(ЗначенияКлюча);

КонецФункции

&НаКлиенте
Функция ВыбранноеПредложение()
	
	Для Каждого Предложение Из ДанныеПредложений.МассивБанков Цикл
		
		Если Предложение.Банк = Объект.Банк Тогда
			Возврат Предложение;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОтправитьСтатистику()
	
	СведенияОДлительнойОперацииСтатистика = Новый Структура();
	СведенияОДлительнойОперацииСтатистика.Вставить("Имя", "");
	СведенияОДлительнойОперацииСтатистика.Вставить("ДлительнаяОперация");
		
	ОтправитьСтатистикуНаСервере();
	ОжидатьЗавершениеОтправкиСтатистикиВСервис();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолучитьПредложенияБанков()
	ПолучитьПредложенияБанков();	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСтатистикуНаСервере()
	
	Если ОбщегоНазначения.РежимОтладки() 
		Или БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаявкаНаКредитПоВыписке.ПреобразоватьИмяФормы(ФормаИсточник);
	ДанныеСтатистики = Документы.ЗаявкаНаКредитПоВыписке.НовыйСтруктураДанныхСтатистики();
	ДанныеСтатистики.ИмяФормы = ФормаИсточник;
	ДанныеСтатистики.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "ИНН");
	ДанныеСтатистики.Создание = 1;
	
	СтруктураДанныхСтатистики = Новый Структура;
	СтруктураДанныхСтатистики.Вставить("СтатистикаКредитПоВыписке", 
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеСтатистики));

	НачатьОтправкуСтатистикиВСервис(СтруктураДанныхСтатистики);
	
КонецПроцедуры

&НаСервере
Процедура НачатьОтправкуСтатистикиВСервис(СодержимоеСтатистики) 
	
	СервисОбменаСБанками = Перечисления.СервисыОбменаСБанками.ЗаявкиНаКредитПоВыписке; 

	СведенияОДлительнойОперации = СведенияОДлительнойОперацииСтатистика;
	АдресХранилищаОтправкаСтатистики = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);

	Если СведенияОДлительнойОперации.ДлительнаяОперация <> Неопределено Тогда
		// Не завершено предыдущее фоновое задание, новое не запускаем.
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ОжидатьЗавершение           = 0; // Не ждем завершения.
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = 'Отправка статистики в сервис %1'"), СервисОбменаСБанками);
	ПараметрыВыполнения.КлючФоновогоЗадания = ПараметрыВыполнения.КлючФоновогоЗадания;
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("СервисОбменаСБанками", СервисОбменаСБанками);
	ПараметрыПроцедуры.Вставить("СодержимоеСтатистики", СодержимоеСтатистики);
	ПараметрыПроцедуры.Вставить("ТокенАвторизации", ТокенАвторизации);
	
	СведенияОДлительнойОперации.Имя = "ОтправитьСтатистикуВСервис";
	СведенияОДлительнойОперации.ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		"ЗаявкиНаКредитПоВыпискеПереопределяемый.ОтправитьСтатистикуВСервис", ПараметрыПроцедуры, АдресХранилищаОтправкаСтатистики);
		
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьЗавершениеОтправкиСтатистикиВСервис()
	
	Если СведенияОДлительнойОперацииСтатистика.ДлительнаяОперация <> Неопределено Тогда
		
		// В настоящее время еще выполняется фоновое задание по отправке статистики в сервис,
		// дождемся его завершения.
		ТекстПоясненияОжидания = НСтр("ru = 'Отправка статистики'");
		
	Иначе
		
		// Фоновое задание не запущено.
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ДополнительныеПараметры = Новый Структура;

	ОповещенияОЗавершении = Новый ОписаниеОповещения("ОтправкаСтатистикиВСервисЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		СведенияОДлительнойОперацииСтатистика.ДлительнаяОперация,
		ОповещенияОЗавершении,
		ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ОтправкаСтатистикиВСервисЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;	
	КонецЕсли;

	СведенияОДлительнойОперации.ДлительнаяОперация = Неопределено; // Сбросим признак выполнения.
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Статус", "") <> "Ошибка" Тогда
		
		Если Не ЭтоАдресВременногоХранилища(АдресХранилищаОтправкаСтатистики) Тогда
			Возврат;
		КонецЕсли;
		РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилищаОтправкаСтатистики); 
		Если ТипЗнч(РезультатВыполнения) <> Тип("Структура") Тогда
			Возврат;
		КонецЕсли;
		Если РезультатВыполнения.Выполнено Тогда
		
			ТокенАвторизации = РезультатВыполнения.Токен;			

		КонецЕсли;
		
		УдалитьИзВременногоХранилища(АдресХранилищаОтправкаСтатистики);
		АдресХранилищаОтправкаСтатистики = "";

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПоОрганизации(ОткрытиеЧерновика)
		
	УОрганизацииТолькоОдинБанковскийСчет = Справочники.БанковскиеСчета.КоличествоБанковскихСчетовОрганизации(
			Объект.Организация) = 1;
	Объект.СчетОрганизации = Неопределено;
		
	УстановитьВидимостьДоступность();
	ЗаполнитьКодРегиона();
	
	ЗаполнитьДоступныеБанковскиеДокументы(ОткрытиеЧерновика); 
	Если ОткрытиеЧерновика Тогда
		УстановитьПометкиПоДокументам();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкиПоДокументам()
	
	Для Каждого СтрокаДокументов Из Объект.БанковскиеДокументы Цикл
		
		Отбор = Новый Структура("Документ", СтрокаДокументов.Документ);
		СтрокиДокументов = ТаблицаБанковскихДокументов.НайтиСтроки(Отбор);
		
		Если СтрокиДокументов.Количество() = 0 Тогда
			
			Объект.СуммаДокумента = 0;
			ТекстСообщения = НСтр("ru = 'Изменились параметры заявки, необходимо выбрать платежи заново'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, "ТаблицаБанковскихДокументов");
			Для Каждого СтрокаСписаний Из ТаблицаБанковскихДокументов Цикл
				СтрокаСписаний.Пометка = Ложь;
			КонецЦикла;
			Возврат;  
			
		Иначе
			СтрокиДокументов[0].Пометка = Истина;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасчетныйСчетПоУмолчанию(Организация, МассивБанков)
	Возврат ЗаявкиНаКредитПоВыпискеПереопределяемый.СчетОрганизацииПоУмолчанию(Организация, МассивБанков);
КонецФункции

#КонецОбласти
