#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Скрывает значение СтраницаБыстрогоРаспознавания из выбора во всех формах:
// документы данного типа создаются сервисом быстрого распознавания и не предназначены
// для ручного выбора типа распознанного документа.
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг);
	СписокЗначений.Добавить(Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату);
	СписокЗначений.Добавить(Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура);
	СписокЗначений.Добавить(Перечисления.ТипыДокументовРаспознаваниеДокументов.ТОРГ12);
	СписокЗначений.Добавить(Перечисления.ТипыДокументовРаспознаваниеДокументов.УПД);
	СписокЗначений.Добавить(Перечисления.ТипыДокументовРаспознаваниеДокументов.УКД);
	СписокЗначений.Добавить(Перечисления.ТипыДокументовРаспознаваниеДокументов.НеопределенныйДокумент);
	СписокЗначений.Добавить(Перечисления.ТипыДокументовРаспознаваниеДокументов.КассовыйЧек);
	
	ДанныеВыбора = СписокЗначений;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
