#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьЭлементыЧекаНПД(Форма) Экспорт
	
	Если Форма.ЭтоДоговорССамозанятым Тогда
		Объект = Форма.Объект;
		Элементы = Форма.Элементы;
		ПредставлениеЧекаНПД = "";
		Если Объект.ЧекиНПД.Количество() = 1 Тогда
			ПервыйЧек = Объект.ЧекиНПД[0];
			Если ЗначениеЗаполнено(ПервыйЧек.Номер) Тогда
				ПредставлениеЧекаНПД = ПервыйЧек.Номер;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ЧекиНПД) И Не ЗначениеЗаполнено(ПредставлениеЧекаНПД) Тогда
			ПредставлениеЧекаНПД = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru = ';Получен %1 чек НПД;;Получено %1 чека НПД;Получено %1 чеков НПД;Получено %1 чека НПД'"),
				Объект.ЧекиНПД.Количество());
		КонецЕсли;
		
		Форма.ПредставлениеЧекаНПД = ПредставлениеЧекаНПД;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ЗагрузитьЧекНПД", "Видимость", Не ЗначениеЗаполнено(ПредставлениеЧекаНПД));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ПредставлениеЧекаНПД", "Видимость", ЗначениеЗаполнено(ПредставлениеЧекаНПД));
		Если Форма.ПолученЧекНПД Тогда
			ИмяЦвета = "ЦветФонаКорректногоЗначенияБП";
		Иначе
			ИмяЦвета = "ФонУправляющегоПоля";
		КонецЕсли;
		#Если Клиент Тогда
		ЦветГруппы = ОбщегоНазначенияКлиент.ЦветСтиля(ИмяЦвета);
		#Иначе
		ЦветГруппы = ЦветаСтиля[ИмяЦвета];
		#КонецЕсли
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаЧекНПД", "ЦветФона", ЦветГруппы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти