#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализируем реквизиты формы, которые будут передаваться
	// в качестве параметров команд, расположенных в данной панели
	Организация = Параметры.Организация;
	
	МобильныйКлиентАдаптацияФормы();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанелиПоГруппам(ЭтотОбъект,
		Элементы.Группа1СОтчетность,
		"ОбщаяКомандаОткрытьФорму1СОтчетностьНаОтчетах,ОбщаяКомандаОткрытьФорму1СОтчетностьНаУведомлениях,"
		+ "ОбщаяКомандаПредложениеОформитьЗаявлениеНаПодключение");
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"ОбработкаПанелиПростойИнтерфейсКомандаСписокЗадач,ОбщаяКомандаОценкаРискаНалоговойПроверкиПростойИнтерфейс");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти