
// КОМАНДЫ ФОРМЫ
///////////////////////

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Ложь, Истина);
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаВыбора", ПараметрыПодбора, Элементы.Поступления);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоступленияОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализацию(Команда)
	
	// 1.1
	// Получаем форму нового подчиненного документа
	ВыбранныйВидОперации = ПолучитьВидОперацииНаСервере();
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВидОперации", ВыбранныйВидОперации);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ",                Неопределено);
	СтруктураПараметров.Вставить("ЗначениеКопирования", Неопределено);
	СтруктураПараметров.Вставить("ЗначенияЗаполнения",  ЗначенияЗаполнения);
	СтруктураПараметров.Вставить("Основание",           Неопределено);
	
	ФормаПодчиненного = ПолучитьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокументаТовары", СтруктураПараметров);

	// 1.2
	// Получим объект формы - это Новый - создаваемый объект
	ОбъектФормы = ФормаПодчиненного.Объект;

	// 2. Передадим управление на сервер.
	ЗаполнитьДокументНаСервере(ОбъектФормы);	
	Для каждого Стр Из ОбъектФормы.Товары Цикл
		ТоварыНоменклатураПриИзменении(Стр, ФормаПодчиненного);
	КонецЦикла; 
	
	УчтемДопРасходы();		

	// 3.1
	// В ранее созданной форме нового документа переопределим объект - документ (подменим его на заполненный документ)
	КопироватьДанныеФормы(ОбъектФормы, ФормаПодчиненного.Объект);		

	// 3.2
	ФормаПодчиненного.Модифицированность = Истина; // Чтобы выдавалось сообщение при попытке закрыть документ без сохранения
	ФормаПодчиненного.ПодготовитьФормуНаСервере();
	ФормаПодчиненного.Открыть();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступленияДопРасходыПриИзменении(Элемент)
	
	ПоступленияДопРасходыПриИзмененииНаСервере();	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицу(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
	
	Объект.Поступления.Очистить();
	Объект.Товары.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура НаценкаПриИзменении(Элемент)
	
	НаценкаПриИзмененииНаСервере();	
	ПересчитатьИтоговуюСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура НаценкаСуммойПриИзменении(Элемент)
	
	НаценкаПриИзмененииНаСервере();	
	ПересчитатьИтоговуюСумму();
	
КонецПроцедуры

&НаСервере
Процедура СуммаРеализацииПриИзмененииНаСервере()
	
	ТекСумма = Объект.Товары.Итог("Сумма");
	Отклонение = Объект.СуммаРеализации - ТекСумма;
	
	Товары = Объект.Товары.Выгрузить();
	
	МассивРаспределенныхСтрок = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(Объект.СуммаРеализации, Товары.ВыгрузитьКолонку("Сумма"));	
	
	Товары.ЗагрузитьКолонку(МассивРаспределенныхСтрок, "Сумма");	
	
	Для Каждого Стр Из Товары Цикл
		           	
		СтавкаНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Стр.СтавкаНДС);
		Если СтавкаНДС = 10 ИЛИ СтавкаНДС = 18 ИЛИ СтавкаНДС = 20 Тогда
			Стр.СуммаБезНДС = Стр.Сумма * 100 / (СтавкаНДС + 100);
			Стр.СуммаНДС = Стр.Сумма - Стр.СуммаБезНДС;
		Иначе
			СуммаНДС = 0;
		КонецЕсли;
		
		Стр.Наценка = Стр.СуммаБезНДС - Стр.Стоимость - Стр.ДопРасходы;
		Стр.ПроцентНаценки = (Стр.СуммаБезНДС / Стр.ПолнаяСебестоимость - 1) * 100;
		//Стр.ПроцентНаценки = Стр.Наценка / Стр.Стоимость * 100;
			
		Стр.Цена = Стр.Сумма / Стр.Количество;
	
	КонецЦикла;
	
	Объект.Товары.Загрузить(Товары);
	
	//Объект.НаценкаСуммой = Товары.Итог("Наценка");
	Если Объект.Товары.Количество() > 0 Тогда 
		Объект.НаценкаДокумента = Товары.Итог("ПроцентНаценки") / Объект.Товары.Количество();
	КонецЕсли;
	
	//НаценкаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаРеализацииПриИзменении(Элемент)
	Если НЕ Объект.НеПолнаяРеализация Тогда
		СуммаРеализацииПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПоступленияПередУдалением(Элемент)
	
	ПоступленияПередУдалениемНаСервере(Элементы.Поступления.ТекущиеДанные.Поступление);    
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРеализацииПриИзменении(Элемент)
	
	ОчиститьИЗаполнитьНаСервере();		
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступленияПослеУдаления(Элемент)
	
	ПоступленияПослеУдаленияНаСервере();	
	
КонецПроцедуры


// ОСНОВНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////////////////////////////////


&НаСервере
Процедура ПоступленияОбработкаВыбораНаСервере(ВыбранноеЗначение)
		
	ПересчитатьСтрокиНаСервере(ВыбранноеЗначение);

КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокиНаСервере(ВыбранноеЗначение = Неопределено)
	
	Поступления = Объект.Поступления;
	Товары = Объект.Товары;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугТовары.Номенклатура.НомерГТД.РегистрационныйНомер КАК НомерГТД,
		|	ПоступлениеТоваровУслугТовары.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ПоступлениеТоваровУслугТовары.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ПоступлениеТоваровУслугТовары
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка В(&Партия)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугТовары.Ссылка,
		|	ПоступлениеТоваровУслугТовары.Номенклатура,
		|	ПоступлениеТоваровУслугТовары.СтранаПроисхождения,
		|	ПоступлениеТоваровУслугТовары.СтавкаНДС,
		|	ПоступлениеТоваровУслугТовары.Номенклатура.НомерГТД.РегистрационныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//ДК -- 09.12.22
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|ВЫБРАТЬ Первые 1
		//--
		|	ГТДИмпорт.Ссылка КАК ГТДСсылка
		|ПОМЕСТИТЬ ВТГТДСсылка
		|ИЗ
		|	ПоступлениеТоваровУслугТовары КАК ПоступлениеТоваровУслугТовары,
		|	Документ.ГТДИмпорт КАК ГТДИмпорт
		|ГДЕ
		|	ГТДИмпорт.НомерГТД.РегистрационныйНомер В (ПоступлениеТоваровУслугТовары.НомерГТД)
		|	И ГТДИмпорт.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГТДИмпортРазделы.СтавкаНДС КАК СтавкаНДС,
		|	ГТДИмпортРазделы.Ссылка.НомерГТД КАК НомерГТД,
		|	ГТДИмпортРазделы.НомерСтроки КАК НомерСтроки,
		|	ГТДИмпортРазделы.Ссылка КАК ГТДДок
		|ПОМЕСТИТЬ ВТГТДРазделы
		|ИЗ
		|	Документ.ГТДИмпорт.Разделы КАК ГТДИмпортРазделы,
		|	ВТГТДСсылка КАК ВТГТДСсылка
		|ГДЕ
		|	ГТДИмпортРазделы.Ссылка В (ВТГТДСсылка.ГТДСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГТДИмпортТовары.Номенклатура КАК Номенклатура,
		|	ГТДИмпортТовары.ДокументПартии КАК ДокументПартии,
		|	ГТДИмпортТовары.Ссылка КАК ДокГТДСсылка,
		|	ГТДИмпортТовары.НомерСтроки КАК НомерСтроки,
		|	ГТДИмпортТовары.НомерРаздела КАК НомерРаздела
		|ПОМЕСТИТЬ ВТГТДТовары
		|ИЗ
		|	Документ.ГТДИмпорт.Товары КАК ГТДИмпортТовары,
		|	ВТГТДСсылка КАК ВТГТДСсылка
		|ГДЕ
		|	ГТДИмпортТовары.Ссылка В (ВТГТДСсылка.ГТДСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТГТДРазделы.СтавкаНДС КАК СтавкаНДС,
		|	ВТГТДТовары.Номенклатура КАК Номенклатура,
		|	ВТГТДТовары.ДокументПартии КАК ДокументПартии,
		|	ВТГТДРазделы.НомерГТД КАК НомерГТД,
		|	ВТГТДТовары.ДокГТДСсылка КАК ДокГТДСсылка
		|ПОМЕСТИТЬ ДокГТД
		|ИЗ
		|	ВТГТДРазделы КАК ВТГТДРазделы
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТГТДТовары КАК ВТГТДТовары
		|		ПО ВТГТДРазделы.НомерСтроки = ВТГТДТовары.НомерРаздела
		|			И ВТГТДРазделы.ГТДДок = ВТГТДТовары.ДокГТДСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.Ссылка КАК Поступление,
		|	ЕСТЬNULL(ДокГТД.ДокГТДСсылка, ЗНАЧЕНИЕ(Документ.ГТДИмпорт.ПустаяСсылка)) КАК ГТДПоИмпорту,
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугТовары.НомерГТД КАК НомерГТД,
		|	ПоступлениеТоваровУслугТовары.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ЕСТЬNULL(ДокГТД.СтавкаНДС, ПоступлениеТоваровУслугТовары.СтавкаНДС) КАК СтавкаНДС,
		|	ПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
		|	дкКалькуляцияСтоимостиОбороты.КоличествоПриход КАК Количество,
		|	ЕСТЬNULL(дкКалькуляцияСтоимостиОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	дкКалькуляцияСтоимостиОстатки.КоличествоОстаток / дкКалькуляцияСтоимостиОбороты.КоличествоПриход КАК Доля,
		|	дкКалькуляцияСтоимостиОбороты.ИнвойснаяСтоимостьВалПриход КАК СуммаПоступленияВал,
		|	дкКалькуляцияСтоимостиОстатки.ИнвойснаяСтоимостьВалОстаток КАК СуммаПоступленияВалОстаток,
		|	дкКалькуляцияСтоимостиОбороты.ИнвойснаяСтоимостьРубПриход КАК СуммаПоступления,
		|	дкКалькуляцияСтоимостиОстатки.ИнвойснаяСтоимостьРубОстаток КАК СуммаПоступленияОстаток,
		|	дкКалькуляцияСтоимостиОбороты.ПошлинаПриход КАК СуммаПошлины,
		|	дкКалькуляцияСтоимостиОбороты.ТаможенныйСборПриход КАК ТаможенныйСбор,
		|	дкКалькуляцияСтоимостиОбороты.ТранспортКНРПриход + дкКалькуляцияСтоимостиОбороты.ТранспортРФПриход + дкКалькуляцияСтоимостиОбороты.ПрочиеРасходыПриход КАК Расходы,
		|	ЕСТЬNULL(дкДопРасходы.ДопРасход, 0) КАК ДопРасходы,
		|	дкКалькуляцияСтоимостиОбороты.ИнвойснаяСтоимостьРубПриход + дкКалькуляцияСтоимостиОбороты.ТаможенныйСборПриход + дкКалькуляцияСтоимостиОбороты.ПошлинаПриход + дкКалькуляцияСтоимостиОбороты.ТранспортКНРПриход + дкКалькуляцияСтоимостиОбороты.ТранспортРФПриход + дкКалькуляцияСтоимостиОбороты.ПрочиеРасходыПриход КАК Себестоимость,
		|	дкКалькуляцияСтоимостиОстатки.ИнвойснаяСтоимостьРубОстаток + дкКалькуляцияСтоимостиОстатки.ТаможенныйСборОстаток + дкКалькуляцияСтоимостиОстатки.ПошлинаОстаток + дкКалькуляцияСтоимостиОстатки.ТранспортКНРОстаток + дкКалькуляцияСтоимостиОстатки.ТранспортРФОстаток + дкКалькуляцияСтоимостиОстатки.ПрочиеРасходыОстаток КАК СебестоимостьОстаток,
		|	(дкКалькуляцияСтоимостиОбороты.ИнвойснаяСтоимостьРубПриход + дкКалькуляцияСтоимостиОбороты.ТаможенныйСборПриход + дкКалькуляцияСтоимостиОбороты.ПошлинаПриход + дкКалькуляцияСтоимостиОбороты.ТранспортКНРПриход + дкКалькуляцияСтоимостиОбороты.ТранспортРФПриход + дкКалькуляцияСтоимостиОбороты.ПрочиеРасходыПриход) * &ПроцентНаценки / 100 КАК Наценка,
		|	дкКалькуляцияСтоимостиОстатки.КоличествоОстаток / дкКалькуляцияСтоимостиОбороты.КоличествоПриход * (дкКалькуляцияСтоимостиОбороты.ИнвойснаяСтоимостьРубПриход + дкКалькуляцияСтоимостиОбороты.ТаможенныйСборПриход + дкКалькуляцияСтоимостиОбороты.ПошлинаПриход + дкКалькуляцияСтоимостиОбороты.ТранспортКНРПриход + дкКалькуляцияСтоимостиОбороты.ТранспортРФПриход + дкКалькуляцияСтоимостиОбороты.ПрочиеРасходыПриход) * &ПроцентНаценки / 100 КАК НаценкаОстаток
		|ИЗ
		|	РегистрНакопления.дкКалькуляцияСтоимости.Обороты(, , , Партия В (&Партия)) КАК дкКалькуляцияСтоимостиОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоступлениеТоваровУслугТовары КАК ПоступлениеТоваровУслугТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ ДокГТД КАК ДокГТД
		|			ПО ПоступлениеТоваровУслугТовары.НомерГТД = ДокГТД.НомерГТД.РегистрационныйНомер
		|				И ПоступлениеТоваровУслугТовары.Номенклатура = ДокГТД.Номенклатура
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дкДопРасходы КАК дкДопРасходы
		|			ПО ПоступлениеТоваровУслугТовары.Ссылка = дкДопРасходы.Партия
		|		ПО (ПоступлениеТоваровУслугТовары.Ссылка = дкКалькуляцияСтоимостиОбороты.Партия)
		|			И (ПоступлениеТоваровУслугТовары.Номенклатура = дкКалькуляцияСтоимостиОбороты.Товар)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.дкКалькуляцияСтоимости.Остатки(&ДатаОстатков, Партия В (&Партия)) КАК дкКалькуляцияСтоимостиОстатки
		|		ПО (дкКалькуляцияСтоимостиОстатки.Партия = дкКалькуляцияСтоимостиОбороты.Партия)
		|			И (дкКалькуляцияСтоимостиОстатки.Товар = дкКалькуляцияСтоимостиОбороты.Товар)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Поступление,
		|	Номенклатура
		|ИТОГИ
		|	СУММА(СуммаНДС),
		|	СУММА(СуммаПоступленияВал),
		|	СУММА(СуммаПоступления),
		|	СУММА(СуммаПоступленияОстаток),
		|	СУММА(СуммаПошлины),
		|	СУММА(ТаможенныйСбор),
		|	СУММА(Расходы),
		|	МИНИМУМ(ДопРасходы),
		|	СУММА(Себестоимость),
		|	СУММА(СебестоимостьОстаток),
		|	СУММА(Наценка),
		|	СУММА(НаценкаОстаток)
		|ПО
		|	Поступление
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаОстатков", Объект.ДатаРеализации);
	Запрос.УстановитьПараметр("Партия", ВыбранноеЗначение);
	Запрос.УстановитьПараметр("ПроцентНаценки", Объект.Наценка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПартия = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаПартия.Следующий() Цикл
		
		СтрПартии = Поступления.Добавить();
		ЗаполнитьЗначенияСвойств(СтрПартии, ВыборкаПартия);
		СтрПартии.Всего = ВыборкаПартия.Себестоимость;
		СтрПартии.Остаток = ВыборкаПартия.СебестоимостьОстаток;					
				
		СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
		
		Выборка = ВыборкаПартия.Выбрать();	
		Пока Выборка.Следующий() Цикл
			
			ГТДПоИмпорту = Выборка.ГТДПоИмпорту;
			НомерГТД     = Справочники.НомераГТД.НайтиПоКоду(Выборка.НомерГТД);
			
			Если Выборка.КоличествоОстаток = 0 Тогда
				Продолжить;							
			КонецЕсли;						
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Стоимость = Выборка.СебестоимостьОстаток;
			НоваяСтрока.КоличествоПоступление = Выборка.Количество;
			НоваяСтрока.ИнвойснаяСтоимость = Выборка.СуммаПоступленияВалОстаток;
			НоваяСтрока.ИнвойснаяСтоимостьРуб = Выборка.СуммаПоступленияОстаток;
			НоваяСтрока.НомерГТД = НомерГТД;
			
			НоваяСтрока.СтоимостьПриход = Выборка.Себестоимость;
			НоваяСтрока.Количество = Выборка.КоличествоОстаток;	
			
			//ДК уля
			Если Объект.ДатаРеализации >= Дата('20190101') Тогда 
				Если Выборка.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
					СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
				ИначеЕсли Выборка.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
					СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120;
				Иначе
					СтавкаНДС = Выборка.СтавкаНДС;
				КонецЕсли;
			Иначе
				СтавкаНДС = Выборка.СтавкаНДС;
			КонецЕсли;
			
			НоваяСтрока.СтавкаНДС = СтавкаНДС;
			//ДК

			
		КонецЦикла;
		
		СтрПартии.ГТДПоИмпорту = ГТДПоИмпорту;
		СтрПартии.НомерГТД	   = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
		
	КонецЦикла;
	
	ПоступленияДопРасходыПриИзмененииНаСервере();

	ПересчитатьИтоговуюСумму();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтоговуюСумму()

	Товары = Объект.Товары;
	
	Для каждого Стр Из Товары Цикл
		
		Стр.ПроцентНаценки = Окр(Стр.Наценка / Стр.ПолнаяСебестоимость * 100, 6);
		
		СуммаБезНДС = Стр.Стоимость + Стр.Наценка + Стр.ДопРасходы;
		Стр.СуммаБезНДС = СуммаБезНДС;
		
		СтавкаНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Стр.СтавкаНДС);
		Если СтавкаНДС = 10 ИЛИ СтавкаНДС = 18 ИЛИ СтавкаНДС = 20 Тогда
			СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;			
		Иначе
			СуммаНДС = 0;
		КонецЕсли;
		
		Стр.СуммаНДС = СуммаНДС;
		Стр.Сумма = СуммаБезНДС + СуммаНДС;
		
		Стр.Цена = Стр.Сумма / Стр.Количество;
	
	КонецЦикла;	
	
	Объект.СуммаРеализации = Объект.Товары.Итог("Сумма");
	Если Объект.Товары.Количество() > 0 Тогда 	
		Объект.НаценкаДокумента = Товары.Итог("ПроцентНаценки") / Объект.Товары.Количество();
	КонецЕсли;
	//Объект.НаценкаСуммой = Товары.Итог("Наценка");
		
КонецПроцедуры

&НаСервере
Процедура НаценкаПриИзмененииНаСервере()

	Товары = Объект.Товары.Выгрузить();
	Поступления = Объект.Поступления;
	
	Всего = 0;
	Остаток = 0;
	ОбщаяСумма = 0;
	Доля = 0;
	Для каждого Стр Из Поступления Цикл
		Всего = Всего + Стр.Всего;	
		Остаток = Остаток + Стр.Остаток;
		ОбщаяСумма = ОбщаяСумма + Стр.Всего + Стр.ДопРасходы;
	КонецЦикла;
	Если Всего <> 0 Тогда
		Доля = Остаток / Всего;
	КонецЕсли;
	
	СуммаНаценки = Объект.НаценкаСуммой + Окр(Доля * ОбщаяСумма * Объект.Наценка / 100, 2);
		
	Если СуммаНаценки = 0 Тогда
		Товары.ЗаполнитьЗначения(0, "Наценка");
		Товары.ЗаполнитьЗначения(0, "ПроцентНаценки");
	Иначе
		МассивРаспределенныхСтрок = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СуммаНаценки, Товары.ВыгрузитьКолонку("ПолнаяСебестоимость"));		
		Товары.ЗагрузитьКолонку(МассивРаспределенныхСтрок, "Наценка");	                                                                            	
	КонецЕсли;
			
	Объект.Товары.Загрузить(Товары);
	
	//ПересчитатьИтоговуюСумму();
	
	Объект.СуммаРеализации = Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОперацииНаСервере()
	Возврат Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары;
КонецФункции

&НаСервере
Процедура ПоступленияДопРасходыПриИзмененииНаСервере()

	Товары = Объект.Товары;
	Поступления = Объект.Поступления;
	
	ТоварыКопия = Товары.Выгрузить().СкопироватьКолонки();
	Для каждого Стр Из Поступления Цикл
		
		Если Стр.Всего = 0 Тогда
			Продолжить;					
		КонецЕсли;
		
		Доля = Стр.Остаток / Стр.Всего;
		СуммаДопРасходы = Доля * Стр.ДопРасходы;
	
		СтруктураОтбора = Новый Структура("Поступление", Стр.Поступление);                   
		Строки = Товары.НайтиСтроки(СтруктураОтбора);
		ОтобранныеСтроки = Товары.Выгрузить(Строки);
		Если НЕ ОтобранныеСтроки.Количество() = 0 Тогда
			Если ЗначениеЗаполнено(Стр.ДопРасходы) Тогда
				МассивРаспределенныхСтрок = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(СуммаДопРасходы, ОтобранныеСтроки.ВыгрузитьКолонку("ИнвойснаяСтоимость"));
				Если МассивРаспределенныхСтрок <> Неопределено Тогда 
					ОтобранныеСтроки.ЗагрузитьКолонку(МассивРаспределенныхСтрок, "ДопРасходы");
				Иначе
					ОтобранныеСтроки.ЗаполнитьЗначения(0, "ДопРасходы");
				КонецЕсли;
			Иначе
				ОтобранныеСтроки.ЗаполнитьЗначения(0, "ДопРасходы");
			КонецЕсли;
		КонецЕсли;		
		
		Для Каждого Эл Из ОтобранныеСтроки Цикл								
			НовСтр = ТоварыКопия.Добавить();	
			ЗаполнитьЗначенияСвойств(НовСтр, Эл);
			НовСтр.ПолнаяСебестоимость = НовСтр.Стоимость + НовСтр.ДопРасходы;
			
		КонецЦикла;
		
	КонецЦикла;	
	
	Товары.Загрузить(ТоварыКопия);
	
	НаценкаПриИзмененииНаСервере();
	
	ПересчитатьИтоговуюСумму();

КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()

	ОчиститьИЗаполнитьНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПоступленияПередУдалениемНаСервере(Поступление)

	Товары = Объект.Товары;
	Поступления = Объект.Поступления;
	
	СтруктураОтбора = Новый Структура("Поступление", Поступление);
	Строки = Товары.НайтиСтроки(СтруктураОтбора);
	Для каждого Стр Из Строки Цикл
		Товары.Удалить(Стр);				
	КонецЦикла;
		
	Если Объект.Поступления.Количество() = 1 ИЛИ Объект.Товары.Количество() = 0 Тогда
		Возврат;				
	КонецЕсли;
	
	ПоступленияДопРасходыПриИзмененииНаСервере();		

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНаСервере(ОбъектФормы)		
	
	СуммаРеализации = Объект.СуммаРеализации;
	Если СуммаРеализации = 0 ИЛИ НЕ Объект.НеПолнаяРеализация Тогда
		СуммаРеализации = Объект.Товары.Итог("Сумма");			
	КонецЕсли;
	
	СуммаРеализацииБезНДС = Объект.Товары.Итог("СуммаБезНДС");
	Себестоимость = Объект.Товары.Итог("Стоимость");
	ДопРасходы = Объект.Товары.Итог("ДопРасходы");
	
	Если ЗначениеЗаполнено(Объект.ДатаРеализации) Тогда
	    ОбъектФормы.Дата = Объект.ДатаРеализации;				
	КонецЕсли;	
	ОбъектФормы.дкПроцентНаценки = (СуммаРеализацииБезНДС / (Себестоимость + ДопРасходы) - 1) * 100;	
	
	Лимит = СуммаРеализации;
	Остаток = СуммаРеализации;	
	Набрано = 0;
	ДопРасходыВсего = 0;
	Для каждого Стр Из Объект.Товары Цикл
		Если Остаток >= 0 Тогда
		
			
			НоваяСтрока = ОбъектФормы.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			НоваяСтрока.Сумма = Стр.Сумма;
						
			Остаток = Остаток - Стр.Сумма;	
			
			Если Остаток < 0 Тогда							
				// тогда делим последнюю строку по количеству
				Остаток = Лимит - Набрано;
				КолСписать = Цел(Окр(Остаток/НоваяСтрока.Цена, 1, РежимОкругления.Окр15как10));
				НоваяСтрока.Количество = КолСписать;
				НоваяСтрока.Сумма = Окр(КолСписать * НоваяСтрока.Цена, 2);
				ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, Истина, Ложь);
				Остаток = -1;
			КонецЕсли;								
			
			Набрано = Набрано + Стр.Сумма;						
			
		КонецЕсли;		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Стр, ФормаПодчиненного)

	ТекущиеДанные = Стр;
	
	// Получим общие параметры обработки для реквизитов документа
	ПараметрыОбработки = РеализацияТоваровУслугФормыКлиент.ПодготовитьПараметрыОбработкиТоварыНоменклатураПриИзменении(
		ФормаПодчиненного, ТекущиеДанные);

	// Дополнительные поля, требующиеся для заполнения добавленных колонок табличного поля текущей формы.
	ПараметрыОбработки.ДанныеСтрокиТаблицы.Вставить("Всего", ТекущиеДанные.Всего);
	//ПараметрыОбработки.ДанныеСтрокиТаблицы.Вставить("АналитикаУчета", ТекущиеДанные.АналитикаУчета);
	//ПараметрыОбработки.ДанныеСтрокиТаблицы.Вставить("АналитикаУчетаЗаполнена", ТекущиеДанные.АналитикаУчетаЗаполнена);
	
	ЗаполнитьПараметрыОбъектаДляЗаполненияДобавленныхКолонок(ФормаПодчиненного, ПараметрыОбработки.ДанныеОбъекта);
	
	ТоварыНоменклатураПриИзмененииНаСервере(
		ПараметрыОбработки.ДанныеСтрокиТаблицы,
		ПараметрыОбработки.ДанныеОбъекта,
		ПараметрыОбработки.СчетаУчетаКЗаполнению);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПараметрыОбработки.ДанныеСтрокиТаблицы);		

КонецПроцедуры

&НаСервере
Процедура ПоступленияПослеУдаленияНаСервере()

	Поступления = Объект.Поступления;
	Товары = Объект.Товары;
	
	МассивПоступлений = Поступления.Выгрузить().ВыгрузитьКолонку("Поступление");
	ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(МассивПоступлений);
	Для Каждого Стр Из МассивПоступлений Цикл
		СтруктураОтбора = Новый Структура("Поступление", Стр);
		Строки = Товары.НайтиСтроки(СтруктураОтбора);
		Если НЕ Строки.Количество() = 0 Тогда
			Продолжить;					
		КонецЕсли;
		Строки = Поступления.НайтиСтроки(СтруктураОтбора);
		Для каждого Эл Из Строки Цикл
			Поступления.Удалить(Эл);					
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УчтемДопРасходы()

	// добавим запись в регистр сведений дкДопРасходы
	Для каждого Стр Из Объект.Поступления Цикл	
		Если НЕ Стр.ДопРасходы = 0 Тогда	
			
			Запись = РегистрыСведений.дкДопРасходы.СоздатьМенеджерЗаписи();
			Запись.Партия = Стр.Поступление;
			Запись.Прочитать();
			
			Если Запись.ДопРасход = Стр.ДопРасходы Тогда
				Возврат;							
			КонецЕсли;
			
			Запись.Партия = Стр.Поступление;
			Запись.ДопРасход = Стр.ДопРасходы;
			Запись.Записать();
			
			// добавим движения в регистр накопления дкКалькуляцияСтоимости
			НЗ = РегистрыНакопления.дкКалькуляцияСтоимости.СоздатьНаборЗаписей();
			НЗ.Отбор.Регистратор.Установить(Стр.Поступление);
			НЗ.Прочитать();
			
			ТоварыПоступление = Стр.Поступление.Товары;
			
			РаспределяемаяСумма = Стр.ДопРасходы;
			//МассивВесовыхКоэффициентов = ТоварыПоступление.Выгрузить("Сумма");
			БазаРаспределения = ТоварыПоступление.Итог("Сумма");
			Если БазаРаспределения = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если НЗ.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			//МассивРаспределенныхСумм = ОбщегоНазначенияБПКлиентСервер.РаспределитьПропорционально(РаспределяемаяСумма, МассивВесовыхКоэффициентов);
			//НЗ.ЗагрузитьКолонку(МассивРаспределенныхСумм, "ДопРасход");
			Для Каждого СтрРегистра Из НЗ Цикл
				СтрТовары = ТоварыПоступление.Найти(СтрРегистра.Товар);
				Если СтрТовары = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				СтрРегистра.ДопРасход = Окр(СтрТовары.Сумма / БазаРаспределения * РаспределяемаяСумма,2);		
			КонецЦикла;
			// остаток на первую строку
			Если НЗ.Итог("ДопРасход") <> РаспределяемаяСумма Тогда 
				Если НЗ.Количество() > 0 Тогда
					НЗ[0].ДопРасход = НЗ[0].ДопРасход + РаспределяемаяСумма - НЗ.Итог("ДопРасход");
				КонецЕсли;
			КонецЕсли;
			НЗ.Записать();
		
		КонецЕсли;			
	КонецЦикла;		

КонецПроцедуры

&НаСервере
Процедура ОчиститьИЗаполнитьНаСервере()

	МассивПартий = Объект.Поступления.Выгрузить().ВыгрузитьКолонку("Поступление"); 
	Объект.Поступления.Очистить();
	Объект.Товары.Очистить();
	ПересчитатьСтрокиНаСервере(МассивПартий);	

КонецПроцедуры


// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
///////////////////////////////////////


&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПараметрыОбъектаДляЗаполненияДобавленныхКолонок(Знач Форма, ПараметрыОбъекта)

	Объект = Форма.Объект;
	
	Если ТипЗнч(ПараметрыОбъекта) <> Тип("Структура") Тогда
		ПараметрыОбъекта = Новый Структура;
	КонецЕсли;
	
	ПараметрыОбъекта.Вставить("СуммаВключаетНДС", 	Объект.СуммаВключаетНДС);
	ПараметрыОбъекта.Вставить("ДокументБезНДС", 	Объект.ДокументБезНДС);
	ПараметрыОбъекта.Вставить("ПлательщикНДФЛ", 	Форма.ПлательщикНДФЛ);
	ПараметрыОбъекта.Вставить("СчетУчетаРасчетовСКонтрагентом", Объект.СчетУчетаРасчетовСКонтрагентом);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТоварыНоменклатураПриИзмененииНаСервере(СтрокаТабличнойЧасти, Знач ДанныеОбъекта, Знач СчетаУчетаКЗаполнению)

	Результат = СчетаУчетаВДокументах.ЗаполнитьРеквизитыПриИзменении(
		Документы.РеализацияТоваровУслуг,
		СчетаУчетаКЗаполнению,
		ДанныеОбъекта,
		"Товары",
		СтрокаТабличнойЧасти);
		
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Результат);
		
	//Если Не ЗначениеЗаполнено(ДанныеОбъекта.ТипЦен) Тогда
		ДанныеОбъекта.Вставить("СпособЗаполненияЦены", Перечисления.СпособыЗаполненияЦен.ПоПродажнымЦенам);
	//КонецЕсли;
	
	ЗаполнитьДобавленныеКолонкиСтрокиТаблицыТовары(СтрокаТабличнойЧасти, ДанныеОбъекта);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДобавленныеКолонкиСтрокиТаблицыТовары(СтрокаТабличнойЧасти, ПараметрыОбъекта)
	
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(ПараметрыОбъекта.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	
	ЗаполнитьАналитикуУчета(СтрокаТабличнойЧасти, ПараметрыОбъекта);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьАналитикуУчета(СтрокаТабличнойЧасти, ПараметрыОбъекта)
	
	Если Не СтрокаТабличнойЧасти.Свойство("АналитикаУчета") Тогда
		Возврат;
	КонецЕсли;
	
	// При вызове с клиента: чтобы сократить обмен с сервером, передадим только нужные данные
	// При вызове с сервера: функциональная опция может скрыть эти поля
	ДанныеЗаполнения = Новый Структура("СчетУчета, СчетДоходов, Субконто, СчетРасходов, СчетУчетаНДСПоРеализации, СуммаНДС");
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, СтрокаТабличнойЧасти);
	
	ОписаниеАналитикиУчета = ОписаниеАналитикиУчета(ДанныеЗаполнения, ПараметрыОбъекта);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ОписаниеАналитикиУчета);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеАналитикиУчета(Знач ДанныеСтроки, Знач ПараметрыОбъекта)
	
	Результат = Новый Структура;
	Результат.Вставить("АналитикаУчета",          "");
	Результат.Вставить("АналитикаУчетаЗаполнена", Истина);
	
	СчетУчетаЗабалансовый	= Ложь;
	ВидСубконтоНГ			= ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы;
	
	// СчетУчета
	Если ЗначениеЗаполнено(ДанныеСтроки.СчетУчета) Тогда
		СвойстваСчета 			 = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетУчета);
		СчетУчетаЗабалансовый 	 = СвойстваСчета.Забалансовый;
		Результат.АналитикаУчета = СвойстваСчета.Код;
	Иначе
		Результат.АналитикаУчета           = ОбщегоНазначенияБПКлиентСервер.ПредставлениеНезаполненногоЗначения();
		Результат.АналитикаУчетаЗаполнена  = Ложь;
	КонецЕсли;
	
	// Счета дохода, расхода и НДС учитываются, если счет учета товара незабалансовый
	Если НЕ СчетУчетаЗабалансовый Тогда
		Если ЗначениеЗаполнено(ДанныеСтроки.СчетДоходов) Тогда
			
			СвойстваСчета 		     = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетДоходов);
			Результат.АналитикаУчета = Результат.АналитикаУчета + ", " + СвойстваСчета.Код;
			
			Если СвойстваСчета.КоличествоСубконто >= 1 Тогда
				Если ЗначениеЗаполнено(ДанныеСтроки.Субконто) Тогда
					ТипСубконто = ТипЗнч(ДанныеСтроки.Субконто);
					ПредставлениеСубконто = "";
					
					Если Справочники.ТипВсеСсылки().СодержитТип(ТипСубконто) Тогда
						ПредставлениеСубконто = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.Субконто, "Представление");
					ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСубконто) Тогда
						ПредставлениеСубконто = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.Субконто, "Представление");
					Иначе
						ПредставлениеСубконто = Строка(ДанныеСтроки.Субконто);
					КонецЕсли;
					Если НЕ (СвойстваСчета.ВидСубконто1 = ВидСубконтоНГ И БухгалтерскийУчетВызовСервераПовтИсп.ИспользоватьОднуНоменклатурнуюГруппу()) Тогда
						Результат.АналитикаУчета = Результат.АналитикаУчета + ", " + ПредставлениеСубконто;
					КонецЕсли;
				Иначе
					Результат.АналитикаУчета = Результат.АналитикаУчета + ", <...>";
					
					// Заполнение субконто обязательно для ИП, когда на счете есть субконто "Номенклатурные группы".
					Если ПараметрыОбъекта.ПлательщикНДФЛ
						И (СвойстваСчета.ВидСубконто1 = ВидСубконтоНГ
							ИЛИ СвойстваСчета.ВидСубконто2 = ВидСубконтоНГ
							ИЛИ СвойстваСчета.ВидСубконто3 = ВидСубконтоНГ) Тогда
						Результат.АналитикаУчетаЗаполнена = Ложь;
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
	    	
	    Иначе
	    	Результат.АналитикаУчета          = Результат.АналитикаУчета + ", <...>";
			Результат.АналитикаУчетаЗаполнена = Ложь;
	    КонецЕсли;
		
	    Если ЗначениеЗаполнено(ДанныеСтроки.СчетРасходов) Тогда
	    	СвойстваСчета 		= БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетРасходов);
	    	Результат.АналитикаУчета = Результат.АналитикаУчета + ", " + СвойстваСчета.Код;
	    Иначе
	    	Результат.АналитикаУчета          = Результат.АналитикаУчета + ", <...>";
			Результат.АналитикаУчетаЗаполнена = Ложь;
	    КонецЕсли;
		
		Если Не ПараметрыОбъекта.ДокументБезНДС Тогда
			Если ЗначениеЗаполнено(ДанныеСтроки.СчетУчетаНДСПоРеализации) Тогда
				СвойстваСчета 		     = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки.СчетУчетаНДСПоРеализации);
				Результат.АналитикаУчета = Результат.АналитикаУчета + ", " + СвойстваСчета.Код;
			Иначе
				Если ДанныеСтроки.СуммаНДС <> 0 Тогда
					Результат.АналитикаУчета          = Результат.АналитикаУчета + ", <...>";
					Результат.АналитикаУчетаЗаполнена = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

	Возврат Результат;

КонецФункции



