#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьФайлыНаРаспознавание(Файлы) Экспорт
	
	ДлительныеОперации.СообщитьПрогресс(, НСтр("ru = 'Создание задания распознавания документов...'"));
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	
	Источник = Перечисления.ИсточникиПолученияФайлов.Вручную;
	
	Попытка
		
		ИменаФайлов = Новый Массив;
		Для Каждого Файл Из Файлы Цикл
			ИменаФайлов.Добавить(Файл.ИмяФайла);
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации(
			РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, , ,
			НСтр("ru = 'Отправлены файлы для распознавания:'") + Символы.ПС + СтрСоединить(ИменаФайлов, ", ")
		);
		
		ДатаСоздания = ТекущаяУниверсальнаяДата();
		
		ИдентификаторЗадания = РаспознаваниеДокументовSDK.СоздатьЗаданиеРаспознавания(ИменаФайлов, ДатаСоздания);
		
		ЗаписьЖурналаРегистрации(
			РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, , ,
			НСтр("ru = 'Получен идентификатор нового задания:'") + Символы.ПС + ИдентификаторЗадания
		);
		
		РегистрыСведений.ПредставлениеЗаданийРаспознаваниеДокументов.Записать(
			ИдентификаторЗадания, ДатаСоздания, ИменаФайлов, Источник);
		
		Результат = РаспознаваниеДокументовSDK.ПолучитьСостояниеОбработкиЗадания(ИдентификаторЗадания);
		
		Если Результат.ОбработкаЗавершена Или Результат.АдресаЗагрузкиФайлов.Количество() = 0 Тогда
			ВызватьИсключение НСтр("ru = 'Произошла ошибка при создании задания. Попробуйте повторить позже.'");
		КонецЕсли;
		
		РегистрыСведений.СостоянияЗаданийРаспознаваниеДокументов.ИзменитьСтатусОбработкиЗадания(
			ИдентификаторЗадания,
			Перечисления.СтатусыНаСервисеРаспознаваниеДокументов.Обрабатывается
		);
		
		ИндексФайла = 0;
		КоличествоФайлов = Файлы.Количество();
		Для Каждого АдресЗагрузкиФайла Из Результат.АдресаЗагрузкиФайлов Цикл
			
			ДлительныеОперации.СообщитьПрогресс(, СтрШаблон(
				НСтр("ru = 'Отправка файла %1 (%2 из %3)...'"),
				Файлы[ИндексФайла].ИмяФайла,
				ИндексФайла + 1,
				КоличествоФайлов
			));
			
			Попытка
				ИдентификаторФайла = РаспознаваниеДокументовSDK.ЗагрузкаФайлаПоАдресу(
					АдресЗагрузкиФайла,
					Файлы[ИндексФайла].ДвоичныеДанные
				);
			Исключение
				// Не удалось загрузить файл по адресу, который выдал сервис
				Продолжить;
			КонецПопытки;
			
			РегистрыСведений.ИсходныеДанныеЗаданийРаспознаваниеДокументов.Записать(
				ИдентификаторФайла,
				ИдентификаторЗадания,
				ДатаСоздания,
				Файлы[ИндексФайла],
				ПараметрыЗадания
			);
			
			ИндексФайла = ИндексФайла + 1;
			
		КонецЦикла;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
			РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru = 'Ошибка при создании задания распознавания'") + Символы.ПС
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Произошла ошибка при отправке:
			           |%1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		
	КонецПопытки;
	
КонецПроцедуры

Функция ОтправитьФайлыНаБыстроеРаспознавание(Файлы) Экспорт
	
	ДлительныеОперации.СообщитьПрогресс(, НСтр("ru = 'Создание задания распознавания документов...'"));
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	
	Источник = Перечисления.ИсточникиПолученияФайлов.Вручную;
	
	ФайлыИнфо = Новый Массив;
	
	ИндексФайла = 0;
	Для Каждого Файл Из Файлы Цикл
	
		Попытка
			
			ИменаФайлов = Новый Массив;
			ИменаФайлов.Добавить(Файл.ИмяФайла);
			
			ЗаписьЖурналаРегистрации(
				РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Информация, , ,
				НСтр("ru = 'Отправлены файлы для распознавания:'") + Символы.ПС + СтрСоединить(ИменаФайлов, ", ")
			);
			
			ДатаСоздания = ТекущаяУниверсальнаяДата();
			
			ИдентификаторЗадания = РаспознаваниеДокументовSDK.СоздатьЗаданиеБыстроеРаспознавание(ИменаФайлов, ДатаСоздания);
			
			ЗаписьЖурналаРегистрации(
				"РаспознаваниеДокументов.ФайлОтправленНаРаспознавание",
				УровеньЖурналаРегистрации.Информация, , ,
				СтрШаблон("Задание=%1", ИдентификаторЗадания)
			);
			
			ЗаписьЖурналаРегистрации(
				РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Информация, , ,
				НСтр("ru = 'Получен идентификатор нового задания:'") + Символы.ПС + ИдентификаторЗадания
			);
			
			Результат = РаспознаваниеДокументовSDK.ПолучитьСостояниеОбработкиЗадания(ИдентификаторЗадания);
			
			Если Результат.ОбработкаЗавершена Или Результат.АдресаЗагрузкиФайлов.Количество() = 0 Тогда
				ВызватьИсключение НСтр("ru = 'Произошла ошибка при создании задания. Попробуйте повторить позже.'");
			КонецЕсли;
			
			РегистрыСведений.СостоянияЗаданийРаспознаваниеДокументов.ИзменитьСтатусОбработкиЗадания(
				ИдентификаторЗадания,
				Перечисления.СтатусыНаСервисеРаспознаваниеДокументов.Загружено);
			
			КоличествоФайлов = Файлы.Количество();
			Для Каждого АдресЗагрузкиФайла Из Результат.АдресаЗагрузкиФайлов Цикл
				
				ДлительныеОперации.СообщитьПрогресс(, СтрШаблон(
					НСтр("ru = 'Отправка файла %1 (%2 из %3)...'"),
					Файлы[ИндексФайла].ИмяФайла,
					ИндексФайла + 1,
					КоличествоФайлов
				));
				
				Попытка
					ИдентификаторФайла = РаспознаваниеДокументовSDK.ЗагрузкаФайлаПоАдресу(
						АдресЗагрузкиФайла,
						Файлы[ИндексФайла].ДвоичныеДанные);
			
					ФайлИнфо = Новый Структура;
					ФайлИнфо.Вставить("ИмяФайла", Файлы[ИндексФайла].ИмяФайла);
					ФайлИнфо.Вставить("ИдентификаторЗадания", ИдентификаторЗадания);
					ФайлИнфо.Вставить("ИдентификаторВнутренний", Файлы[ИндексФайла].ИдентификаторВнутренний);
					ФайлИнфо.Вставить("АдресВременногоХранилищаФайла", Файлы[ИндексФайла].Адрес);
					
					ФайлыИнфо.Добавить(ФайлИнфо);
				Исключение
					// Не удалось загрузить файл по адресу, который выдал сервис
					ИндексФайла = ИндексФайла + 1;
					Продолжить;
				КонецПопытки;
				
				ИндексФайла = ИндексФайла + 1;
				
			КонецЦикла;
			
		Исключение
			
			ЗаписьЖурналаРегистрации(
				РаспознаваниеДокументов.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка, , ,
				НСтр("ru = 'Ошибка при создании задания распознавания'") + Символы.ПС
					+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
			
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Произошла ошибка при отправке:
				           |%1'"),
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
			);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("Файлы", ФайлыИнфо);
	
	Возврат Результат;
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОтправитьФайлыНаРаспознавание", Истина);
	Методы.Вставить("ОтправитьФайлыНаБыстроеРаспознавание", Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
