#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет набор записей при проведении документа - общим механизмом формирования движений и возвращает таблицу движений
// Расчеты при эквайринге
//
// Параметры:
//  Движения         - КоллекцияДвижений - коллекция движений документа
//  Оплаты           - ТаблицаЗначений - данные из документа Отчет розничных продаж
//  ВозвратОплат     - ТаблицаЗначений - данные из документа Отчет розничных продаж
//  ТаблицаРеквизиты - ТаблицаЗначений - общие для набора значения; состав колонок см. в теле процедуры
//  ТаблицаВыручка   - ТаблицаЗначений - данные по выручке из документа
//  ТаблицыВозврат - Структура - с ключами:
//                   * РеализованныеТоварыКомитентов - ТаблицаЗначений
//                   * СобственныеТоварыУслуги - ТаблицаЗначений
//                   * ТоварыУслугиКомитентов - ТаблицаЗначений
//  ИсключенныйНДСВозврат - Число - сумма исключаемого НДС, учтеная при возврате наличными
//
// Возвращаемое значение:
//  ТаблицаЗначений - структруа см.поля регистра РасчетыПриЭквайринге
//
Функция ДобавитьДвиженияОтчетОРозничныхПродажах(Движения, Оплаты, ВозвратОплат, ТаблицаРеквизиты, ТаблицаВыручка, ТаблицыВозврат, ИсключенныйНДСВозврат) Экспорт
	
	ТаблицаДвиженийВозвратов = СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Если Не ЗначениеЗаполнено(ТаблицаРеквизиты) Тогда
		Возврат ТаблицаДвиженийВозвратов;
	КонецЕсли;
	Реквизиты = ТаблицаРеквизиты[0];
	ТаблицаДвиженийВозвратов.Колонки.Добавить("ДатаДокументаРасчетов",
		ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	УчитыватьОплаты = Реквизиты.УчитыватьЗадолженностьУСН Или Реквизиты.УчитыватьЗадолженностьУСНПатент;
	
	Если ЗначениеЗаполнено(ТаблицаВыручка)
		И ТаблицаВыручка.Колонки.Найти("ИсключаемаяСуммаНДСБезнал") <> Неопределено Тогда
		ИсключаемаяСуммаНДСБезнал = ТаблицаВыручка[0].ИсключаемаяСуммаНДСБезнал;
	Иначе
		ИсключаемаяСуммаНДСБезнал = 0;
	КонецЕсли;
	
	Если ВозвратОплат <> Неопределено Тогда
		ВозвратыПлатежнойКартой = ВозвратОплат.НайтиСтроки(Новый Структура("ТипОплаты", Перечисления.ТипыОплат.ПлатежнаяКарта));
		ВозвратыКредита = ВозвратОплат.НайтиСтроки(Новый Структура("ТипОплаты", Перечисления.ТипыОплат.БанковскийКредит));
		
		ВидыОплат = ВозвратОплат.Скопировать(ВозвратыПлатежнойКартой, "Контрагент, ДоговорКонтрагента");
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			ВозвратОплат.Скопировать(ВозвратыКредита,"Контрагент, ДоговорКонтрагента"), ВидыОплат);
		
		ВозвратыВДокументе = ВозвратОплат.Скопировать(ВозвратыПлатежнойКартой, "Контрагент, ДоговорКонтрагента, СуммаРуб");
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			ВозвратОплат.Скопировать(ВозвратыКредита, "Контрагент, ДоговорКонтрагента, СуммаРуб"),
			ВозвратыВДокументе);
		ВозвратыВДокументе.Свернуть("Контрагент, ДоговорКонтрагента", "СуммаРуб");
		
		ЕстьВозвраты = Истина;
		ВозвратыВДокументе.Колонки.Добавить("СуммаНДС", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
		Если Реквизиты.УчитыватьЗадолженностьУСН Или Реквизиты.УчитыватьЗадолженностьУСНПатент Тогда
			СобственныеТоварыУслуги =
				ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТаблицыВозврат, "СобственныеТоварыУслуги", Неопределено);
			НДСВозврата = 0;
			Если СобственныеТоварыУслуги <> Неопределено Тогда
				НДСВозврата = НДСВозврата - СобственныеТоварыУслуги.Итог("СуммаНДСРуб");
			КонецЕсли;
			НДСВозврата = Макс(0, НДСВозврата + ИсключенныйНДСВозврат);
			Если НДСВозврата <> 0 Тогда
				Коэффициенты = ВозвратыВДокументе.ВыгрузитьКолонку("СуммаРуб");
				РаспределеннаяСумма = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
					НДСВозврата, Коэффициенты, 2);
				Если РаспределеннаяСумма <> Неопределено Тогда
					ВозвратыВДокументе.ЗагрузитьКолонку(РаспределеннаяСумма, "СуммаНДС");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ВозвратыВДокументе.Индексы.Добавить("Контрагент, ДоговорКонтрагента");
	Иначе
		ВозвратыВДокументе = Новый ТаблицаЗначений;
		ЕстьВозвраты = Ложь;
	КонецЕсли;
	
	Если Оплаты <> Неопределено И УчитыватьОплаты Тогда
		ОплатыПлатежнойКартой = Оплаты.НайтиСтроки(Новый Структура("ТипОплаты", Перечисления.ТипыОплат.ПлатежнаяКарта));
		ОплатыКредитом = Оплаты.НайтиСтроки(Новый Структура("ТипОплаты", Перечисления.ТипыОплат.БанковскийКредит));
		
		Если ВидыОплат = Неопределено Тогда
			ВидыОплат = Оплаты.Скопировать(ОплатыПлатежнойКартой, "Контрагент, ДоговорКонтрагента");
		Иначе
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
				Оплаты.Скопировать(ОплатыПлатежнойКартой, "Контрагент, ДоговорКонтрагента"), ВидыОплат);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			Оплаты.Скопировать(ОплатыКредитом, "Контрагент, ДоговорКонтрагента"), ВидыОплат);
		
		ОплатыВДокументе = Оплаты.Скопировать(ОплатыПлатежнойКартой, "Контрагент, ДоговорКонтрагента, СуммаРуб");
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			Оплаты.Скопировать(ОплатыКредитом, "Контрагент, ДоговорКонтрагента, СуммаРуб"),
			ОплатыВДокументе);
		ОплатыВДокументе.Свернуть("Контрагент, ДоговорКонтрагента", "СуммаРуб");
		
		ЕстьОплаты = Истина;
		ОплатыВДокументе.Колонки.Добавить("СуммаНДС", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
		Если ИсключаемаяСуммаНДСБезнал <> 0 Тогда
			Коэффициенты = ОплатыВДокументе.ВыгрузитьКолонку("СуммаРуб");
			РаспределеннаяСумма = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
				ИсключаемаяСуммаНДСБезнал, Коэффициенты, 2);
			Если РаспределеннаяСумма <> Неопределено Тогда
				ОплатыВДокументе.ЗагрузитьКолонку(РаспределеннаяСумма, "СуммаНДС");
			КонецЕсли;
		КонецЕсли;
		ОплатыВДокументе.Индексы.Добавить("Контрагент, ДоговорКонтрагента");
	Иначе
		ОплатыВДокументе = Новый ТаблицаЗначений;
		ЕстьОплаты = Ложь;
	КонецЕсли;
	
	Если Не ЕстьОплаты И Не ЕстьВозвраты Тогда
		Возврат ТаблицаДвиженийВозвратов;
	КонецЕсли;
	
	ВидыОплат.Свернуть("Контрагент, ДоговорКонтрагента");
	ВидыОплат = ПолучитьДанныеПоВидамОплат(ВидыОплат);
	ВидыОплат.Индексы.Добавить("Контрагент, ДоговорКонтрагента");
		
	АвансыСписанияПоЭквайрингу = РасчетыПоАвансам(Реквизиты, ВидыОплат);
	ОстаткиСписаний = АвансыСписанияПоЭквайрингу.ОстаткиСписаний;
	ОстаткиАвансов  = АвансыСписанияПоЭквайрингу.ОстаткиАвансов;
	
	Отбор = Новый Структура("Контрагент, ДоговорКонтрагента");
	ОтборПоРасчетномуДокументу = Новый Структура("Контрагент, ДоговорКонтрагента, РасчетныйДокумент");

	ПорядокУчетаСписываютсяСоСчета = Перечисления.ПорядокУчетаВозвратовПриЭквайринге.СписываютсяСоСчета;
	Если ЕстьОплаты Тогда
		Если УчитыватьОплаты Тогда
			
			// Запишем оплаты
			Если Не УчетнаяПолитика.ПлательщикНДФЛ(Реквизиты.Организация, Реквизиты.Период) Тогда
				Для Каждого ОплатаВДокументе Из ОплатыВДокументе Цикл
					НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ОплатаВДокументе);
					НоваяСтрока.РасчетныйДокумент = Реквизиты.Регистратор;
					НоваяСтрока.ДатаДокументаРасчетов = Реквизиты.Период;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Оплата;
					НоваяСтрока.Сумма = ОплатаВДокументе.СуммаРуб;
				КонецЦикла;
			КонецЕсли;
			
			// Закроем авансы, которые образовались до этого документа
			Для Каждого ОстатокАванса Из ОстаткиАвансов Цикл
				СуммаКРаспределению = - ОстатокАванса.СуммаОстаток;
				ЗаполнитьЗначенияСвойств(Отбор, ОстатокАванса);
				ОплатыПоВиду = ОплатыВДокументе.НайтиСтроки(Отбор);
				Для Каждого ОплатаПоВиду Из ОплатыПоВиду Цикл
					Если СуммаКРаспределению = 0 Тогда
						Прервать;
					КонецЕсли;
					
					Если ОплатаПоВиду.СуммаРуб > 0 Тогда
						// Уменьшаем оплату
						НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ОплатаПоВиду);
						НоваяСтрока.РасчетныйДокумент = Реквизиты.Регистратор;
						НоваяСтрока.ДатаДокументаРасчетов = Реквизиты.Период;
						НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
						НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Оплата;
						СуммаИспользованногоАванса = Мин(ОплатаПоВиду.СуммаРуб, СуммаКРаспределению);
						НоваяСтрока.Сумма = СуммаИспользованногоАванса;
						НоваяСтрока.СуммаНДС =
							?(ОплатаПоВиду.СуммаРуб = 0, 0, ОплатаПоВиду.СуммаНДС * (НоваяСтрока.Сумма / ОплатаПоВиду.СуммаРуб));
						
						СуммаКРаспределению = Макс(0, СуммаКРаспределению - НоваяСтрока.Сумма);
						
						ОплатаПоВиду.СуммаРуб = Макс(0, ОплатаПоВиду.СуммаРуб - НоваяСтрока.Сумма);
						ОплатаПоВиду.СуммаНДС = Макс(0, ОплатаПоВиду.СуммаНДС - НоваяСтрока.СуммаНДС);
						
						//Уменьшаем аванс
						НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ОплатаПоВиду);
						НоваяСтрока.РасчетныйДокумент = ОстатокАванса.РасчетныйДокумент;
						НоваяСтрока.ДатаДокументаРасчетов = ОстатокАванса.ДатаДокументаРасчетов;
						НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
						НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Оплата;
						НоваяСтрока.Сумма = СуммаИспользованногоАванса;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		// Распределение сумм оплат по возвратам, которые были оформлены ранее этого документа
		РасчетыПоВозвратам = РасчетыПоВозвратам(Реквизиты, Оплаты);
		ОстаткиВозвратов = РасчетыПоВозвратам.ОстаткиВозвратов;
		Для Каждого ОстатокВозврата Из ОстаткиВозвратов Цикл
			ЗаполнитьЗначенияСвойств(Отбор, ОстатокВозврата);
			
			// Распределять надо только при взаимозачете
			// Если не нашли вид оплаты - по умолчанию отражаем как взаимозачет
			ВидОплаты = ВидыОплат.НайтиСтроки(Отбор);
			Если ВидОплаты.Количество() > 0
					И ВидОплаты[0].ПорядокУчетаВозвратов = ПорядокУчетаСписываютсяСоСчета Тогда
				Продолжить;
			КонецЕсли;
			
			ОплатыПоВиду = ОплатыВДокументе.НайтиСтроки(Отбор);
			Для Каждого ОплатаПоВиду Из ОплатыПоВиду Цикл
				Если ОплатаПоВиду.СуммаРуб > 0 Тогда
					НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ОплатаПоВиду);
					НоваяСтрока.РасчетныйДокумент = ОстатокВозврата.РасчетныйДокумент;
					НоваяСтрока.ДатаДокументаРасчетов = ОстатокВозврата.ДатаДокументаРасчетов;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Возврат;
					НоваяСтрока.Сумма = Мин(ОплатаПоВиду.СуммаРуб, ОстатокВозврата.СуммаОстаток);
					НоваяСтрока.СуммаНДС =  Мин(ОплатаПоВиду.СуммаНДС, ОстатокВозврата.СуммаНДСОстаток);
					ОплатаПоВиду.СуммаРуб = Макс(0, ОплатаПоВиду.СуммаРуб - НоваяСтрока.Сумма);
					ОплатаПоВиду.СуммаНДС = Макс(0, ОплатаПоВиду.СуммаНДС - НоваяСтрока.СуммаНДС);
					
					// Возврат полностью перекрылся, необходимо сделать расходные записи по оплатам
					Если НоваяСтрока.Сумма = ОстатокВозврата.СуммаОстаток Тогда
						// Расход оплаты по текущему документу
						НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Отбор);
						НоваяСтрока.РасчетныйДокумент = Реквизиты.Регистратор;
						НоваяСтрока.ДатаДокументаРасчетов = Реквизиты.Период;
						НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
						НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Оплата;
						НоваяСтрока.Сумма = ОстатокВозврата.СуммаОстаток;
						НоваяСтрока.СуммаНДС = ОстатокВозврата.СуммаНДСОстаток;
						
						// Расход оплаты по прошлым документам
						ЗаполнитьЗначенияСвойств(ОтборПоРасчетномуДокументу, ОстатокВозврата);
						ОборотыВозвратов = РасчетыПоВозвратам.ОборотыВозвратов;
						ОборотыПоРасчетномуДокументу = ОборотыВозвратов.НайтиСтроки(ОтборПоРасчетномуДокументу);
						Для Каждого ОборотПоРасчетномуДокументу Из ОборотыПоРасчетномуДокументу Цикл
							НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Отбор);
							НоваяСтрока.РасчетныйДокумент = ОборотПоРасчетномуДокументу.Регистратор;
							НоваяСтрока.ДатаДокументаРасчетов = ОборотПоРасчетномуДокументу.ДатаРегистратора;
							НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
							НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Оплата;
							НоваяСтрока.Сумма = ОборотПоРасчетномуДокументу.СуммаРасход;
							НоваяСтрока.СуммаНДС = ОборотПоРасчетномуДокументу.СуммаНДСРасход;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла
		КонецЦикла;
	КонецЕсли;
	
	Если ЕстьВозвраты Тогда
		
		// Запишем возвраты
		Для Каждого ВозвратВДокументе Из ВозвратыВДокументе Цикл
			НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВозвратВДокументе);
			НоваяСтрока.РасчетныйДокумент = Реквизиты.Регистратор;
			НоваяСтрока.ДатаДокументаРасчетов = Реквизиты.Период;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Возврат;
			НоваяСтрока.Сумма = ВозвратВДокументе.СуммаРуб;
		КонецЦикла;
		
		// Закроем списания без документов, которые образовались до этого документа
		Для Каждого ОстатокСписаний Из ОстаткиСписаний Цикл
			СуммаКРаспределению = - ОстатокСписаний.СуммаОстаток;
			ЗаполнитьЗначенияСвойств(Отбор, ОстатокСписаний);
			ВозвратыПоВиду = ВозвратыВДокументе.НайтиСтроки(Отбор);
			Для Каждого ВозвратПоВиду Из ВозвратыПоВиду Цикл
				Если СуммаКРаспределению = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если ВозвратПоВиду.СуммаРуб > 0 Тогда
					// Уменьшаем оплату
					НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВозвратПоВиду);
					НоваяСтрока.РасчетныйДокумент = Реквизиты.Регистратор;
					НоваяСтрока.ДатаДокументаРасчетов = Реквизиты.Период;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Возврат;
					СуммаИспользованногоСписания = Мин(ВозвратПоВиду.СуммаРуб, СуммаКРаспределению);
					НоваяСтрока.Сумма = СуммаИспользованногоСписания;
					НоваяСтрока.СуммаНДС =
						?(ВозвратПоВиду.СуммаРуб = 0, 0, ВозвратПоВиду.СуммаНДС * (НоваяСтрока.Сумма / ВозвратПоВиду.СуммаРуб));
					
					СуммаКРаспределению = Макс(0, СуммаКРаспределению - НоваяСтрока.Сумма);
					
					ВозвратПоВиду.СуммаРуб = Макс(0, ВозвратПоВиду.СуммаРуб - НоваяСтрока.Сумма);
					ВозвратПоВиду.СуммаНДС = Макс(0, ВозвратПоВиду.СуммаНДС - НоваяСтрока.СуммаНДС);
					
					//Уменьшаем аванс
					НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВозвратПоВиду);
					НоваяСтрока.РасчетныйДокумент = ОстатокСписаний.РасчетныйДокумент;
					НоваяСтрока.ДатаДокументаРасчетов = ОстатокСписаний.ДатаДокументаРасчетов;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Возврат;
					НоваяСтрока.Сумма = СуммаИспользованногоСписания;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		// Распределим возвраты по незакрытым оплатам
		ОстаткиОплат = РасчетыПоОплатам(Реквизиты, ВозвратОплат);
		Для Каждого ОстатокОплаты Из ОстаткиОплат Цикл
			ЗаполнитьЗначенияСвойств(Отбор, ОстатокОплаты);
			
			// Распределять надо только при взаимозачете
			// Если не нашли вид оплаты - по умолчанию отражаем как взаимозачет
			ВидОплаты = ВидыОплат.НайтиСтроки(Отбор);
			Если ВидОплаты.Количество() > 0
					И ВидОплаты[0].ПорядокУчетаВозвратов = ПорядокУчетаСписываютсяСоСчета Тогда
				Продолжить;
			КонецЕсли;
			
			ВозвратыПоВиду = ВозвратыВДокументе.НайтиСтроки(Отбор);
			Для Каждого ВозвратПоВиду Из ВозвратыПоВиду Цикл
				СуммаЗачетаВозврата = 0;
				СуммаНДСЗачетаВозврата = 0;
				СуммаВозврата = ВозвратПоВиду.СуммаРуб;
				СуммаВозвратаНДС = ВозвратПоВиду.СуммаНДС;
				Если СуммаВозврата > 0 Или СуммаВозвратаНДС > 0 Тогда
					НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВозвратПоВиду);
					НоваяСтрока.РасчетныйДокумент = Реквизиты.Регистратор;
					НоваяСтрока.ДатаДокументаРасчетов = Реквизиты.Период;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Возврат;
					СуммаЗачетаВозврата = Мин(ВозвратПоВиду.СуммаРуб, ОстатокОплаты.СуммаОстаток);
					СуммаНДСЗачетаВозврата = Мин(ВозвратПоВиду.СуммаНДС, ОстатокОплаты.СуммаНДСОстаток);
					НоваяСтрока.Сумма = СуммаЗачетаВозврата;
					НоваяСтрока.СуммаНДС = СуммаНДСЗачетаВозврата;
					ВозвратПоВиду.СуммаРуб = Макс(0, ВозвратПоВиду.СуммаРуб - СуммаЗачетаВозврата);
					ВозвратПоВиду.СуммаНДС = Макс(0, ВозвратПоВиду.СуммаНДС - СуммаНДСЗачетаВозврата);
				КонецЕсли;
				
				// Возврат полностью перекрыт, нобходимо уменьшить оплаты на эту сумму
				Если ВозвратПоВиду.СуммаРуб = 0 И ВозвратПоВиду.СуммаНДС = 0
					И (СуммаВозврата > 0 Или СуммаВозвратаНДС > 0) Тогда
					НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВозвратПоВиду);
					НоваяСтрока.РасчетныйДокумент = ОстатокОплаты.РасчетныйДокумент;
					НоваяСтрока.ДатаДокументаРасчетов = ОстатокОплаты.ДатаДокументаРасчетов;
					// Аванс перекрываем приходом, оплаты - расходом
					Если ТипЗнч(ОстатокОплаты.РасчетныйДокумент) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
						НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
					Иначе
						НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
					КонецЕсли;
					НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Оплата;
					НоваяСтрока.Сумма = СуммаЗачетаВозврата;
					НоваяСтрока.СуммаНДС = СуммаНДСЗачетаВозврата;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	// Необходимо распределить по возвратам в документе
	Если ЕстьОплаты И ОплатыВДокументе.Итог("СуммаРуб") <> 0 Тогда
		// Удалим строки с нулевыми суммами
		Для Каждого ОплатаВДокументе Из ОплатыВДокументе Цикл
			Если ОплатаВДокументе.СуммаРуб = 0 Тогда
				ОплатыВДокументе.Удалить(ОплатаВДокументе);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ВозвратВДокументе Из ВозвратыВДокументе Цикл
			ЗаполнитьЗначенияСвойств(Отбор, ВозвратВДокументе);
			
			// Распределять надо только при взаимозачете
			// Если не нашли вид оплаты - по умолчанию отражаем как взаимозачет
			ВидОплаты = ВидыОплат.НайтиСтроки(Отбор);
			Если ВидОплаты.Количество() > 0
					И ВидОплаты[0].ПорядокУчетаВозвратов = ПорядокУчетаСписываютсяСоСчета Тогда
				Продолжить;
			КонецЕсли;
			
			ОплатыПоВиду = ОплатыВДокументе.НайтиСтроки(Отбор);
			Для Каждого ОплатаПоВиду Из ОплатыПоВиду Цикл
				СуммаЗачетаВозврата = 0;
				СуммаНДСЗачетаВозврата = 0;
				Если ОплатаПоВиду.СуммаРуб > 0 Тогда
					НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ОплатаПоВиду);
					НоваяСтрока.РасчетныйДокумент = Реквизиты.Регистратор;
					НоваяСтрока.ДатаДокументаРасчетов = Реквизиты.Период;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Возврат;
					СуммаЗачетаВозврата = Мин(ОплатаПоВиду.СуммаРуб, ВозвратВДокументе.СуммаРуб);
					СуммаНДСЗачетаВозврата = Мин(ОплатаПоВиду.СуммаНДС, ВозвратВДокументе.СуммаНДС);
					НоваяСтрока.Сумма = СуммаЗачетаВозврата;
					НоваяСтрока.СуммаНДС = СуммаНДСЗачетаВозврата;
					ОплатаПоВиду.СуммаРуб = Макс(0, ОплатаПоВиду.СуммаРуб - НоваяСтрока.Сумма);
				КонецЕсли;
				
				// Возврат полностью перекрыт, необходимо уменьшить оплаты на эту сумму
				Если ВозвратВДокументе.СуммаРуб = СуммаЗачетаВозврата
					И ВозвратВДокументе.СуммаНДС = СуммаНДСЗачетаВозврата
					И (СуммаЗачетаВозврата <> 0 Или СуммаНДСЗачетаВозврата <> 0) Тогда
					
					НоваяСтрока = ТаблицаДвиженийВозвратов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизиты);
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВозвратВДокументе);
					НоваяСтрока.РасчетныйДокумент = Реквизиты.Регистратор;
					НоваяСтрока.ДатаДокументаРасчетов = Реквизиты.Период;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
					НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Оплата;
					НоваяСтрока.Сумма = СуммаЗачетаВозврата;
					НоваяСтрока.СуммаНДС = СуммаНДСЗачетаВозврата;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	// Дополним набор записей
	НаборЗаписей = Движения.РасчетыПриЭквайринге;
	НаборЗаписей.Записывать = Истина;
	ТаблицаДвиженийВозвратов.ЗаполнитьЗначения(Истина, "Активность");
	Для Каждого СтрокаВозврата Из ТаблицаДвиженийВозвратов Цикл
	
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаВозврата);
		ЗаполнитьЗначенияСвойств(Запись, Реквизиты, "Период, Организация");
		
	КонецЦикла;
	
	Возврат ТаблицаДвиженийВозвратов;
	
КонецФункции

// Возвращает таблицу значений с данными по видам оплат
//
// Параметры:
//  ВидыОплат - ТаблицаЗначений
//              *Контрагент - СправочникСсылка.Контрагент
//              *ДоговорКонтрагента - СправочникСсылка.ДоговорыКонтрагентов
//
// Возвращаемое значение:
//  ТаблицаЗначений
//     *Контрагент - СправочникСсылка.Контрагент
//     *ДоговорКонтрагента - СправочникСсылка.ДоговорыКонтрагентов
//     *ПорядокУчетаВозвратов - ПеречислениеСсылка.ПорядокУчетаВозвратовПриЭквайринге
//
Функция ПолучитьДанныеПоВидамОплат(ВидыОплат) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВидыОплатОрганизаций.Контрагент КАК Контрагент,
		|	ВидыОплатОрганизаций.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВидыОплатОрганизаций.ПорядокУчетаВозвратов КАК ПорядокУчетаВозвратов
		|ИЗ
		|	Справочник.ВидыОплатОрганизаций КАК ВидыОплатОрганизаций
		|ГДЕ
		|	ВидыОплатОрганизаций.Контрагент В(&Контрагент)
		|	И ВидыОплатОрганизаций.ДоговорКонтрагента В(&ДоговорКонтрагента)
		|	И НЕ ВидыОплатОрганизаций.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент,
		|	ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента",
		ОбщегоНазначения.ВыгрузитьКолонку(ВидыОплат, "ДоговорКонтрагента", Истина));
	Запрос.УстановитьПараметр("Контрагент",
		ОбщегоНазначения.ВыгрузитьКолонку(ВидыОплат, "Контрагент", Истина));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Дата с которой перестаем закрывать остатки по эквайрингу в Прочих расчетах
// 
// Возвращаемое значение:
//  Дата - дата окончания
//
Функция ДатаОкончанияЗакрытияОстатковПрочихРасчетов() Экспорт
	Возврат Дата(2027, 01, 01);
КонецФункции

// Возвращает таблицу значений с суммами первоначальных возвратов при эквайринге, по которым еще есть остатки в регистре
//
// Параметры:
//  Параметры - Структура - с ключами:
//         *Организация - СправочникСсылка.Организации - организация
//         *Период - Дата - дата отражения изменений в регистре
//         *Регистратор - ДокументСсылка.ОтчетОРозничныхПродажах,
//                        ДокументСсылка.ОплатаПлатежнойКартой - регистратор возврата по эквайрингу
//         *ВидОперации - ПеречислениеСсылка.ВидыРасчетовПоЭквайрингу - вид расчетов, рассчитываем, если Возврат
//  ТаблицаОплат - ТаблицаЗначений - взаиморасчеты
//  Движения     - РегистрНакопленияНаборЗаписей.РасчетыПриЭквайринге - набор движений регистра РасчетыПриЭквайринге
// 
// Возвращаемое значение:
//  Неопределено, ТаблицаЗначений - см.структуру регистра Расчеты при эквайринге
//
Функция ТаблицаВозвратЭквайеру(Параметры, ТаблицаОплат, Движения = Неопределено) Экспорт
	
	Организация = Параметры.Организация;
	Период      = Параметры.Период;
	Регистратор = Параметры.Регистратор;
	ВидОперации = Параметры.ВидОперации;
	
	Если Не ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратЭквайеру Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТаблицаОплат) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОплатыПоВиду = ТаблицаОплат.Скопировать(, "Контрагент, ДоговорКонтрагента, СуммаВзаиморасчетов");
	ОплатыПоВиду.Свернуть("Контрагент, ДоговорКонтрагента", "СуммаВзаиморасчетов");
	
	Контрагенты = ОбщегоНазначения.ВыгрузитьКолонку(ОплатыПоВиду, "Контрагент", Истина);
	ДоговорыКонтрагентов = ОбщегоНазначения.ВыгрузитьКолонку(ОплатыПоВиду, "ДоговорКонтрагента", Истина);
	
	// Получим незакрытые возвраты из регистра Расчеты при эквайринге
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыПриЭквайрингеОстатки.Контрагент КАК Контрагент,
		|	РасчетыПриЭквайрингеОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	РасчетыПриЭквайрингеОстатки.РасчетныйДокумент КАК РасчетныйДокумент
		|ПОМЕСТИТЬ ВТ_ПриходыВозвратовЭквайринг
		|ИЗ
		|	РегистрНакопления.РасчетыПриЭквайринге.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Контрагент В (&Контрагенты)
		|				И ДоговорКонтрагента В (&ДоговорыКонтрагентов)
		|				И ВидРасчетов = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЭквайрингу.Возврат)) КАК РасчетыПриЭквайрингеОстатки
		|ГДЕ
		|	РасчетыПриЭквайрингеОстатки.СуммаОстаток + РасчетыПриЭквайрингеОстатки.СуммаНДСОстаток <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПриЭквайрингеОбороты.Регистратор КАК Регистратор,
		|	РасчетыПриЭквайрингеОбороты.Контрагент КАК Контрагент,
		|	РасчетыПриЭквайрингеОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	РасчетыПриЭквайрингеОбороты.РасчетныйДокумент КАК РасчетныйДокумент,
		|	РасчетыПриЭквайрингеОбороты.СуммаПриход КАК СуммаПриход,
		|	РасчетыПриЭквайрингеОбороты.СуммаНДСПриход КАК СуммаНДСПриход
		|ИЗ
		|	РегистрНакопления.РасчетыПриЭквайринге.Обороты(
		|			,
		|			&Период,
		|			Регистратор,
		|			(Контрагент, ДоговорКонтрагента, РасчетныйДокумент) В
		|				(ВЫБРАТЬ
		|					ВТ_ПриходыВозвратовЭквайринг.Контрагент,
		|					ВТ_ПриходыВозвратовЭквайринг.ДоговорКонтрагента,
		|					ВТ_ПриходыВозвратовЭквайринг.РасчетныйДокумент
		|				ИЗ
		|					ВТ_ПриходыВозвратовЭквайринг КАК ВТ_ПриходыВозвратовЭквайринг)) КАК РасчетыПриЭквайрингеОбороты
		|ГДЕ
		|	РасчетыПриЭквайрингеОбороты.Регистратор = РасчетыПриЭквайрингеОбороты.РасчетныйДокумент";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.УстановитьПараметр("ДоговорыКонтрагентов", ДоговорыКонтрагентов);
	Запрос.УстановитьПараметр("Период",
		Новый Граница(Регистратор.МоментВремени(), ВидГраницы.Исключая));
	
	ВозвратыОплаты = Запрос.Выполнить().Выгрузить();
	ТаблицаДвиженияРасчетовПриЭквайринге = СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	ОтборПоВидуОплаты = Новый Структура("Контрагент, ДоговорКонтрагента");
	
	Для Каждого Оплата Из ОплатыПоВиду Цикл
		ЗаполнитьЗначенияСвойств(ОтборПоВидуОплаты, Оплата);
		СтрокиВозвратаОплаты = ВозвратыОплаты.НайтиСтроки(ОтборПоВидуОплаты);
		
		СуммаКРаспределению = Оплата.СуммаВзаиморасчетов;
		
		Для Каждого СтрокаВозврата Из СтрокиВозвратаОплаты Цикл
			Если СуммаКРаспределению <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаДвиженияРасчетовПриЭквайринге.Добавить();
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.Контрагент = Оплата.Контрагент;
			НоваяСтрока.ДоговорКонтрагента = Оплата.ДоговорКонтрагента;
			НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Возврат;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.РасчетныйДокумент = СтрокаВозврата.РасчетныйДокумент;
			
			НоваяСтрока.Сумма = Мин(СуммаКРаспределению, СтрокаВозврата.СуммаПриход);
			НоваяСтрока.СуммаНДС = СтрокаВозврата.СуммаНДСПриход;
			СуммаКРаспределению = Макс(0, СуммаКРаспределению - НоваяСтрока.Сумма);
		КонецЦикла;
		
		// Если осталась нераспределенная сумма, значит списание отражено раньше, чем ОРП
		// необходимо сделать запись с Расчетным документом Списание с расчетного счета
		Если СуммаКРаспределению > 0 Тогда
			НоваяСтрока = ТаблицаДвиженияРасчетовПриЭквайринге.Добавить();
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.Контрагент = Оплата.Контрагент;
			НоваяСтрока.ДоговорКонтрагента = Оплата.ДоговорКонтрагента;
			НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЭквайрингу.Возврат;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.РасчетныйДокумент = Регистратор;
			НоваяСтрока.Сумма = СуммаКРаспределению;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДвиженияРасчетовПриЭквайринге.ЗаполнитьЗначения(Истина, "Активность");
	ТаблицаДвиженияРасчетовПриЭквайринге.ЗаполнитьЗначения(Период, "Период");
	
	// При совмещении патентной системы и ОСНО движения "Расчеты при эквайринге"
	// формируются при проведении по регистрам ИП.
	Если ТаблицаДвиженияРасчетовПриЭквайринге.Количество() <> 0 И Движения <> Неопределено
		И Не УчетнаяПолитика.ПлательщикНДФЛ(Организация, Период) Тогда
		Движения.Записывать = Истина;
		Для Каждого СтрокаВозврата Из ТаблицаДвиженияРасчетовПриЭквайринге Цикл
			Запись = Движения.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаВозврата);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаДвиженияРасчетовПриЭквайринге;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РасчетыПоАвансам(Реквизиты, ВидыОплат)
	
	Контрагенты = ОбщегоНазначения.ВыгрузитьКолонку(ВидыОплат, "Контрагент", Истина);
	ДоговорыКонтрагентов = ОбщегоНазначения.ВыгрузитьКолонку(ВидыОплат, "ДоговорКонтрагента", Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыПриЭквайрингеОстатки.Контрагент КАК Контрагент,
		|	РасчетыПриЭквайрингеОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	РасчетыПриЭквайрингеОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	ЕСТЬNULL(РеквизитыДокументовОплаты.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокументаРасчетов,
		|	РасчетыПриЭквайрингеОстатки.СуммаОстаток КАК СуммаОстаток,
		|	РасчетыПриЭквайрингеОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыПриЭквайринге.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Контрагент В (&Контрагенты)
		|				И ДоговорКонтрагента В (&ДоговорыКонтрагентов)
		|				И ВидРасчетов = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЭквайрингу.Возврат)
		|				И ТИПЗНАЧЕНИЯ(РасчетныйДокумент) = ТИП(Документ.СписаниеСРасчетногоСчета)) КАК РасчетыПриЭквайрингеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК РеквизитыДокументовОплаты
		|		ПО (РеквизитыДокументовОплаты.Организация = &Организация)
		|			И РасчетыПриЭквайрингеОстатки.РасчетныйДокумент = РеквизитыДокументовОплаты.Документ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент,
		|	ДоговорКонтрагента,
		|	РасчетныйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПриЭквайрингеОстатки.Контрагент КАК Контрагент,
		|	РасчетыПриЭквайрингеОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	РасчетыПриЭквайрингеОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	ЕСТЬNULL(РеквизитыДокументовОплаты.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокументаРасчетов,
		|	РасчетыПриЭквайрингеОстатки.СуммаОстаток КАК СуммаОстаток,
		|	РасчетыПриЭквайрингеОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыПриЭквайринге.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Контрагент В (&Контрагенты)
		|				И ДоговорКонтрагента В (&ДоговорыКонтрагентов)
		|				И ВидРасчетов = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЭквайрингу.Оплата)
		|				И ТИПЗНАЧЕНИЯ(РасчетныйДокумент) = ТИП(Документ.ПоступлениеНаРасчетныйСчет)) КАК РасчетыПриЭквайрингеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК РеквизитыДокументовОплаты
		|		ПО (РеквизитыДокументовОплаты.Организация = &Организация)
		|			И РасчетыПриЭквайрингеОстатки.РасчетныйДокумент = РеквизитыДокументовОплаты.Документ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент,
		|	ДоговорКонтрагента,
		|	РасчетныйДокумент";
	
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(Реквизиты.Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.УстановитьПараметр("ДоговорыКонтрагентов", ДоговорыКонтрагентов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	Результат = Новый Структура();
	Результат.Вставить("ОстаткиСписаний", РезультатЗапроса[0].Выгрузить());
	Результат.Вставить("ОстаткиАвансов", РезультатЗапроса[1].Выгрузить());
	
	Возврат Результат;
	
КонецФункции

Функция РасчетыПоВозвратам(Реквизиты, ТаблицаОплаты)
	
	Контрагенты = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаОплаты, "Контрагент", Истина);
	ДоговорыКонтрагентов = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаОплаты, "ДоговорКонтрагента", Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыПриЭквайрингеОстатки.Контрагент КАК Контрагент,
		|	РасчетыПриЭквайрингеОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	РасчетыПриЭквайрингеОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	ЕСТЬNULL(РеквизитыДокументовОплаты.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокументаРасчетов,
		|	РасчетыПриЭквайрингеОстатки.СуммаОстаток КАК СуммаОстаток,
		|	РасчетыПриЭквайрингеОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток
		|ПОМЕСТИТЬ втОстаткиВозвратов
		|ИЗ
		|	РегистрНакопления.РасчетыПриЭквайринге.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Контрагент В (&Контрагенты)
		|				И ДоговорКонтрагента В (&ДоговорыКонтрагентов)
		|				И ВидРасчетов = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЭквайрингу.Возврат)) КАК РасчетыПриЭквайрингеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК РеквизитыДокументовОплаты
		|		ПО (РеквизитыДокументовОплаты.Организация = &Организация)
		|			И РасчетыПриЭквайрингеОстатки.РасчетныйДокумент = РеквизитыДокументовОплаты.Документ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагент,
		|	ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПриЭквайрингеОбороты.Регистратор КАК Регистратор,
		|	ЕСТЬNULL(РеквизитыДокументовОплаты.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистратора,
		|	РасчетыПриЭквайрингеОбороты.РасчетныйДокумент КАК РасчетныйДокумент,
		|	втОстаткиВозвратов.ДатаДокументаРасчетов КАК ДатаДокументаРасчетов,
		|	РасчетыПриЭквайрингеОбороты.Контрагент КАК Контрагент,
		|	РасчетыПриЭквайрингеОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	РасчетыПриЭквайрингеОбороты.СуммаРасход КАК СуммаРасход,
		|	РасчетыПриЭквайрингеОбороты.СуммаНДСРасход КАК СуммаНДСРасход
		|ИЗ
		|	втОстаткиВозвратов КАК втОстаткиВозвратов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПриЭквайринге.Обороты(
		|				,
		|				&КонецПериода,
		|				Регистратор,
		|				Организация = &Организация
		|					И Контрагент В (&Контрагенты)
		|					И ДоговорКонтрагента В (&ДоговорыКонтрагентов)
		|					И ВидРасчетов = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЭквайрингу.Возврат)) КАК РасчетыПриЭквайрингеОбороты
		|		ПО втОстаткиВозвратов.РасчетныйДокумент = РасчетыПриЭквайрингеОбороты.РасчетныйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК РеквизитыДокументовОплаты
		|		ПО (РеквизитыДокументовОплаты.Организация = &Организация)
		|			И (РасчетыПриЭквайрингеОбороты.Регистратор = РеквизитыДокументовОплаты.Документ)
		|ГДЕ
		|	(РасчетыПриЭквайрингеОбороты.СуммаРасход <> 0
		|			ИЛИ РасчетыПриЭквайрингеОбороты.СуммаНДСРасход <> 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент,
		|	ДоговорКонтрагента,
		|	РасчетныйДокумент";
	
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(Реквизиты.Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.УстановитьПараметр("ДоговорыКонтрагентов", ДоговорыКонтрагентов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	Результат = Новый Структура();
	Результат.Вставить("ОстаткиВозвратов", РезультатЗапроса[0].Выгрузить());
	Результат.Вставить("ОборотыВозвратов", РезультатЗапроса[1].Выгрузить());
	
	Возврат Результат;
	
КонецФункции

Функция РасчетыПоОплатам(Реквизиты, ТаблицаВозвраты)
	
	Контрагенты = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаВозвраты, "Контрагент", Истина);
	ДоговорыКонтрагентов = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаВозвраты, "ДоговорКонтрагента", Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыПриЭквайрингеОстатки.Контрагент КАК Контрагент,
		|	РасчетыПриЭквайрингеОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	РасчетыПриЭквайрингеОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
		|	ЕСТЬNULL(РеквизитыДокументовОплаты.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокументаРасчетов,
		|	РасчетыПриЭквайрингеОстатки.СуммаОстаток КАК СуммаОстаток,
		|	РасчетыПриЭквайрингеОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыПриЭквайринге.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Контрагент В (&Контрагенты)
		|				И ДоговорКонтрагента В (&ДоговорыКонтрагентов)
		|				И ВидРасчетов = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЭквайрингу.Оплата)) КАК РасчетыПриЭквайрингеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК РеквизитыДокументовОплаты
		|		ПО (РеквизитыДокументовОплаты.Организация = &Организация)
		|			И РасчетыПриЭквайрингеОстатки.РасчетныйДокумент = РеквизитыДокументовОплаты.Документ
		|ГДЕ
		|	РасчетыПриЭквайрингеОстатки.СуммаОстаток + РасчетыПриЭквайрингеОстатки.СуммаНДСОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагент,
		|	ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.УстановитьПараметр("ДоговорыКонтрагентов", ДоговорыКонтрагентов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
