
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Элементы.НадписьОшибка.Заголовок = НСтр("ru = 'Возникли ошибки:'");
		
	ПозицияСкобки = СтрНайти(Параметры.ОписаниеОшибки, "{");
	Если ПозицияСкобки = 0 Тогда
		
		ОписаниеОшибки = Параметры.ОписаниеОшибки;
		Элементы.ГруппаПодробнее.Видимость = Ложь;
		
	Иначе
		
		ОписаниеОшибки = Лев(Параметры.ОписаниеОшибки, ПозицияСкобки - 1);
		ПодробноеОписаниеОшибки = Сред(Параметры.ОписаниеОшибки, ПозицияСкобки + 1);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
