// Регистрация БП: Полный от 25.09.2026 14:30:10
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает представление регистрации.
// Возвращаемое значение:
//  Строка.
Функция ИнформацияОПравилах() Экспорт

	Параметры = ПараметрыРегистрации();
	ШаблонТекста = НСтр("ru = 'Правила регистрации объектов этой информационной базы (%1 версия %2) от %3'");
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(ШаблонТекста, 
		Параметры.СинонимКонфигурации, Параметры.ВерсияКонфигурации, Параметры.ДатаВремяСоздания);	
	
КонецФункции

// Возвращает ключевые параметры регистрации в виде структуры.
// Возвращаемое значение:
//  Структура.
Функция ПараметрыРегистрации() Экспорт
	Результат = Новый Структура();
	Наименование = НСтр("ru = 'БП: Полный'");
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("ДатаВремяСоздания", Дата(2026,9,25,14,30,0));
	Результат.Вставить("ПланаОбмена", "Полный");
	Результат.Вставить("Конфигурация", "БухгалтерияПредприятияКОРП");
	СинонимКонфигурации = "Бухгалтерия предприятия КОРП, редакция 3.0";
	ТекстСинонимКонфигурации = НСтр("ru = '%1'");
	ТекстСинонимКонфигурации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСинонимКонфигурации, СинонимКонфигурации);
	Результат.Вставить("СинонимКонфигурации", ТекстСинонимКонфигурации);
	Результат.Вставить("ВерсияКонфигурации", "3.0.208.5");

	Возврат Результат;
КонецФункции

// Заполняет таблицу правил регистрации объектов.
//
// Параметры:
//  ПравилаРегистрацииОбъектов - ТаблицаЗначений - таблица значений, в которую добавляются правила
//  ИмяМенеджераРегистрации - Строка - Имя модуля менеджера правил регистрации объектов 
Процедура ИнициализацияПравилРегистрации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации) Экспорт
	Если ПравилаРегистрацииОбъектов.Колонки.Найти("Идентификатор") = Неопределено Тогда
		ПравилаРегистрацииОбъектов.Колонки.Добавить("Идентификатор");
	КонецЕсли;
	ДобавитьПРО_РегистрСведений_ПеренесенныеРабочиеДни(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_РазмерВычетовНДФЛ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_СтавкаРефинансированияЦБ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_ЗадачиБухгалтера(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_СтраныМира(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ВидыВзаиморасчетов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ВидыВычетовНДФЛ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ВидыДокументовФизическихЛиц(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ВидыДоходовНДФЛ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ВидыДоходовПоСтраховымВзносам(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ВидыКонтактнойИнформации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ВидыНалоговИПлатежейВБюджет(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ВидыНалоговыхОрганов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ВидыТарифовСтраховыхВзносов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_РегламентированныеОтчеты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ОбъектыСтатистическогоНаблюдения(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ПоляФормСтатистики(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_СтатистическиеПоказатели(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ФормыСтатистики(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
КонецПроцедуры

// Обработчик события ПередОбработкой правила регистрации 
// Параметры:
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных, соответствующий объекту.
//  Выгрузка - Булево - контекст выполнения правила регистрации, если Истина то происходит выгрузка объекта.
Процедура ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка) Экспорт
	Если ПРО.Идентификатор = "РегистрСведений_ЗадачиБухгалтера" Тогда 
		ПРО_РегистрСведений_ЗадачиБухгалтера_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	КонецЕсли;
КонецПроцедуры

// Обработчик события ПослеОбработки правила регистрации 
// Параметры:    
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных, соответствующий объекту.
//  Получатели - Массив - список узлов-получателей, на которых будет зарегистрирован объект.
//  Выгрузка - Булево - контекст выполнения правила регистрации, если Истина то происходит выгрузка объекта.
Процедура ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка) Экспорт
	Если ПРО.Идентификатор = "РегистрСведений_ПеренесенныеРабочиеДни" Тогда 
		ПРО_РегистрСведений_ПеренесенныеРабочиеДни_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "РегистрСведений_РазмерВычетовНДФЛ" Тогда 
		ПРО_РегистрСведений_РазмерВычетовНДФЛ_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "РегистрСведений_СтавкаРефинансированияЦБ" Тогда 
		ПРО_РегистрСведений_СтавкаРефинансированияЦБ_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_СтраныМира" Тогда 
		ПРО_Справочник_СтраныМира_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ВидыВзаиморасчетов" Тогда 
		ПРО_Справочник_ВидыВзаиморасчетов_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ВидыВычетовНДФЛ" Тогда 
		ПРО_Справочник_ВидыВычетовНДФЛ_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ВидыДокументовФизическихЛиц" Тогда 
		ПРО_Справочник_ВидыДокументовФизическихЛиц_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ВидыДоходовНДФЛ" Тогда 
		ПРО_Справочник_ВидыДоходовНДФЛ_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ВидыДоходовПоСтраховымВзносам" Тогда 
		ПРО_Справочник_ВидыДоходовПоСтраховымВзносам_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ВидыКонтактнойИнформации" Тогда 
		ПРО_Справочник_ВидыКонтактнойИнформации_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ВидыНалоговИПлатежейВБюджет" Тогда 
		ПРО_Справочник_ВидыНалоговИПлатежейВБюджет_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ВидыНалоговыхОрганов" Тогда 
		ПРО_Справочник_ВидыНалоговыхОрганов_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ВидыТарифовСтраховыхВзносов" Тогда 
		ПРО_Справочник_ВидыТарифовСтраховыхВзносов_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_РегламентированныеОтчеты" Тогда 
		ПРО_Справочник_РегламентированныеОтчеты_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов" Тогда 
		ПРО_Справочник_ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ОбъектыСтатистическогоНаблюдения" Тогда 
		ПРО_Справочник_ОбъектыСтатистическогоНаблюдения_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ПоляФормСтатистики" Тогда 
		ПРО_Справочник_ПоляФормСтатистики_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_СтатистическиеПоказатели" Тогда 
		ПРО_Справочник_СтатистическиеПоказатели_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_ФормыСтатистики" Тогда 
		ПРО_Справочник_ФормыСтатистики_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура УстановитьОтборы(ПравилоРегистрации, ОтборПоСвойствамПланаОбмена, ОтборПоСвойствамОбъекта)
	Обработка = Обработки.ЗагрузкаПравилРегистрацииОбъектов.Создать();
	
	ПравилаXML = Новый ЧтениеXML;
	
	//ОтборПоСвойствамПланаОбмена
	ПравилоРегистрации.ОтборПоСвойствамПланаОбмена = ОбменДаннымиСервер.ИнициализацияТаблицыОтборПоСвойствамПланаОбмена().Скопировать();
	
	ПравилаXML.УстановитьСтроку(ОтборПоСвойствамПланаОбмена);
	ПравилаXML.Прочитать();
	Обработка.ЗагрузитьДеревоОтбораПоСвойствамПланаОбмена(ПравилаXML, ПравилоРегистрации.ОтборПоСвойствамПланаОбмена);
	
	Обработка.Регистрация = Новый Структура("ИмяПланаОбмена", ПравилоРегистрации.ИмяПланаОбмена);
	Обработка.ПодготовитьПравилоРегистрацииПоСвойствамПланаОбмена(ПравилоРегистрации);
	
	//ОтборПоСвойствамОбъекта
	ПравилаXML.УстановитьСтроку(ОтборПоСвойствамОбъекта);
	ПравилаXML.Прочитать();
	
	ПравилоРегистрации.ОтборПоСвойствамОбъекта = ОбменДаннымиСервер.ИнициализацияТаблицыОтборПоСвойствамОбъекта().Скопировать();
	Обработка.ЗагрузитьДеревоОтбораПоСвойствамОбъекта(ПравилаXML, ПравилоРегистрации.ОтборПоСвойствамОбъекта);
КонецПроцедуры 

#Область РегистрСведений_ПеренесенныеРабочиеДни
Процедура ДобавитьПРО_РегистрСведений_ПеренесенныеРабочиеДни(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_ПеренесенныеРабочиеДни";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.ПеренесенныеРабочиеДни";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_РегистрСведений_ПеренесенныеРабочиеДни_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область РегистрСведений_РазмерВычетовНДФЛ
Процедура ДобавитьПРО_РегистрСведений_РазмерВычетовНДФЛ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_РазмерВычетовНДФЛ";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.РазмерВычетовНДФЛ";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_РегистрСведений_РазмерВычетовНДФЛ_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область РегистрСведений_СтавкаРефинансированияЦБ
Процедура ДобавитьПРО_РегистрСведений_СтавкаРефинансированияЦБ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_СтавкаРефинансированияЦБ";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.СтавкаРефинансированияЦБ";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_РегистрСведений_СтавкаРефинансированияЦБ_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область РегистрСведений_ЗадачиБухгалтера
Процедура ДобавитьПРО_РегистрСведений_ЗадачиБухгалтера(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_ЗадачиБухгалтера";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.ЗадачиБухгалтера";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_РегистрСведений_ЗадачиБухгалтера_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	Для каждого Запись Из Объект Цикл
		Если ТипЗнч(Запись.Правило) = Тип("СправочникСсылка.ПроверкиКонтролирующимиОрганами") Тогда
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#Область Справочник_СтраныМира
Процедура ДобавитьПРО_Справочник_СтраныМира(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_СтраныМира";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.СтраныМира";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_СтраныМира_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыВзаиморасчетов
Процедура ДобавитьПРО_Справочник_ВидыВзаиморасчетов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ВидыВзаиморасчетов";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ВидыВзаиморасчетов";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ВидыВзаиморасчетов_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыВычетовНДФЛ
Процедура ДобавитьПРО_Справочник_ВидыВычетовНДФЛ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ВидыВычетовНДФЛ";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ВидыВычетовНДФЛ";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ВидыВычетовНДФЛ_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыДокументовФизическихЛиц
Процедура ДобавитьПРО_Справочник_ВидыДокументовФизическихЛиц(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ВидыДокументовФизическихЛиц";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ВидыДокументовФизическихЛиц";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ВидыДокументовФизическихЛиц_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыДоходовНДФЛ
Процедура ДобавитьПРО_Справочник_ВидыДоходовНДФЛ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ВидыДоходовНДФЛ";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ВидыДоходовНДФЛ";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ВидыДоходовНДФЛ_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыДоходовПоСтраховымВзносам
Процедура ДобавитьПРО_Справочник_ВидыДоходовПоСтраховымВзносам(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ВидыДоходовПоСтраховымВзносам";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ВидыДоходовПоСтраховымВзносам";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ВидыДоходовПоСтраховымВзносам_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыКонтактнойИнформации
Процедура ДобавитьПРО_Справочник_ВидыКонтактнойИнформации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ВидыКонтактнойИнформации";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ВидыКонтактнойИнформации";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ВидыКонтактнойИнформации_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыНалоговИПлатежейВБюджет
Процедура ДобавитьПРО_Справочник_ВидыНалоговИПлатежейВБюджет(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ВидыНалоговИПлатежейВБюджет";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ВидыНалоговИПлатежейВБюджет";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ВидыНалоговИПлатежейВБюджет_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыНалоговыхОрганов
Процедура ДобавитьПРО_Справочник_ВидыНалоговыхОрганов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ВидыНалоговыхОрганов";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ВидыНалоговыхОрганов";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ВидыНалоговыхОрганов_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ВидыТарифовСтраховыхВзносов
Процедура ДобавитьПРО_Справочник_ВидыТарифовСтраховыхВзносов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ВидыТарифовСтраховыхВзносов";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ВидыТарифовСтраховыхВзносов";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ВидыТарифовСтраховыхВзносов_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_РегламентированныеОтчеты
Процедура ДобавитьПРО_Справочник_РегламентированныеОтчеты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_РегламентированныеОтчеты";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.РегламентированныеОтчеты";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_РегламентированныеОтчеты_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов
Процедура ДобавитьПРО_Справочник_ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ЕдиныеНормыАмортизационныхОтчисленийОсновныхФондов_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ОбъектыСтатистическогоНаблюдения
Процедура ДобавитьПРО_Справочник_ОбъектыСтатистическогоНаблюдения(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ОбъектыСтатистическогоНаблюдения";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ОбъектыСтатистическогоНаблюдения";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ОбъектыСтатистическогоНаблюдения_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ПоляФормСтатистики
Процедура ДобавитьПРО_Справочник_ПоляФормСтатистики(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ПоляФормСтатистики";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ПоляФормСтатистики";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ПоляФормСтатистики_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_СтатистическиеПоказатели
Процедура ДобавитьПРО_Справочник_СтатистическиеПоказатели(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_СтатистическиеПоказатели";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.СтатистическиеПоказатели";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_СтатистическиеПоказатели_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_ФормыСтатистики
Процедура ДобавитьПРО_Справочник_ФормыСтатистики(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ФормыСтатистики";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ФормыСтатистики";
	НовоеПравило.ИмяПланаОбмена = "Полный";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ФормыСтатистики_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
	
	Если ГлавныйУзел <> Неопределено Тогда
		Индекс = Получатели.Найти(ГлавныйУзел);
		
		Если Индекс <> Неопределено Тогда
			Получатели.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

Функция ПустойОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта/>" ;
КонецФункции

Функция ПустойОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена/>" ;
КонецФункции

#КонецОбласти
