#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументВладелец = Параметры.ДокументВладелец;
	Если Не ЗначениеЗаполнено(ДокументВладелец) Тогда
		ВызватьИсключение НСтр("ru = 'Форма загрузки чеков НПД не может быть открыта без записи документа'");
	КонецЕсли;
	
	ЧекиНПД.Загрузить(ДокументВладелец.ЧекиНПД.Выгрузить());
	
	УстановитьТекущуюСтраницу(ЭтотОбъект);
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ОбработкаЗавершена Тогда
		Отказ = Истина;
		ПодключитьОбработчикОжидания("Подключаемый_ОбработатьОтменуЗаписиЧеков", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбраннаяСтрока = Элементы.ЧекиНПД.ТекущиеДанные;
	Если ВыбраннаяСтрока <> Неопределено И ЗначениеЗаполнено(ВыбраннаяСтрока.Файл) Тогда
		ДанныеФайла = ДанныеФайла(ВыбраннаяСтрока.Файл, УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗагрузитьЧекНПДПоСсылкеНажатие(Элемент)
	
	ЗагрузитьЧекНПДПоСсылке();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗагрузитьЧекНПДИзФайлаНажатие(Элемент)
	
	ЗагрузитьЧекНПДИзФайла();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыЧекиНПД

&НаКлиенте
Процедура ЧекиНПДПриИзменении(Элемент)
	
	ЗаполнитьНумерациюСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиНПДПриАктивизацииСтроки(Элемент)
	
	ВыбраннаяСтрока = Элементы.ЧекиНПД.ТекущиеДанные;
	Если ВыбраннаяСтрока <> Неопределено И ЗначениеЗаполнено(ВыбраннаяСтрока.Файл) Тогда
		ВывестиКартинку(АдресКартинки, ВыбраннаяСтрока.Файл);
	Иначе
		АдресКартинки = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиНПДПередУдалением(Элемент, Отказ)
	
	ЧекиУдалялись = Истина;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Файл) Тогда
		СтрокаКУдалению = УдаляемыеФайлы.Добавить();
		СтрокаКУдалению.Ссылка = ТекущиеДанные.Файл;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиНПДПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		ТекущиеДанные.Номер = НСтр("ru = 'Чек НПД'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиНПДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяСтрока = ЧекиНПД.НайтиПоИдентификатору(ВыбраннаяСтрока);
		СсылкаНаЧек = ВыбраннаяСтрока.СсылкаНаЧек;
		АдресСервиса = ИнтеграцияСПлатформойСамозанятыеБПВызовСервераПовтИсп.АдресСервисаФНС();
		Если ЗначениеЗаполнено(СсылкаНаЧек) И СтрНайти(СсылкаНаЧек, АдресСервиса) > 0 Тогда
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ВыбраннаяСтрока.СсылкаНаЧек);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиНПДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.ЧекиНПДСтраницы.ТекущаяСтраница <> Элементы.СтраницаЧекиНПД Тогда
		Элементы.ЧекиНПДСтраницы.ТекущаяСтраница = Элементы.СтраницаЧекиНПД;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ЗагрузитьЧекНПДИзФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоСсылке(Команда)
	
	ЗагрузитьЧекНПДПоСсылке();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	АдресЧеков = ПоместитьЧекиВХранилище(ЧекиНПД);
	
	Результат = Новый Структура;
	Результат.Вставить("АдресЧеков", АдресЧеков);
	ФайлыКУдалению = Новый Массив;
	Для Каждого СтрокаКУдалению Из УдаляемыеФайлы Цикл
		ФайлыКУдалению.Добавить(СтрокаКУдалению.Ссылка);
	КонецЦикла;
	Результат.Вставить("УдаляемыеФайлы", ФайлыКУдалению);
	Результат.Вставить("ЧекиУдалялись", ЧекиУдалялись);
	
	ОбработкаЗавершена = Истина;
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ОбработкаОтменыЗаписиЧеков();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьЧекНПДПоСсылке()
	
	ОповещениеЗавершенияВводаСсылки = Новый ОписаниеОповещения("ВводСсылкиЗавершение", ЭтотОбъект);
	ПоказатьВводСтроки(ОповещениеЗавершенияВводаСсылки, , НСтр("ru = 'Введите ссылку на чек'"), 100);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводСсылкиЗавершение(СсылкаНаЧек, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаЧек) Тогда
		Возврат;
	ИначеЕсли СтрНайти(СсылкаНаЧек, ИнтеграцияСПлатформойСамозанятыеБПВызовСервераПовтИсп.АдресСервисаФНС()) = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Ссылка не является адресом чека НПД в сервисе ""Мой налог""'"));
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеПоСсылкеНаЧек(СсылкаНаЧек);
	ЗаполнитьНумерациюСтрок();
	УстановитьТекущуюСтраницу(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоСсылкеНаЧек(СсылкаНаЧек)
	
	НомерЧека = ИнтеграцияСПлатформойСамозанятыеБП.НомерЧекаИзСсылки(СсылкаНаЧек);
	ЧекСамозанятого = Неопределено;
	ЧекСамозанятого = ИнтеграцияСПлатформойСамозанятыеБП.ЧекСамозанятогоИзИнтернета(
		СсылкаНаЧек, ЧекСамозанятого, ДокументВладелец);
	
	Если ЗначениеЗаполнено(ЧекСамозанятого) Тогда
		ВывестиКартинку(АдресКартинки, ЧекСамозанятого);
	Иначе
		ТекстСообщения = НСтр("ru='Не удалось скачать чек с сайта ФНС. 
			|Проверьте ссылку или попробуйте загрузить чек позднее'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ЧекиНПД.Добавить();
	НоваяСтрока.Номер = НомерЧека;
	НоваяСтрока.СсылкаНаЧек = СсылкаНаЧек;
	НоваяСтрока.Файл = ЧекСамозанятого;
	СтрокаДобавленногоФайла = СозданныеФайлы.Добавить();
	СтрокаДобавленногоФайла.Ссылка = НоваяСтрока.Файл;
	Элементы.ЧекиНПД.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
	СтатистикаПоПоказателямКлиентСервер.ДобавитьСобытие("ИнтеграцияСамозанятыеБП.ЗагрузкаЧеков.ПоСсылке");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиКартинку(АдресКартинки, Знач ЧекСамозанятого)
	
	Если ЗначениеЗаполнено(ЧекСамозанятого) Тогда
		АдресКартинки = РаботаСФайлами.ДанныеФайла(ЧекСамозанятого).СсылкаНаДвоичныеДанныеФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЧекНПДИзФайла()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавлениеЧекаСамозанятогоЗавершение", ЭтотОбъект);
	РаботаСФайламиКлиент.ДобавитьФайл(ОписаниеОповещения, ДокументВладелец, ЭтотОбъект, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеЧекаСамозанятогоЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ЧекиНПД.Добавить();
	НоваяСтрока.Номер = СтрШаблон(НСтр("ru = 'Чек от %1'"), Формат(ТекущаяДата(), "ДЛФ=D"));
	НоваяСтрока.Файл = Результат.ФайлСсылка;
	
	СтрокаДобавленногоФайла = СозданныеФайлы.Добавить();
	СтрокаДобавленногоФайла.Ссылка = НоваяСтрока.Файл;
	
	Элементы.ЧекиНПД.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	ЗаполнитьНумерациюСтрок();
	УстановитьТекущуюСтраницу(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНумерациюСтрок()
	
	Сч = 1;
	Для Каждого Строка Из ЧекиНПД Цикл
		Строка.НомерСтроки = Сч;
		Сч = Сч + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоместитьЧекиВХранилище(Знач ЧекиНПД)
	
	АдресЧеков = ПоместитьВоВременноеХранилище(ЧекиНПД.Выгрузить(), Новый УникальныйИдентификатор);
	Возврат АдресЧеков;
	
КонецФункции

&НаСервере
Процедура УдалитьСозданныеФайлы()
	
	Для Каждого Строка Из СозданныеФайлы Цикл
		ФайлОбъект = Строка.Ссылка.ПолучитьОбъект();
		ФайлОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеФайла(ФайлКартинки, УникальныйИдентификатор)
	
	ДополнительныеПараметры = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ДополнительныеПараметры.ИдентификаторФормы = УникальныйИдентификатор;
	
	Возврат РаботаСФайлами.ДанныеФайла(ФайлКартинки, ДополнительныеПараметры);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекущуюСтраницу(Форма)
	
	Элементы = Форма.Элементы;
	ПоказатьПустуюСтраницу = Не ЗначениеЗаполнено(Форма.ЧекиНПД);
	
	Элементы.ЧекиНПДСтраницы.ТекущаяСтраница =
		?(ПоказатьПустуюСтраницу, Элементы.СтраницаПустая, Элементы.СтраницаЧекиНПД);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОтменыЗаписиЧеков()
	
	Если ЗначениеЗаполнено(СозданныеФайлы) Тогда
		УдалитьСозданныеФайлы();
	КонецЕсли;
	ОбработкаЗавершена = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьОтменуЗаписиЧеков() Экспорт
	
	ОбработкаОтменыЗаписиЧеков();
	Закрыть();
	
КонецПроцедуры

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	МобильныйКлиентБПФормаОбъекта.НастроитьФорму(ЭтотОбъект);
	
	АдаптироватьМККоманднаяПанельФормы();
	АдаптироватьМКШапкаФормы();
	АдаптироватьМКСписокФормы();
	АдаптироватьМККонтекстСписокФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМККоманднаяПанельФормы()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ЗагрузитьИзФайла",
		"Видимость",
		Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"Удалить",
		"Видимость",
		Ложь);
	МобильныйКлиентБПФормаОбъекта.АдаптироватьМККоманднаяПанель(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	Элементы.СтраницаЧекиНПД.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	МобильныйКлиентБПФормаОбъекта.ВстроитьЭлементФормыВГруппаМКФормаВажное(Элементы,
		Элементы.ВерхняяКоманднаяПанель);
		
	МобильныйКлиентБПФормаОбъекта.ВстроитьЭлементФормыВГруппаМКФормаВажное(Элементы,
		Элементы.ЧекиНПДСтраницы);
	
	МобильныйКлиентБПФормаОбъекта.ВстроитьЭлементФормыВГруппаМКФормаВажное(Элементы,
		Элементы.НижняяКоманднаяПанель);
		
	МобильныйКлиентБПФормаОбъекта.СкрытьЭлементФормы(Элементы, Элементы.АдресКартинки);
	
	МобильныйКлиентБПФормаОбъекта.СкрытьПрочиеЭлементыФормы(ЭтотОбъект);
	
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКСписокФормы()
	
	МобильныйКлиентБПФормаОбъекта.ПодготовитьТабличноеПолеФормыДокументаМногострочное(ЭтотОбъект, "ЧекиНПД");
	
	Элементы.ЧекиНПД.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтрокиТаблицы.Выбор;
	Элементы.ЧекиНПД.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	Элементы.ЧекиНПД.Высота = 0;
	Элементы.ЧекиНПД.Шапка = Ложь;
	
	Элементы.ЧекиНПД.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ПоСодержимому;
	
	МобильныйКлиентБПФормаОбъекта.ВстроитьЭлементВГруппуМК_ТабличноеПоле_Строка(ЭтотОбъект, Элементы.ЧекиНПДНомер, 1, "ЧекиНПД");
	МобильныйКлиентБПФормаОбъекта.ВстроитьЭлементВГруппуМК_ТабличноеПоле_Строка(ЭтотОбъект, Элементы.ЧекиНПДСсылкаНаЧек, 2, "ЧекиНПД");
	МобильныйКлиентБПФормаОбъекта.СкрытьЭлементФормы(Элементы, Элементы.ЧекиНПДПробел);
	
	Элементы.ЧекиНПД.ПоложениеСтрокиПоиска = ПоложениеСтрокиПоиска.ЗаголовокФормы;
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМККонтекстСписокФормы()
	
	МобильныйКлиентБПФормаОбъекта.АдаптироватьКонтекстноеМеню(ЭтотОбъект,, "ЧекиНПД");
	МобильныйКлиентБПФормаОбъекта.ПереместитьЭлементФормы(Элементы,
		Элементы.Удалить,
		Элементы.ЧекиНПД.КонтекстноеМеню);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти