#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает данные об устраненных расхождениях в регистр сведений.
// Процедура принимает выборку устраненных расхождений, преобразует её в набор записей
// и сохраняет в регистре с режимом слияния (дополняет существующие данные).
//
// Параметры:
//   УстраненныеРасхождения - ВыборкаИзРезультатаЗапроса / ТаблицаЗначений - данные об устраненных расхождениях.
//      Должна содержать поля, соответствующие структуре регистра сведений, в который выполняется запись.
//      Если коллекция пуста, процедура завершается без выполнения действий. 
//
Процедура ЗаписатьДанные(УстраненныеРасхождения) Экспорт 
	
	Если УстраненныеРасхождения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.РасширенныеРежимыЗамещения = Истина;
	Пока УстраненныеРасхождения.Следующий() Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, УстраненныеРасхождения);
	КонецЦикла;
	
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
	
КонецПроцедуры

// Удаляет все записи из регистра сведений «СервисСверкиРасчетовУстраненныеРасхождения»
// Создаём пустой набор записей и перезаписываем все существующие данные. 
//
Функция ОчиститьУстраненныеРасхождения() Экспорт
	
	НаборЗаписейРасхождения = РегистрыСведений.СервисСверкиРасчетовУстраненныеРасхождения.СоздатьНаборЗаписей(); 
	НаборЗаписейРасхождения.Записать();
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.Ограничение. 
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли