#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если НаДату > '20110101' Тогда
		Возврат Перечисления.ВерсииФорматовВыгрузки.ВерсияФСГС;
	КонецЕсли;
	
КонецФункции

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",      ОписаниеТиповСтрока, "Редакция формы", 20);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2025Кв1";
	НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом Росстата от 31.07.2024 № 332 (в редакции приказа Росстата от 26.12.2024 № 686, 30.01.2025 № 34)";
	НоваяФорма.РедакцияФормы	  = "31.07.2024 № 332";
	НоваяФорма.ДатаНачалоДействия = '20250101';
	НоваяФорма.ДатаКонецДействия  = '20250630';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2026Кв1";
	НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом Росстата от 28.07.2025 № 364 (в редакции приказа Росстата от 17.11.2025 № 640)";
	НоваяФорма.РедакцияФормы	  = "28.07.2025 № 364";
	НоваяФорма.ДатаНачалоДействия = '20250701';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

Функция ДанныеРеглОтчета(ЭкземплярРеглОтчета) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ДеревоФормИФорматов() Экспорт
	
	ФормыИФорматы = Новый ДеревоЗначений;
	ФормыИФорматы.Колонки.Добавить("Код");
	ФормыИФорматы.Колонки.Добавить("ДатаПриказа");
	ФормыИФорматы.Колонки.Добавить("НомерПриказа");
	ФормыИФорматы.Колонки.Добавить("ДатаНачалаДействия");
	ФормыИФорматы.Колонки.Добавить("ДатаОкончанияДействия");
	ФормыИФорматы.Колонки.Добавить("ИмяОбъекта");
	ФормыИФорматы.Колонки.Добавить("Описание");
	
	Форма20150101 = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "604012", '20240731', "332", "ФормаОтчета2025Кв1");
	Форма20150101 = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "604012", '20250728', "364", "ФормаОтчета2026Кв1");
	ВерсияВыгрузки = РегламентированнаяОтчетность.ПолучитьВерсиюВыгрузкиСтатОтчета("РегламентированныйОтчетСтатистикаФорма2НаукаКр", "ФормаОтчета2026Кв1");
	РегламентированнаяОтчетность.ОпределитьФорматВДеревеФормИФорматов(Форма20150101, ВерсияВыгрузки);
	
	Возврат ФормыИФорматы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

#Область ПечатьУстаревших

Функция СформироватьСписокЛистов(Ссылка) Экспорт 
	РеквизитыКлюча = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ВыбраннаяФорма,ИсточникОтчета,Ссылка,ДанныеОтчета");
	Если РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2013Кв1" 
		Или РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2014Кв1" 
		Или РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2015Кв1" 
		Или РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2016Кв1" 
		Или РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2017Кв1" 
		Или РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2018Кв1" 
		Или РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2019Кв1" 
		Или РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2020Кв1" 
		Или РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2021Кв1" 
		Или РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2022Кв1" 
		Или РеквизитыКлюча.ВыбраннаяФорма = "ФормаОтчета2023Кв1" Тогда 
		Возврат СформироватьСписокЛистов_ФормаОтчета2013Кв1(РеквизитыКлюча);
	КонецЕсли;
КонецФункции

Функция СформироватьСписокЛистов_ФормаОтчета2013Кв1(РеквизитыКлюча)
	КонтекстПечати = РегламентированнаяОтчетность.КонтекстПечати(РеквизитыКлюча);
	МакетТабличногоДокумента = РегламентированнаяОтчетность.ПустойМакетИзСписка(
		КонтекстПечати.ИмяФормы, КонтекстПечати.СписокИспользуемыхМакетов, РеквизитыКлюча.ВыбраннаяФорма + "_ФормаОтчета");
	
	ДанныеОтчета = РеквизитыКлюча.ДанныеОтчета.Получить();
	Показатели = ДанныеОтчета.ПоказателиОтчета.ПолеТабличногоДокументаФормаОтчета;
	
	ПечатнаяФорма = РегламентированнаяОтчетность.НоваяСтраница();
	РегламентированнаяОтчетность.ПоказателиВОбласти(Показатели, ПечатнаяФорма);
	Для Каждого Стр Из СтрРазделить("1а1,1а2,1а,1б,5", ",") Цикл 
		Если МакетТабличногоДокумента.Области.Найти("ОсновнаяЧасть" + Стр) <> Неопределено Тогда 
			Область = МакетТабличногоДокумента.ПолучитьОбласть("ОсновнаяЧасть" + Стр);
			ПечатнаяФорма.Вывести(Область);
		КонецЕсли;
	КонецЦикла;
	РегламентированнаяОтчетность.ПоказателиВОбласти(Показатели, ПечатнаяФорма);
	КонтекстПечати.СтруктураРеквизитовФормы.мПечатныеФормы.Добавить(ПечатнаяФорма, "Форма 2-наука (краткая)");
	
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(КонтекстПечати, , КонтекстПечати.СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	Возврат КонтекстПечати.СтруктураРеквизитовФормы.СписокПечатаемыхЛистов;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли